flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*
** ###################################################################
**     Compilers:           Keil ARM C/C++ Compiler
**                          Freescale C/C++ for Embedded ARM
**                          GNU C Compiler
**                          GNU C Compiler - CodeSourcery Sourcery G++
**                          IAR ANSI C/C++ Compiler for ARM
**
**     Reference manual:    K20P64M50SF0RM Rev. 1, Oct 2011
**     Version:             rev. 2.1, 2013-06-24
**     Build:               b140905
**
**     Abstract:
**         Extension to the CMSIS register access layer header.
**
**     Copyright (c) 2013 Freescale Semiconductor, Inc.
**     All rights reserved.
**
**     Redistribution and use in source and binary forms, with or without modification,
**     are permitted provided that the following conditions are met:
**
**     o Redistributions of source code must retain the above copyright notice, this list
**       of conditions and the following disclaimer.
**
**     o Redistributions in binary form must reproduce the above copyright notice, this
**       list of conditions and the following disclaimer in the documentation and/or
**       other materials provided with the distribution.
**
**     o Neither the name of Freescale Semiconductor, Inc. nor the names of its
**       contributors may be used to endorse or promote products derived from this
**       software without specific prior written permission.
**
**     THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
**     ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
**     WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
**     DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
**     ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
**     (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
**     LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
**     ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
**     (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
**     SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
**
**     http:                 www.freescale.com
**     mail:                 support@freescale.com
**
**     Revisions:
**     - rev. 1.0 (2011-12-15)
**         Initial version
**     - rev. 2.0 (2012-03-19)
**         PDB Peripheral register structure updated.
**         DMA Registers and bits for unsupported DMA channels removed.
**     - rev. 2.1 (2013-06-24)
**         NV_FOPT register - NMI_DIS bit added.
**
** ###################################################################
*/

/*
 * WARNING! DO NOT EDIT THIS FILE DIRECTLY!
 *
 * This file was generated automatically and any changes may be lost.
 */
#ifndef __HW_MK20D5_REGISTERS_H__
#define __HW_MK20D5_REGISTERS_H__

#include "MK20D5.h"
#include "fsl_bitaccess.h"

/*
 * MK20D5 ADC
 *
 * Analog-to-Digital Converter
 *
 * Registers defined in this header file:
 * - HW_ADC_SC1n - ADC status and control registers 1
 * - HW_ADC_CFG1 - ADC configuration register 1
 * - HW_ADC_CFG2 - Configuration register 2
 * - HW_ADC_Rn - ADC data result register
 * - HW_ADC_CV1 - Compare value registers
 * - HW_ADC_CV2 - Compare value registers
 * - HW_ADC_SC2 - Status and control register 2
 * - HW_ADC_SC3 - Status and control register 3
 * - HW_ADC_OFS - ADC offset correction register
 * - HW_ADC_PG - ADC plus-side gain register
 * - HW_ADC_MG - ADC minus-side gain register
 * - HW_ADC_CLPD - ADC plus-side general calibration value register
 * - HW_ADC_CLPS - ADC plus-side general calibration value register
 * - HW_ADC_CLP4 - ADC plus-side general calibration value register
 * - HW_ADC_CLP3 - ADC plus-side general calibration value register
 * - HW_ADC_CLP2 - ADC plus-side general calibration value register
 * - HW_ADC_CLP1 - ADC plus-side general calibration value register
 * - HW_ADC_CLP0 - ADC plus-side general calibration value register
 * - HW_ADC_CLMD - ADC minus-side general calibration value register
 * - HW_ADC_CLMS - ADC minus-side general calibration value register
 * - HW_ADC_CLM4 - ADC minus-side general calibration value register
 * - HW_ADC_CLM3 - ADC minus-side general calibration value register
 * - HW_ADC_CLM2 - ADC minus-side general calibration value register
 * - HW_ADC_CLM1 - ADC minus-side general calibration value register
 * - HW_ADC_CLM0 - ADC minus-side general calibration value register
 *
 * - hw_adc_t - Struct containing all module registers.
 */

#define HW_ADC_INSTANCE_COUNT (1U) /*!< Number of instances of the ADC module. */
#define HW_ADC0 (0U) /*!< Instance number for ADC0. */

/*******************************************************************************
 * HW_ADC_SC1n - ADC status and control registers 1
 ******************************************************************************/

/*!
 * @brief HW_ADC_SC1n - ADC status and control registers 1 (RW)
 *
 * Reset value: 0x0000001FU
 *
 * The SC1A register is used for both software and hardware trigger modes of
 * operation. To allow sequential conversions of the ADC to be triggered by internal
 * peripherals, the ADC can have more then one status and control register: one
 * for each conversion. The SC1B-SC1n registers indicate potentially multiple SC1
 * registers for use only in hardware trigger mode. Refer to the Chip
 * Configuration information about the number of SC1n registers specific to this device.
 * The SC1n registers have identical fields, and are used in a "ping-pong" approach
 * to control ADC operation. At any one point in time, only one of the SC1n
 * registers is actively controlling ADC conversions. Updating SC1A while SC1n is
 * actively controlling a conversion is allowed (and vice-versa for any of the SC1n
 * registers specific to this MCU). Writing SC1A while SC1A is actively
 * controlling a conversion aborts the current conversion. In software trigger mode
 * (ADTRG=0), writes to the SC1A register subsequently initiate a new conversion (if
 * the ADCH bits are equal to a value other than all 1s). Similarly, writing any of
 * the SC1n registers while that specific SC1n register is actively controlling
 * a conversion aborts the current conversion. None of the SC1B-SC1n registers
 * are used for software trigger operation and therefore writes to the SC1B - SC1n
 * registers do not initiate a new conversion.
 */
typedef union _hw_adc_sc1n
{
    uint32_t U;
    struct _hw_adc_sc1n_bitfields
    {
        uint32_t ADCH : 5;             /*!< [4:0] Input channel select */
        uint32_t DIFF : 1;             /*!< [5] Differential mode enable */
        uint32_t AIEN : 1;             /*!< [6] Interrupt enable */
        uint32_t COCO : 1;             /*!< [7] Conversion complete flag */
        uint32_t RESERVED0 : 24;       /*!< [31:8]  */
    } B;
} hw_adc_sc1n_t;

/*!
 * @name Constants and macros for entire ADC_SC1n register
 */
/*@{*/
#define HW_ADC_SC1n_COUNT (2U)

#define HW_ADC_SC1n_ADDR(x, n)   ((uint32_t)(x) + 0x0U + (0x4U * (n)))

#define HW_ADC_SC1n(x, n)        (*(__IO hw_adc_sc1n_t *) HW_ADC_SC1n_ADDR(x, n))
#define HW_ADC_SC1n_RD(x, n)     (HW_ADC_SC1n(x, n).U)
#define HW_ADC_SC1n_WR(x, n, v)  (HW_ADC_SC1n(x, n).U = (v))
#define HW_ADC_SC1n_SET(x, n, v) (HW_ADC_SC1n_WR(x, n, HW_ADC_SC1n_RD(x, n) |  (v)))
#define HW_ADC_SC1n_CLR(x, n, v) (HW_ADC_SC1n_WR(x, n, HW_ADC_SC1n_RD(x, n) & ~(v)))
#define HW_ADC_SC1n_TOG(x, n, v) (HW_ADC_SC1n_WR(x, n, HW_ADC_SC1n_RD(x, n) ^  (v)))
/*@}*/

