flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*
 * Constants & macros for individual CRC_CRCH bitfields
 */

/*!
 * @name Register CRC_CRCH, field CRCH[15:0] (RW)
 */
/*@{*/
#define BP_CRC_CRCH_CRCH     (0U)          /*!< Bit position for CRC_CRCH_CRCH. */
#define BM_CRC_CRCH_CRCH     (0xFFFFU)     /*!< Bit mask for CRC_CRCH_CRCH. */
#define BS_CRC_CRCH_CRCH     (16U)         /*!< Bit field size in bits for CRC_CRCH_CRCH. */

/*! @brief Read current value of the CRC_CRCH_CRCH field. */
#define BR_CRC_CRCH_CRCH(x)  (HW_CRC_CRCH(x).U)

/*! @brief Format value for bitfield CRC_CRCH_CRCH. */
#define BF_CRC_CRCH_CRCH(v)  ((uint16_t)((uint16_t)(v) << BP_CRC_CRCH_CRCH) & BM_CRC_CRCH_CRCH)

/*! @brief Set the CRCH field to a new value. */
#define BW_CRC_CRCH_CRCH(x, v) (HW_CRC_CRCH_WR(x, v))
/*@}*/
/*******************************************************************************
 * HW_CRC_CRCLL - CRC_CRCLL register.
 ******************************************************************************/

/*!
 * @brief HW_CRC_CRCLL - CRC_CRCLL register. (RW)
 *
 * Reset value: 0xFFU
 */
typedef union _hw_crc_crcll
{
    uint8_t U;
    struct _hw_crc_crcll_bitfields
    {
        uint8_t CRCLL : 8;             /*!< [7:0] CRCLL stores the first 8 bits of the 32
                                        * bit CRC */
    } B;
} hw_crc_crcll_t;

/*!
 * @name Constants and macros for entire CRC_CRCLL register
 */
/*@{*/
#define HW_CRC_CRCLL_ADDR(x)     ((uint32_t)(x) + 0x0U)

#define HW_CRC_CRCLL(x)          (*(__IO hw_crc_crcll_t *) HW_CRC_CRCLL_ADDR(x))
#define HW_CRC_CRCLL_RD(x)       (HW_CRC_CRCLL(x).U)
#define HW_CRC_CRCLL_WR(x, v)    (HW_CRC_CRCLL(x).U = (v))
#define HW_CRC_CRCLL_SET(x, v)   (HW_CRC_CRCLL_WR(x, HW_CRC_CRCLL_RD(x) |  (v)))
#define HW_CRC_CRCLL_CLR(x, v)   (HW_CRC_CRCLL_WR(x, HW_CRC_CRCLL_RD(x) & ~(v)))
#define HW_CRC_CRCLL_TOG(x, v)   (HW_CRC_CRCLL_WR(x, HW_CRC_CRCLL_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual CRC_CRCLL bitfields
 */

/*!
 * @name Register CRC_CRCLL, field CRCLL[7:0] (RW)
 */
/*@{*/
#define BP_CRC_CRCLL_CRCLL   (0U)          /*!< Bit position for CRC_CRCLL_CRCLL. */
#define BM_CRC_CRCLL_CRCLL   (0xFFU)       /*!< Bit mask for CRC_CRCLL_CRCLL. */
#define BS_CRC_CRCLL_CRCLL   (8U)          /*!< Bit field size in bits for CRC_CRCLL_CRCLL. */

/*! @brief Read current value of the CRC_CRCLL_CRCLL field. */
#define BR_CRC_CRCLL_CRCLL(x) (HW_CRC_CRCLL(x).U)

/*! @brief Format value for bitfield CRC_CRCLL_CRCLL. */
#define BF_CRC_CRCLL_CRCLL(v) ((uint8_t)((uint8_t)(v) << BP_CRC_CRCLL_CRCLL) & BM_CRC_CRCLL_CRCLL)

/*! @brief Set the CRCLL field to a new value. */
#define BW_CRC_CRCLL_CRCLL(x, v) (HW_CRC_CRCLL_WR(x, v))
/*@}*/
/*******************************************************************************
 * HW_CRC_CRCLU - CRC_CRCLU register.
 ******************************************************************************/

/*!
 * @brief HW_CRC_CRCLU - CRC_CRCLU register. (RW)
 *
 * Reset value: 0xFFU
 */
typedef union _hw_crc_crclu
{
    uint8_t U;
    struct _hw_crc_crclu_bitfields
    {
        uint8_t CRCLU : 8;             /*!< [7:0] CRCLL stores the second 8 bits of the
                                        * 32 bit CRC */
    } B;
} hw_crc_crclu_t;

/*!
 * @name Constants and macros for entire CRC_CRCLU register
 */
/*@{*/
#define HW_CRC_CRCLU_ADDR(x)     ((uint32_t)(x) + 0x1U)

#define HW_CRC_CRCLU(x)          (*(__IO hw_crc_crclu_t *) HW_CRC_CRCLU_ADDR(x))
#define HW_CRC_CRCLU_RD(x)       (HW_CRC_CRCLU(x).U)
#define HW_CRC_CRCLU_WR(x, v)    (HW_CRC_CRCLU(x).U = (v))
#define HW_CRC_CRCLU_SET(x, v)   (HW_CRC_CRCLU_WR(x, HW_CRC_CRCLU_RD(x) |  (v)))
#define HW_CRC_CRCLU_CLR(x, v)   (HW_CRC_CRCLU_WR(x, HW_CRC_CRCLU_RD(x) & ~(v)))
#define HW_CRC_CRCLU_TOG(x, v)   (HW_CRC_CRCLU_WR(x, HW_CRC_CRCLU_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual CRC_CRCLU bitfields
 */

/*!
 * @name Register CRC_CRCLU, field CRCLU[7:0] (RW)
 */
/*@{*/
#define BP_CRC_CRCLU_CRCLU   (0U)          /*!< Bit position for CRC_CRCLU_CRCLU. */
#define BM_CRC_CRCLU_CRCLU   (0xFFU)       /*!< Bit mask for CRC_CRCLU_CRCLU. */
#define BS_CRC_CRCLU_CRCLU   (8U)          /*!< Bit field size in bits for CRC_CRCLU_CRCLU. */

/*! @brief Read current value of the CRC_CRCLU_CRCLU field. */
#define BR_CRC_CRCLU_CRCLU(x) (HW_CRC_CRCLU(x).U)

/*! @brief Format value for bitfield CRC_CRCLU_CRCLU. */
#define BF_CRC_CRCLU_CRCLU(v) ((uint8_t)((uint8_t)(v) << BP_CRC_CRCLU_CRCLU) & BM_CRC_CRCLU_CRCLU)

/*! @brief Set the CRCLU field to a new value. */
#define BW_CRC_CRCLU_CRCLU(x, v) (HW_CRC_CRCLU_WR(x, v))
/*@}*/
/*******************************************************************************
 * HW_CRC_CRCHL - CRC_CRCHL register.
 ******************************************************************************/

/*!
 * @brief HW_CRC_CRCHL - CRC_CRCHL register. (RW)
 *
 * Reset value: 0xFFU
 */
typedef union _hw_crc_crchl
{
    uint8_t U;
    struct _hw_crc_crchl_bitfields
    {
        uint8_t CRCHL : 8;             /*!< [7:0] CRCHL stores the third 8 bits of the 32
                                        * bit CRC */
    } B;
} hw_crc_crchl_t;

/*!
 * @name Constants and macros for entire CRC_CRCHL register
 */
/*@{*/
#define HW_CRC_CRCHL_ADDR(x)     ((uint32_t)(x) + 0x2U)

#define HW_CRC_CRCHL(x)          (*(__IO hw_crc_crchl_t *) HW_CRC_CRCHL_ADDR(x))
#define HW_CRC_CRCHL_RD(x)       (HW_CRC_CRCHL(x).U)
#define HW_CRC_CRCHL_WR(x, v)    (HW_CRC_CRCHL(x).U = (v))
#define HW_CRC_CRCHL_SET(x, v)   (HW_CRC_CRCHL_WR(x, HW_CRC_CRCHL_RD(x) |  (v)))
#define HW_CRC_CRCHL_CLR(x, v)   (HW_CRC_CRCHL_WR(x, HW_CRC_CRCHL_RD(x) & ~(v)))
#define HW_CRC_CRCHL_TOG(x, v)   (HW_CRC_CRCHL_WR(x, HW_CRC_CRCHL_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual CRC_CRCHL bitfields
 */

/*!
 * @name Register CRC_CRCHL, field CRCHL[7:0] (RW)
 */
/*@{*/
#define BP_CRC_CRCHL_CRCHL   (0U)          /*!< Bit position for CRC_CRCHL_CRCHL. */
#define BM_CRC_CRCHL_CRCHL   (0xFFU)       /*!< Bit mask for CRC_CRCHL_CRCHL. */
#define BS_CRC_CRCHL_CRCHL   (8U)          /*!< Bit field size in bits for CRC_CRCHL_CRCHL. */

