flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*! @brief Read current value of the CRC_CRCHL_CRCHL field. */
#define BR_CRC_CRCHL_CRCHL(x) (HW_CRC_CRCHL(x).U)

/*! @brief Format value for bitfield CRC_CRCHL_CRCHL. */
#define BF_CRC_CRCHL_CRCHL(v) ((uint8_t)((uint8_t)(v) << BP_CRC_CRCHL_CRCHL) & BM_CRC_CRCHL_CRCHL)

/*! @brief Set the CRCHL field to a new value. */
#define BW_CRC_CRCHL_CRCHL(x, v) (HW_CRC_CRCHL_WR(x, v))
/*@}*/
/*******************************************************************************
 * HW_CRC_CRCHU - CRC_CRCHU register.
 ******************************************************************************/

/*!
 * @brief HW_CRC_CRCHU - CRC_CRCHU register. (RW)
 *
 * Reset value: 0xFFU
 */
typedef union _hw_crc_crchu
{
    uint8_t U;
    struct _hw_crc_crchu_bitfields
    {
        uint8_t CRCHU : 8;             /*!< [7:0] CRCHU stores the fourth 8 bits of the
                                        * 32 bit CRC */
    } B;
} hw_crc_crchu_t;

/*!
 * @name Constants and macros for entire CRC_CRCHU register
 */
/*@{*/
#define HW_CRC_CRCHU_ADDR(x)     ((uint32_t)(x) + 0x3U)

#define HW_CRC_CRCHU(x)          (*(__IO hw_crc_crchu_t *) HW_CRC_CRCHU_ADDR(x))
#define HW_CRC_CRCHU_RD(x)       (HW_CRC_CRCHU(x).U)
#define HW_CRC_CRCHU_WR(x, v)    (HW_CRC_CRCHU(x).U = (v))
#define HW_CRC_CRCHU_SET(x, v)   (HW_CRC_CRCHU_WR(x, HW_CRC_CRCHU_RD(x) |  (v)))
#define HW_CRC_CRCHU_CLR(x, v)   (HW_CRC_CRCHU_WR(x, HW_CRC_CRCHU_RD(x) & ~(v)))
#define HW_CRC_CRCHU_TOG(x, v)   (HW_CRC_CRCHU_WR(x, HW_CRC_CRCHU_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual CRC_CRCHU bitfields
 */

/*!
 * @name Register CRC_CRCHU, field CRCHU[7:0] (RW)
 */
/*@{*/
#define BP_CRC_CRCHU_CRCHU   (0U)          /*!< Bit position for CRC_CRCHU_CRCHU. */
#define BM_CRC_CRCHU_CRCHU   (0xFFU)       /*!< Bit mask for CRC_CRCHU_CRCHU. */
#define BS_CRC_CRCHU_CRCHU   (8U)          /*!< Bit field size in bits for CRC_CRCHU_CRCHU. */

/*! @brief Read current value of the CRC_CRCHU_CRCHU field. */
#define BR_CRC_CRCHU_CRCHU(x) (HW_CRC_CRCHU(x).U)

/*! @brief Format value for bitfield CRC_CRCHU_CRCHU. */
#define BF_CRC_CRCHU_CRCHU(v) ((uint8_t)((uint8_t)(v) << BP_CRC_CRCHU_CRCHU) & BM_CRC_CRCHU_CRCHU)

/*! @brief Set the CRCHU field to a new value. */
#define BW_CRC_CRCHU_CRCHU(x, v) (HW_CRC_CRCHU_WR(x, v))
/*@}*/
/*******************************************************************************
 * HW_CRC_CRC - CRC Data Register
 ******************************************************************************/

/*!
 * @brief HW_CRC_CRC - CRC Data Register (RW)
 *
 * Reset value: 0xFFFFFFFFU
 *
 * The CRC data register contains the value of the seed, data, and checksum.
 * When the CTRL[WAS] bit is set, any write to the data register is regarded as the
 * seed value. When the CTRL[WAS] bit is cleared, any write to the data register
 * is regarded as data for general CRC computation. In 16-bit CRC mode, the HU
 * and HL fields are not used for programming the seed value, and reads of these
 * fields return an indeterminate value. In 32-bit CRC mode, all fields are used
 * for programming the seed value. When programming data values, the values can be
 * written 8 bits, 16 bits, or 32 bits at a time, provided all bytes are
 * contiguous; with MSB of data value written first. After all data values are written,
 * the CRC result can be read from this data register. In 16-bit CRC mode, the CRC
 * result is available in the LU and LL fields. In 32-bit CRC mode, all fields
 * contain the result. Reads of this register at any time return the intermediate
 * CRC value, provided the CRC module is configured.
 */
typedef union _hw_crc_crc
{
    uint32_t U;
    struct _hw_crc_crc_bitfields
    {
        uint32_t LL : 8;               /*!< [7:0] CRC Low Lower Byte */
        uint32_t LU : 8;               /*!< [15:8] CRC Low Upper Byte */
        uint32_t HL : 8;               /*!< [23:16] CRC High Lower Byte */
        uint32_t HU : 8;               /*!< [31:24] CRC High Upper Byte */
    } B;
} hw_crc_crc_t;

/*!
 * @name Constants and macros for entire CRC_CRC register
 */
/*@{*/
#define HW_CRC_CRC_ADDR(x)       ((uint32_t)(x) + 0x0U)

#define HW_CRC_CRC(x)            (*(__IO hw_crc_crc_t *) HW_CRC_CRC_ADDR(x))
#define HW_CRC_CRC_RD(x)         (HW_CRC_CRC(x).U)
#define HW_CRC_CRC_WR(x, v)      (HW_CRC_CRC(x).U = (v))
#define HW_CRC_CRC_SET(x, v)     (HW_CRC_CRC_WR(x, HW_CRC_CRC_RD(x) |  (v)))
#define HW_CRC_CRC_CLR(x, v)     (HW_CRC_CRC_WR(x, HW_CRC_CRC_RD(x) & ~(v)))
#define HW_CRC_CRC_TOG(x, v)     (HW_CRC_CRC_WR(x, HW_CRC_CRC_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual CRC_CRC bitfields
 */

/*!
 * @name Register CRC_CRC, field LL[7:0] (RW)
 *
 * When the CTRL[WAS] bit is 1, values written to this field are part of the
 * seed value. When the CTRL[WAS] bit is 0, data written to this field is used for
 * CRC checksum generation.
 */
/*@{*/
#define BP_CRC_CRC_LL        (0U)          /*!< Bit position for CRC_CRC_LL. */
#define BM_CRC_CRC_LL        (0x000000FFU) /*!< Bit mask for CRC_CRC_LL. */
#define BS_CRC_CRC_LL        (8U)          /*!< Bit field size in bits for CRC_CRC_LL. */

/*! @brief Read current value of the CRC_CRC_LL field. */
#define BR_CRC_CRC_LL(x)     (HW_CRC_CRC(x).B.LL)

/*! @brief Format value for bitfield CRC_CRC_LL. */
#define BF_CRC_CRC_LL(v)     ((uint32_t)((uint32_t)(v) << BP_CRC_CRC_LL) & BM_CRC_CRC_LL)

/*! @brief Set the LL field to a new value. */
#define BW_CRC_CRC_LL(x, v)  (HW_CRC_CRC_WR(x, (HW_CRC_CRC_RD(x) & ~BM_CRC_CRC_LL) | BF_CRC_CRC_LL(v)))
/*@}*/

/*!
 * @name Register CRC_CRC, field LU[15:8] (RW)
 *
 * When the CTRL[WAS] bit is 1, values written to this field are part of the
 * seed value. When the CTRL[WAS] bit is 0, data written to this field is used for
 * CRC checksum generation.
 */
/*@{*/
#define BP_CRC_CRC_LU        (8U)          /*!< Bit position for CRC_CRC_LU. */
#define BM_CRC_CRC_LU        (0x0000FF00U) /*!< Bit mask for CRC_CRC_LU. */
#define BS_CRC_CRC_LU        (8U)          /*!< Bit field size in bits for CRC_CRC_LU. */

/*! @brief Read current value of the CRC_CRC_LU field. */
#define BR_CRC_CRC_LU(x)     (HW_CRC_CRC(x).B.LU)

