flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*! @brief Set the valid field to a new value. */
#define BW_FMC_TAGVDW3Sn_valid(x, n, v) (BITBAND_ACCESS32(HW_FMC_TAGVDW3Sn_ADDR(x, n), BP_FMC_TAGVDW3Sn_valid) = (v))
/*@}*/

/*!
 * @name Register FMC_TAGVDW3Sn, field tag[18:6] (RW)
 */
/*@{*/
#define BP_FMC_TAGVDW3Sn_tag (6U)          /*!< Bit position for FMC_TAGVDW3Sn_tag. */
#define BM_FMC_TAGVDW3Sn_tag (0x0007FFC0U) /*!< Bit mask for FMC_TAGVDW3Sn_tag. */
#define BS_FMC_TAGVDW3Sn_tag (13U)         /*!< Bit field size in bits for FMC_TAGVDW3Sn_tag. */

/*! @brief Read current value of the FMC_TAGVDW3Sn_tag field. */
#define BR_FMC_TAGVDW3Sn_tag(x, n) (HW_FMC_TAGVDW3Sn(x, n).B.tag)

/*! @brief Format value for bitfield FMC_TAGVDW3Sn_tag. */
#define BF_FMC_TAGVDW3Sn_tag(v) ((uint32_t)((uint32_t)(v) << BP_FMC_TAGVDW3Sn_tag) & BM_FMC_TAGVDW3Sn_tag)

/*! @brief Set the tag field to a new value. */
#define BW_FMC_TAGVDW3Sn_tag(x, n, v) (HW_FMC_TAGVDW3Sn_WR(x, n, (HW_FMC_TAGVDW3Sn_RD(x, n) & ~BM_FMC_TAGVDW3Sn_tag) | BF_FMC_TAGVDW3Sn_tag(v)))
/*@}*/

/*******************************************************************************
 * HW_FMC_DATAW0Sn - Cache Data Storage
 ******************************************************************************/

/*!
 * @brief HW_FMC_DATAW0Sn - Cache Data Storage (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of eight 32-bit entries is a 4-way, set-associative cache with 2
 * sets. The ways are numbered 0-3 and the sets are numbered 0-1. In DATAWxSy, x
 * denotes the way, and y denotes the set. This section represents data for bits
 * [31:0] of sets 0-1 in way 0.
 */
typedef union _hw_fmc_dataw0sn
{
    uint32_t U;
    struct _hw_fmc_dataw0sn_bitfields
    {
        uint32_t data : 32;            /*!< [31:0] Bits [31:0] of data entry */
    } B;
} hw_fmc_dataw0sn_t;

/*!
 * @name Constants and macros for entire FMC_DATAW0Sn register
 */
/*@{*/
#define HW_FMC_DATAW0Sn_COUNT (2U)

#define HW_FMC_DATAW0Sn_ADDR(x, n) ((uint32_t)(x) + 0x204U + (0x8U * (n)))

#define HW_FMC_DATAW0Sn(x, n)    (*(__IO hw_fmc_dataw0sn_t *) HW_FMC_DATAW0Sn_ADDR(x, n))
#define HW_FMC_DATAW0Sn_RD(x, n) (HW_FMC_DATAW0Sn(x, n).U)
#define HW_FMC_DATAW0Sn_WR(x, n, v) (HW_FMC_DATAW0Sn(x, n).U = (v))
#define HW_FMC_DATAW0Sn_SET(x, n, v) (HW_FMC_DATAW0Sn_WR(x, n, HW_FMC_DATAW0Sn_RD(x, n) |  (v)))
#define HW_FMC_DATAW0Sn_CLR(x, n, v) (HW_FMC_DATAW0Sn_WR(x, n, HW_FMC_DATAW0Sn_RD(x, n) & ~(v)))
#define HW_FMC_DATAW0Sn_TOG(x, n, v) (HW_FMC_DATAW0Sn_WR(x, n, HW_FMC_DATAW0Sn_RD(x, n) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FMC_DATAW0Sn bitfields
 */

/*!
 * @name Register FMC_DATAW0Sn, field data[31:0] (RW)
 */
/*@{*/
#define BP_FMC_DATAW0Sn_data (0U)          /*!< Bit position for FMC_DATAW0Sn_data. */
#define BM_FMC_DATAW0Sn_data (0xFFFFFFFFU) /*!< Bit mask for FMC_DATAW0Sn_data. */
#define BS_FMC_DATAW0Sn_data (32U)         /*!< Bit field size in bits for FMC_DATAW0Sn_data. */

/*! @brief Read current value of the FMC_DATAW0Sn_data field. */
#define BR_FMC_DATAW0Sn_data(x, n) (HW_FMC_DATAW0Sn(x, n).U)

/*! @brief Format value for bitfield FMC_DATAW0Sn_data. */
#define BF_FMC_DATAW0Sn_data(v) ((uint32_t)((uint32_t)(v) << BP_FMC_DATAW0Sn_data) & BM_FMC_DATAW0Sn_data)

/*! @brief Set the data field to a new value. */
#define BW_FMC_DATAW0Sn_data(x, n, v) (HW_FMC_DATAW0Sn_WR(x, n, v))
/*@}*/

/*******************************************************************************
 * HW_FMC_DATAW1Sn - Cache Data Storage
 ******************************************************************************/

/*!
 * @brief HW_FMC_DATAW1Sn - Cache Data Storage (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of eight 32-bit entries is a 4-way, set-associative cache with 2
 * sets. The ways are numbered 0-3 and the sets are numbered 0-1. In DATAWxSy, x
 * denotes the way, and y denotes the set. This section represents data for bits
 * [31:0] of sets 0-1 in way 1.
 */
typedef union _hw_fmc_dataw1sn
{
    uint32_t U;
    struct _hw_fmc_dataw1sn_bitfields
    {
        uint32_t data : 32;            /*!< [31:0] Bits [31:0] of data entry */
    } B;
} hw_fmc_dataw1sn_t;

/*!
 * @name Constants and macros for entire FMC_DATAW1Sn register
 */
/*@{*/
#define HW_FMC_DATAW1Sn_COUNT (2U)

#define HW_FMC_DATAW1Sn_ADDR(x, n) ((uint32_t)(x) + 0x244U + (0x8U * (n)))

#define HW_FMC_DATAW1Sn(x, n)    (*(__IO hw_fmc_dataw1sn_t *) HW_FMC_DATAW1Sn_ADDR(x, n))
#define HW_FMC_DATAW1Sn_RD(x, n) (HW_FMC_DATAW1Sn(x, n).U)
#define HW_FMC_DATAW1Sn_WR(x, n, v) (HW_FMC_DATAW1Sn(x, n).U = (v))
#define HW_FMC_DATAW1Sn_SET(x, n, v) (HW_FMC_DATAW1Sn_WR(x, n, HW_FMC_DATAW1Sn_RD(x, n) |  (v)))
#define HW_FMC_DATAW1Sn_CLR(x, n, v) (HW_FMC_DATAW1Sn_WR(x, n, HW_FMC_DATAW1Sn_RD(x, n) & ~(v)))
#define HW_FMC_DATAW1Sn_TOG(x, n, v) (HW_FMC_DATAW1Sn_WR(x, n, HW_FMC_DATAW1Sn_RD(x, n) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FMC_DATAW1Sn bitfields
 */

/*!
 * @name Register FMC_DATAW1Sn, field data[31:0] (RW)
 */
/*@{*/
#define BP_FMC_DATAW1Sn_data (0U)          /*!< Bit position for FMC_DATAW1Sn_data. */
#define BM_FMC_DATAW1Sn_data (0xFFFFFFFFU) /*!< Bit mask for FMC_DATAW1Sn_data. */
#define BS_FMC_DATAW1Sn_data (32U)         /*!< Bit field size in bits for FMC_DATAW1Sn_data. */

/*! @brief Read current value of the FMC_DATAW1Sn_data field. */
#define BR_FMC_DATAW1Sn_data(x, n) (HW_FMC_DATAW1Sn(x, n).U)

/*! @brief Format value for bitfield FMC_DATAW1Sn_data. */
#define BF_FMC_DATAW1Sn_data(v) ((uint32_t)((uint32_t)(v) << BP_FMC_DATAW1Sn_data) & BM_FMC_DATAW1Sn_data)

/*! @brief Set the data field to a new value. */
#define BW_FMC_DATAW1Sn_data(x, n, v) (HW_FMC_DATAW1Sn_WR(x, n, v))
/*@}*/

/*******************************************************************************
 * HW_FMC_DATAW2Sn - Cache Data Storage
 ******************************************************************************/

/*!
 * @brief HW_FMC_DATAW2Sn - Cache Data Storage (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of eight 32-bit entries is a 4-way, set-associative cache with 2
 * sets. The ways are numbered 0-3 and the sets are numbered 0-1. In DATAWxSy, x
 * denotes the way, and y denotes the set. This section represents data for bits
 * [31:0] of sets 0-1 in way 2.
 */
typedef union _hw_fmc_dataw2sn
{
    uint32_t U;
    struct _hw_fmc_dataw2sn_bitfields
    {
        uint32_t data : 32;            /*!< [31:0] Bits [31:0] of data entry */
    } B;
} hw_fmc_dataw2sn_t;

/*!
 * @name Constants and macros for entire FMC_DATAW2Sn register
 */
/*@{*/
#define HW_FMC_DATAW2Sn_COUNT (2U)

#define HW_FMC_DATAW2Sn_ADDR(x, n) ((uint32_t)(x) + 0x284U + (0x8U * (n)))

#define HW_FMC_DATAW2Sn(x, n)    (*(__IO hw_fmc_dataw2sn_t *) HW_FMC_DATAW2Sn_ADDR(x, n))
#define HW_FMC_DATAW2Sn_RD(x, n) (HW_FMC_DATAW2Sn(x, n).U)
#define HW_FMC_DATAW2Sn_WR(x, n, v) (HW_FMC_DATAW2Sn(x, n).U = (v))
#define HW_FMC_DATAW2Sn_SET(x, n, v) (HW_FMC_DATAW2Sn_WR(x, n, HW_FMC_DATAW2Sn_RD(x, n) |  (v)))
#define HW_FMC_DATAW2Sn_CLR(x, n, v) (HW_FMC_DATAW2Sn_WR(x, n, HW_FMC_DATAW2Sn_RD(x, n) & ~(v)))
#define HW_FMC_DATAW2Sn_TOG(x, n, v) (HW_FMC_DATAW2Sn_WR(x, n, HW_FMC_DATAW2Sn_RD(x, n) ^  (v)))
/*@}*/

