flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*
 * Constants & macros for individual FMC_DATAW2Sn bitfields
 */

/*!
 * @name Register FMC_DATAW2Sn, field data[31:0] (RW)
 */
/*@{*/
#define BP_FMC_DATAW2Sn_data (0U)          /*!< Bit position for FMC_DATAW2Sn_data. */
#define BM_FMC_DATAW2Sn_data (0xFFFFFFFFU) /*!< Bit mask for FMC_DATAW2Sn_data. */
#define BS_FMC_DATAW2Sn_data (32U)         /*!< Bit field size in bits for FMC_DATAW2Sn_data. */

/*! @brief Read current value of the FMC_DATAW2Sn_data field. */
#define BR_FMC_DATAW2Sn_data(x, n) (HW_FMC_DATAW2Sn(x, n).U)

/*! @brief Format value for bitfield FMC_DATAW2Sn_data. */
#define BF_FMC_DATAW2Sn_data(v) ((uint32_t)((uint32_t)(v) << BP_FMC_DATAW2Sn_data) & BM_FMC_DATAW2Sn_data)

/*! @brief Set the data field to a new value. */
#define BW_FMC_DATAW2Sn_data(x, n, v) (HW_FMC_DATAW2Sn_WR(x, n, v))
/*@}*/

/*******************************************************************************
 * HW_FMC_DATAW3Sn - Cache Data Storage
 ******************************************************************************/

/*!
 * @brief HW_FMC_DATAW3Sn - Cache Data Storage (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of eight 32-bit entries is a 4-way, set-associative cache with 2
 * sets. The ways are numbered 0-3 and the sets are numbered 0-1. In DATAWxSy, x
 * denotes the way, and y denotes the set. This section represents data for bits
 * [31:0] of sets 0-1 in way 3.
 */
typedef union _hw_fmc_dataw3sn
{
    uint32_t U;
    struct _hw_fmc_dataw3sn_bitfields
    {
        uint32_t data : 32;            /*!< [31:0] Bits [31:0] of data entry */
    } B;
} hw_fmc_dataw3sn_t;

/*!
 * @name Constants and macros for entire FMC_DATAW3Sn register
 */
/*@{*/
#define HW_FMC_DATAW3Sn_COUNT (2U)

#define HW_FMC_DATAW3Sn_ADDR(x, n) ((uint32_t)(x) + 0x2C4U + (0x8U * (n)))

#define HW_FMC_DATAW3Sn(x, n)    (*(__IO hw_fmc_dataw3sn_t *) HW_FMC_DATAW3Sn_ADDR(x, n))
#define HW_FMC_DATAW3Sn_RD(x, n) (HW_FMC_DATAW3Sn(x, n).U)
#define HW_FMC_DATAW3Sn_WR(x, n, v) (HW_FMC_DATAW3Sn(x, n).U = (v))
#define HW_FMC_DATAW3Sn_SET(x, n, v) (HW_FMC_DATAW3Sn_WR(x, n, HW_FMC_DATAW3Sn_RD(x, n) |  (v)))
#define HW_FMC_DATAW3Sn_CLR(x, n, v) (HW_FMC_DATAW3Sn_WR(x, n, HW_FMC_DATAW3Sn_RD(x, n) & ~(v)))
#define HW_FMC_DATAW3Sn_TOG(x, n, v) (HW_FMC_DATAW3Sn_WR(x, n, HW_FMC_DATAW3Sn_RD(x, n) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FMC_DATAW3Sn bitfields
 */

/*!
 * @name Register FMC_DATAW3Sn, field data[31:0] (RW)
 */
/*@{*/
#define BP_FMC_DATAW3Sn_data (0U)          /*!< Bit position for FMC_DATAW3Sn_data. */
#define BM_FMC_DATAW3Sn_data (0xFFFFFFFFU) /*!< Bit mask for FMC_DATAW3Sn_data. */
#define BS_FMC_DATAW3Sn_data (32U)         /*!< Bit field size in bits for FMC_DATAW3Sn_data. */

/*! @brief Read current value of the FMC_DATAW3Sn_data field. */
#define BR_FMC_DATAW3Sn_data(x, n) (HW_FMC_DATAW3Sn(x, n).U)

/*! @brief Format value for bitfield FMC_DATAW3Sn_data. */
#define BF_FMC_DATAW3Sn_data(v) ((uint32_t)((uint32_t)(v) << BP_FMC_DATAW3Sn_data) & BM_FMC_DATAW3Sn_data)

/*! @brief Set the data field to a new value. */
#define BW_FMC_DATAW3Sn_data(x, n, v) (HW_FMC_DATAW3Sn_WR(x, n, v))
/*@}*/

/*******************************************************************************
 * hw_fmc_t - module struct
 ******************************************************************************/
/*!
 * @brief All FMC module registers.
 */
#pragma pack(1)
typedef struct _hw_fmc
{
    __IO hw_fmc_pfapr_t PFAPR;             /*!< [0x0] Flash Access Protection Register */
    __IO hw_fmc_pfb0cr_t PFB0CR;           /*!< [0x4] Flash Control Register */
    uint8_t _reserved0[248];
    __IO hw_fmc_tagvdw0sn_t TAGVDW0Sn[2];  /*!< [0x100] Cache Tag Storage */
    uint8_t _reserved1[24];
    __IO hw_fmc_tagvdw1sn_t TAGVDW1Sn[2];  /*!< [0x120] Cache Tag Storage */
    uint8_t _reserved2[24];
    __IO hw_fmc_tagvdw2sn_t TAGVDW2Sn[2];  /*!< [0x140] Cache Tag Storage */
    uint8_t _reserved3[24];
    __IO hw_fmc_tagvdw3sn_t TAGVDW3Sn[2];  /*!< [0x160] Cache Tag Storage */
    uint8_t _reserved4[156];
    struct {
        __IO hw_fmc_dataw0sn_t DATAW0Sn;   /*!< [0x204] Cache Data Storage */
        uint8_t _reserved0[4];
    } DATAW0S[2];
    uint8_t _reserved5[48];
    struct {
        __IO hw_fmc_dataw1sn_t DATAW1Sn;   /*!< [0x244] Cache Data Storage */
        uint8_t _reserved0[4];
    } DATAW1S[2];
    uint8_t _reserved6[48];
    struct {
        __IO hw_fmc_dataw2sn_t DATAW2Sn;   /*!< [0x284] Cache Data Storage */
        uint8_t _reserved0[4];
    } DATAW2S[2];
    uint8_t _reserved7[48];
    struct {
        __IO hw_fmc_dataw3sn_t DATAW3Sn;   /*!< [0x2C4] Cache Data Storage */
        uint8_t _reserved0[4];
    } DATAW3S[2];
} hw_fmc_t;
#pragma pack()

/*! @brief Macro to access all FMC registers. */
/*! @param x FMC module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_FMC_REGS(FMC_BASE)</code>. */
#define HW_FMC_REGS(x) (*(hw_fmc_t *)(x))

/*
 * MK20D5 FTFL
 *
 * Flash Memory Interface
 *
 * Registers defined in this header file:
 * - HW_FTFL_FSTAT - Flash Status Register
 * - HW_FTFL_FCNFG - Flash Configuration Register
 * - HW_FTFL_FSEC - Flash Security Register
 * - HW_FTFL_FOPT - Flash Option Register
 * - HW_FTFL_FCCOB3 - Flash Common Command Object Registers
 * - HW_FTFL_FCCOB2 - Flash Common Command Object Registers
 * - HW_FTFL_FCCOB1 - Flash Common Command Object Registers
 * - HW_FTFL_FCCOB0 - Flash Common Command Object Registers
 * - HW_FTFL_FCCOB7 - Flash Common Command Object Registers
 * - HW_FTFL_FCCOB6 - Flash Common Command Object Registers
 * - HW_FTFL_FCCOB5 - Flash Common Command Object Registers
 * - HW_FTFL_FCCOB4 - Flash Common Command Object Registers
 * - HW_FTFL_FCCOBB - Flash Common Command Object Registers
 * - HW_FTFL_FCCOBA - Flash Common Command Object Registers
 * - HW_FTFL_FCCOB9 - Flash Common Command Object Registers
 * - HW_FTFL_FCCOB8 - Flash Common Command Object Registers
 * - HW_FTFL_FPROT3 - Program Flash Protection Registers
 * - HW_FTFL_FPROT2 - Program Flash Protection Registers
 * - HW_FTFL_FPROT1 - Program Flash Protection Registers
 * - HW_FTFL_FPROT0 - Program Flash Protection Registers
 * - HW_FTFL_FEPROT - EEPROM Protection Register
 * - HW_FTFL_FDPROT - Data Flash Protection Register
 *
 * - hw_ftfl_t - Struct containing all module registers.
 */

#define HW_FTFL_INSTANCE_COUNT (1U) /*!< Number of instances of the FTFL module. */
#define HW_FTFL (0U) /*!< Instance number for FTFL. */

