flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*******************************************************************************
 * HW_FTFL_FSTAT - Flash Status Register
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FSTAT - Flash Status Register (RW)
 *
 * Reset value: 0x00U
 *
 * The FSTAT register reports the operational status of the FTFL module. The
 * CCIF, RDCOLERR, ACCERR, and FPVIOL bits are readable and writable. The MGSTAT0
 * bit is read only. The unassigned bits read 0 and are not writable. When set, the
 * Access Error (ACCERR) and Flash Protection Violation (FPVIOL) bits in this
 * register prevent the launch of any more commands until the flag is cleared (by
 * writing a one to it).
 */
typedef union _hw_ftfl_fstat
{
    uint8_t U;
    struct _hw_ftfl_fstat_bitfields
    {
        uint8_t MGSTAT0 : 1;           /*!< [0] Memory Controller Command Completion
                                        * Status Flag */
        uint8_t RESERVED0 : 3;         /*!< [3:1]  */
        uint8_t FPVIOL : 1;            /*!< [4] Flash Protection Violation Flag */
        uint8_t ACCERR : 1;            /*!< [5] Flash Access Error Flag */
        uint8_t RDCOLERR : 1;          /*!< [6] FTFL Read Collision Error Flag */
        uint8_t CCIF : 1;              /*!< [7] Command Complete Interrupt Flag */
    } B;
} hw_ftfl_fstat_t;

/*!
 * @name Constants and macros for entire FTFL_FSTAT register
 */
/*@{*/
#define HW_FTFL_FSTAT_ADDR(x)    ((uint32_t)(x) + 0x0U)

#define HW_FTFL_FSTAT(x)         (*(__IO hw_ftfl_fstat_t *) HW_FTFL_FSTAT_ADDR(x))
#define HW_FTFL_FSTAT_RD(x)      (HW_FTFL_FSTAT(x).U)
#define HW_FTFL_FSTAT_WR(x, v)   (HW_FTFL_FSTAT(x).U = (v))
#define HW_FTFL_FSTAT_SET(x, v)  (HW_FTFL_FSTAT_WR(x, HW_FTFL_FSTAT_RD(x) |  (v)))
#define HW_FTFL_FSTAT_CLR(x, v)  (HW_FTFL_FSTAT_WR(x, HW_FTFL_FSTAT_RD(x) & ~(v)))
#define HW_FTFL_FSTAT_TOG(x, v)  (HW_FTFL_FSTAT_WR(x, HW_FTFL_FSTAT_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FSTAT bitfields
 */

/*!
 * @name Register FTFL_FSTAT, field MGSTAT0[0] (RO)
 *
 * The MGSTAT0 status flag is set if an error is detected during execution of an
 * FTFL command or during the flash reset sequence. As a status flag, this bit
 * cannot (and need not) be cleared by the user like the other error flags in this
 * register. The value of the MGSTAT0 bit for "command-N" is valid only at the
 * end of the "command-N" execution when CCIF=1 and before the next command has
 * been launched. At some point during the execution of "command-N+1," the previous
 * result is discarded and any previous error is cleared.
 */
/*@{*/
#define BP_FTFL_FSTAT_MGSTAT0 (0U)         /*!< Bit position for FTFL_FSTAT_MGSTAT0. */
#define BM_FTFL_FSTAT_MGSTAT0 (0x01U)      /*!< Bit mask for FTFL_FSTAT_MGSTAT0. */
#define BS_FTFL_FSTAT_MGSTAT0 (1U)         /*!< Bit field size in bits for FTFL_FSTAT_MGSTAT0. */

/*! @brief Read current value of the FTFL_FSTAT_MGSTAT0 field. */
#define BR_FTFL_FSTAT_MGSTAT0(x) (BITBAND_ACCESS8(HW_FTFL_FSTAT_ADDR(x), BP_FTFL_FSTAT_MGSTAT0))
/*@}*/

/*!
 * @name Register FTFL_FSTAT, field FPVIOL[4] (W1C)
 *
 * The FPVIOL error bit indicates an attempt was made to program or erase an
 * address in a protected area of program flash or data flash memory during a
 * command write sequence or a write was attempted to a protected area of the FlexRAM
 * while enabled for EEPROM . While FPVIOL is set, the CCIF flag cannot be cleared
 * to launch a command. The FPVIOL bit is cleared by writing a 1 to it. Writing
 * a 0 to the FPVIOL bit has no effect.
 *
 * Values:
 * - 0 - No protection violation detected
 * - 1 - Protection violation detected
 */
/*@{*/
#define BP_FTFL_FSTAT_FPVIOL (4U)          /*!< Bit position for FTFL_FSTAT_FPVIOL. */
#define BM_FTFL_FSTAT_FPVIOL (0x10U)       /*!< Bit mask for FTFL_FSTAT_FPVIOL. */
#define BS_FTFL_FSTAT_FPVIOL (1U)          /*!< Bit field size in bits for FTFL_FSTAT_FPVIOL. */

/*! @brief Read current value of the FTFL_FSTAT_FPVIOL field. */
#define BR_FTFL_FSTAT_FPVIOL(x) (BITBAND_ACCESS8(HW_FTFL_FSTAT_ADDR(x), BP_FTFL_FSTAT_FPVIOL))

/*! @brief Format value for bitfield FTFL_FSTAT_FPVIOL. */
#define BF_FTFL_FSTAT_FPVIOL(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FSTAT_FPVIOL) & BM_FTFL_FSTAT_FPVIOL)

/*! @brief Set the FPVIOL field to a new value. */
#define BW_FTFL_FSTAT_FPVIOL(x, v) (BITBAND_ACCESS8(HW_FTFL_FSTAT_ADDR(x), BP_FTFL_FSTAT_FPVIOL) = (v))
/*@}*/

/*!
 * @name Register FTFL_FSTAT, field ACCERR[5] (W1C)
 *
 * The ACCERR error bit indicates an illegal access has occurred to an FTFL
 * resource caused by a violation of the command write sequence or issuing an illegal
 * FTFL command. While ACCERR is set, the CCIF flag cannot be cleared to launch
 * a command. The ACCERR bit is cleared by writing a 1 to it. Writing a 0 to the
 * ACCERR bit has no effect.
 *
 * Values:
 * - 0 - No access error detected
 * - 1 - Access error detected
 */
/*@{*/
#define BP_FTFL_FSTAT_ACCERR (5U)          /*!< Bit position for FTFL_FSTAT_ACCERR. */
#define BM_FTFL_FSTAT_ACCERR (0x20U)       /*!< Bit mask for FTFL_FSTAT_ACCERR. */
#define BS_FTFL_FSTAT_ACCERR (1U)          /*!< Bit field size in bits for FTFL_FSTAT_ACCERR. */

/*! @brief Read current value of the FTFL_FSTAT_ACCERR field. */
#define BR_FTFL_FSTAT_ACCERR(x) (BITBAND_ACCESS8(HW_FTFL_FSTAT_ADDR(x), BP_FTFL_FSTAT_ACCERR))

/*! @brief Format value for bitfield FTFL_FSTAT_ACCERR. */
#define BF_FTFL_FSTAT_ACCERR(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FSTAT_ACCERR) & BM_FTFL_FSTAT_ACCERR)

/*! @brief Set the ACCERR field to a new value. */
#define BW_FTFL_FSTAT_ACCERR(x, v) (BITBAND_ACCESS8(HW_FTFL_FSTAT_ADDR(x), BP_FTFL_FSTAT_ACCERR) = (v))
/*@}*/

/*!
 * @name Register FTFL_FSTAT, field RDCOLERR[6] (W1C)
 *
 * The RDCOLERR error bit indicates that the MCU attempted a read from an FTFL
 * resource that was being manipulated by an FTFL command (CCIF=0). Any
 * simultaneous access is detected as a collision error by the block arbitration logic. The
 * read data in this case cannot be guaranteed. The RDCOLERR bit is cleared by
 * writing a 1 to it. Writing a 0 to RDCOLERR has no effect.
 *
 * Values:
 * - 0 - No collision error detected
 * - 1 - Collision error detected
 */
/*@{*/
#define BP_FTFL_FSTAT_RDCOLERR (6U)        /*!< Bit position for FTFL_FSTAT_RDCOLERR. */
#define BM_FTFL_FSTAT_RDCOLERR (0x40U)     /*!< Bit mask for FTFL_FSTAT_RDCOLERR. */
#define BS_FTFL_FSTAT_RDCOLERR (1U)        /*!< Bit field size in bits for FTFL_FSTAT_RDCOLERR. */

/*! @brief Read current value of the FTFL_FSTAT_RDCOLERR field. */
#define BR_FTFL_FSTAT_RDCOLERR(x) (BITBAND_ACCESS8(HW_FTFL_FSTAT_ADDR(x), BP_FTFL_FSTAT_RDCOLERR))

/*! @brief Format value for bitfield FTFL_FSTAT_RDCOLERR. */
#define BF_FTFL_FSTAT_RDCOLERR(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FSTAT_RDCOLERR) & BM_FTFL_FSTAT_RDCOLERR)

/*! @brief Set the RDCOLERR field to a new value. */
#define BW_FTFL_FSTAT_RDCOLERR(x, v) (BITBAND_ACCESS8(HW_FTFL_FSTAT_ADDR(x), BP_FTFL_FSTAT_RDCOLERR) = (v))
/*@}*/

/*!
 * @name Register FTFL_FSTAT, field CCIF[7] (W1C)
 *
 * The CCIF flag indicates that a FTFL command or EEPROM file system operation
 * has completed. The CCIF flag is cleared by writing a 1 to CCIF to launch a
 * command, and CCIF stays low until command completion or command violation. The
 * CCIF flag is also cleared by a successful write to FlexRAM while enabled for EEE,
 * and CCIF stays low until the EEPROM file system has created the associated
 * EEPROM data record. The CCIF bit is reset to 0 but is set to 1 by the memory
 * controller at the end of the reset initialization sequence. Depending on how
 * quickly the read occurs after reset release, the user may or may not see the 0
 * hardware reset value.
 *
 * Values:
 * - 0 - FTFL command or EEPROM file system operation in progress
 * - 1 - FTFL command or EEPROM file system operation has completed
 */
/*@{*/
#define BP_FTFL_FSTAT_CCIF   (7U)          /*!< Bit position for FTFL_FSTAT_CCIF. */
#define BM_FTFL_FSTAT_CCIF   (0x80U)       /*!< Bit mask for FTFL_FSTAT_CCIF. */
#define BS_FTFL_FSTAT_CCIF   (1U)          /*!< Bit field size in bits for FTFL_FSTAT_CCIF. */

/*! @brief Read current value of the FTFL_FSTAT_CCIF field. */
#define BR_FTFL_FSTAT_CCIF(x) (BITBAND_ACCESS8(HW_FTFL_FSTAT_ADDR(x), BP_FTFL_FSTAT_CCIF))

/*! @brief Format value for bitfield FTFL_FSTAT_CCIF. */
#define BF_FTFL_FSTAT_CCIF(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FSTAT_CCIF) & BM_FTFL_FSTAT_CCIF)

/*! @brief Set the CCIF field to a new value. */
#define BW_FTFL_FSTAT_CCIF(x, v) (BITBAND_ACCESS8(HW_FTFL_FSTAT_ADDR(x), BP_FTFL_FSTAT_CCIF) = (v))
/*@}*/

