flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*******************************************************************************
 * HW_FTFL_FCNFG - Flash Configuration Register
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FCNFG - Flash Configuration Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register provides information on the current functional state of the
 * FTFL module. The erase control bits (ERSAREQ and ERSSUSP) have write
 * restrictions. RAMRDY , and EEERDY are read-only status bits . The unassigned bits read as
 * noted and are not writable. The reset values for the RAMRDY , and EEERDY bits
 * are determined during the reset sequence.
 */
typedef union _hw_ftfl_fcnfg
{
    uint8_t U;
    struct _hw_ftfl_fcnfg_bitfields
    {
        uint8_t EEERDY : 1;            /*!< [0]  */
        uint8_t RAMRDY : 1;            /*!< [1] RAM Ready */
        uint8_t PFLSH : 1;             /*!< [2] FTFL configuration */
        uint8_t RESERVED0 : 1;         /*!< [3]  */
        uint8_t ERSSUSP : 1;           /*!< [4] Erase Suspend */
        uint8_t ERSAREQ : 1;           /*!< [5] Erase All Request */
        uint8_t RDCOLLIE : 1;          /*!< [6] Read Collision Error Interrupt Enable
                                        * */
        uint8_t CCIE : 1;              /*!< [7] Command Complete Interrupt Enable */
    } B;
} hw_ftfl_fcnfg_t;

/*!
 * @name Constants and macros for entire FTFL_FCNFG register
 */
/*@{*/
#define HW_FTFL_FCNFG_ADDR(x)    ((uint32_t)(x) + 0x1U)

#define HW_FTFL_FCNFG(x)         (*(__IO hw_ftfl_fcnfg_t *) HW_FTFL_FCNFG_ADDR(x))
#define HW_FTFL_FCNFG_RD(x)      (HW_FTFL_FCNFG(x).U)
#define HW_FTFL_FCNFG_WR(x, v)   (HW_FTFL_FCNFG(x).U = (v))
#define HW_FTFL_FCNFG_SET(x, v)  (HW_FTFL_FCNFG_WR(x, HW_FTFL_FCNFG_RD(x) |  (v)))
#define HW_FTFL_FCNFG_CLR(x, v)  (HW_FTFL_FCNFG_WR(x, HW_FTFL_FCNFG_RD(x) & ~(v)))
#define HW_FTFL_FCNFG_TOG(x, v)  (HW_FTFL_FCNFG_WR(x, HW_FTFL_FCNFG_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FCNFG bitfields
 */

/*!
 * @name Register FTFL_FCNFG, field EEERDY[0] (RO)
 *
 * This flag indicates if the EEPROM backup data has been copied to the FlexRAM
 * and is therefore available for read access.
 *
 * Values:
 * - 0 - FlexRAM is not available for EEPROM operation.
 * - 1 - FlexRAM is available for EEPROM operations where: reads from the
 *     FlexRAM return data previously written to the FlexRAM in EEPROM mode and writes
 *     to the FlexRAM clear EEERDY and launch an EEPROM operation to store the
 *     written data in the FlexRAM and EEPROM backup.
 */
/*@{*/
#define BP_FTFL_FCNFG_EEERDY (0U)          /*!< Bit position for FTFL_FCNFG_EEERDY. */
#define BM_FTFL_FCNFG_EEERDY (0x01U)       /*!< Bit mask for FTFL_FCNFG_EEERDY. */
#define BS_FTFL_FCNFG_EEERDY (1U)          /*!< Bit field size in bits for FTFL_FCNFG_EEERDY. */

/*! @brief Read current value of the FTFL_FCNFG_EEERDY field. */
#define BR_FTFL_FCNFG_EEERDY(x) (BITBAND_ACCESS8(HW_FTFL_FCNFG_ADDR(x), BP_FTFL_FCNFG_EEERDY))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field RAMRDY[1] (RO)
 *
 * This flag indicates the current status of the FlexRAM . The state of the
 * RAMRDY flag is normally controlled by the Set FlexRAM Function command. During the
 * reset sequence, the RAMRDY flag is cleared if the FlexNVM block is
 * partitioned for EEPROM and is set if the FlexNVM block is not partitioned for EEPROM.
 * The RAMRDY flag is cleared if the Program Partition command is run to partition
 * the FlexNVM block for EEPROM. The RAMRDY flag sets after completion of the
 * Erase All Blocks command or execution of the erase-all operation triggered
 * external to the FTFL .
 *
 * Values:
 * - 0 - FlexRAM is not available for traditional RAM access.
 * - 1 - FlexRAM is available as traditional RAM only; writes to the FlexRAM do
 *     not trigger EEPROM operations.
 */
/*@{*/
#define BP_FTFL_FCNFG_RAMRDY (1U)          /*!< Bit position for FTFL_FCNFG_RAMRDY. */
#define BM_FTFL_FCNFG_RAMRDY (0x02U)       /*!< Bit mask for FTFL_FCNFG_RAMRDY. */
#define BS_FTFL_FCNFG_RAMRDY (1U)          /*!< Bit field size in bits for FTFL_FCNFG_RAMRDY. */

/*! @brief Read current value of the FTFL_FCNFG_RAMRDY field. */
#define BR_FTFL_FCNFG_RAMRDY(x) (BITBAND_ACCESS8(HW_FTFL_FCNFG_ADDR(x), BP_FTFL_FCNFG_RAMRDY))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field PFLSH[2] (RO)
 *
 * Values:
 * - 0 - FTFL configured for FlexMemory that supports data flash and/or EEPROM
 * - 1 - Reserved
 */
/*@{*/
#define BP_FTFL_FCNFG_PFLSH  (2U)          /*!< Bit position for FTFL_FCNFG_PFLSH. */
#define BM_FTFL_FCNFG_PFLSH  (0x04U)       /*!< Bit mask for FTFL_FCNFG_PFLSH. */
#define BS_FTFL_FCNFG_PFLSH  (1U)          /*!< Bit field size in bits for FTFL_FCNFG_PFLSH. */

/*! @brief Read current value of the FTFL_FCNFG_PFLSH field. */
#define BR_FTFL_FCNFG_PFLSH(x) (BITBAND_ACCESS8(HW_FTFL_FCNFG_ADDR(x), BP_FTFL_FCNFG_PFLSH))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field ERSSUSP[4] (RW)
 *
 * The ERSSUSP bit allows the user to suspend (interrupt) the Erase Flash Sector
 * command while it is executing.
 *
 * Values:
 * - 0 - No suspend requested
 * - 1 - Suspend the current Erase Flash Sector command execution.
 */
/*@{*/
#define BP_FTFL_FCNFG_ERSSUSP (4U)         /*!< Bit position for FTFL_FCNFG_ERSSUSP. */
#define BM_FTFL_FCNFG_ERSSUSP (0x10U)      /*!< Bit mask for FTFL_FCNFG_ERSSUSP. */
#define BS_FTFL_FCNFG_ERSSUSP (1U)         /*!< Bit field size in bits for FTFL_FCNFG_ERSSUSP. */

/*! @brief Read current value of the FTFL_FCNFG_ERSSUSP field. */
#define BR_FTFL_FCNFG_ERSSUSP(x) (BITBAND_ACCESS8(HW_FTFL_FCNFG_ADDR(x), BP_FTFL_FCNFG_ERSSUSP))

/*! @brief Format value for bitfield FTFL_FCNFG_ERSSUSP. */
#define BF_FTFL_FCNFG_ERSSUSP(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FCNFG_ERSSUSP) & BM_FTFL_FCNFG_ERSSUSP)

/*! @brief Set the ERSSUSP field to a new value. */
#define BW_FTFL_FCNFG_ERSSUSP(x, v) (BITBAND_ACCESS8(HW_FTFL_FCNFG_ADDR(x), BP_FTFL_FCNFG_ERSSUSP) = (v))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field ERSAREQ[5] (RO)
 *
 * This bit issues a request to the memory controller to execute the Erase All
 * Blocks command and release security. ERSAREQ is not directly writable but is
 * under indirect user control. Refer to the device's Chip Configuration details on
 * how to request this command. The ERSAREQ bit sets when an erase all request
 * is triggered external to the FTFL and CCIF is set (no command is currently
 * being executed). ERSAREQ is cleared by the FTFL when the operation completes.
 *
 * Values:
 * - 0 - No request or request complete
 * - 1 - Request to: run the Erase All Blocks command, verify the erased state,
 *     program the security byte in the Flash Configuration Field to the unsecure
 *     state, and release MCU security by setting the FSEC[SEC] field to the
 *     unsecure state.
 */
/*@{*/
#define BP_FTFL_FCNFG_ERSAREQ (5U)         /*!< Bit position for FTFL_FCNFG_ERSAREQ. */
#define BM_FTFL_FCNFG_ERSAREQ (0x20U)      /*!< Bit mask for FTFL_FCNFG_ERSAREQ. */
#define BS_FTFL_FCNFG_ERSAREQ (1U)         /*!< Bit field size in bits for FTFL_FCNFG_ERSAREQ. */

/*! @brief Read current value of the FTFL_FCNFG_ERSAREQ field. */
#define BR_FTFL_FCNFG_ERSAREQ(x) (BITBAND_ACCESS8(HW_FTFL_FCNFG_ADDR(x), BP_FTFL_FCNFG_ERSAREQ))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field RDCOLLIE[6] (RW)
 *
 * The RDCOLLIE bit controls interrupt generation when an FTFL read collision
 * error occurs.
 *
 * Values:
 * - 0 - Read collision error interrupt disabled
 * - 1 - Read collision error interrupt enabled. An interrupt request is
 *     generated whenever an FTFL read collision error is detected (see the description
 *     of FSTAT[RDCOLERR]).
 */
/*@{*/
#define BP_FTFL_FCNFG_RDCOLLIE (6U)        /*!< Bit position for FTFL_FCNFG_RDCOLLIE. */
#define BM_FTFL_FCNFG_RDCOLLIE (0x40U)     /*!< Bit mask for FTFL_FCNFG_RDCOLLIE. */
#define BS_FTFL_FCNFG_RDCOLLIE (1U)        /*!< Bit field size in bits for FTFL_FCNFG_RDCOLLIE. */

/*! @brief Read current value of the FTFL_FCNFG_RDCOLLIE field. */
#define BR_FTFL_FCNFG_RDCOLLIE(x) (BITBAND_ACCESS8(HW_FTFL_FCNFG_ADDR(x), BP_FTFL_FCNFG_RDCOLLIE))

