flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*! @brief Format value for bitfield FTFL_FCNFG_RDCOLLIE. */
#define BF_FTFL_FCNFG_RDCOLLIE(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FCNFG_RDCOLLIE) & BM_FTFL_FCNFG_RDCOLLIE)

/*! @brief Set the RDCOLLIE field to a new value. */
#define BW_FTFL_FCNFG_RDCOLLIE(x, v) (BITBAND_ACCESS8(HW_FTFL_FCNFG_ADDR(x), BP_FTFL_FCNFG_RDCOLLIE) = (v))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field CCIE[7] (RW)
 *
 * The CCIE bit controls interrupt generation when an FTFL command completes.
 *
 * Values:
 * - 0 - Command complete interrupt disabled
 * - 1 - Command complete interrupt enabled. An interrupt request is generated
 *     whenever the FSTAT[CCIF] flag is set.
 */
/*@{*/
#define BP_FTFL_FCNFG_CCIE   (7U)          /*!< Bit position for FTFL_FCNFG_CCIE. */
#define BM_FTFL_FCNFG_CCIE   (0x80U)       /*!< Bit mask for FTFL_FCNFG_CCIE. */
#define BS_FTFL_FCNFG_CCIE   (1U)          /*!< Bit field size in bits for FTFL_FCNFG_CCIE. */

/*! @brief Read current value of the FTFL_FCNFG_CCIE field. */
#define BR_FTFL_FCNFG_CCIE(x) (BITBAND_ACCESS8(HW_FTFL_FCNFG_ADDR(x), BP_FTFL_FCNFG_CCIE))

/*! @brief Format value for bitfield FTFL_FCNFG_CCIE. */
#define BF_FTFL_FCNFG_CCIE(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FCNFG_CCIE) & BM_FTFL_FCNFG_CCIE)

/*! @brief Set the CCIE field to a new value. */
#define BW_FTFL_FCNFG_CCIE(x, v) (BITBAND_ACCESS8(HW_FTFL_FCNFG_ADDR(x), BP_FTFL_FCNFG_CCIE) = (v))
/*@}*/

/*******************************************************************************
 * HW_FTFL_FSEC - Flash Security Register
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FSEC - Flash Security Register (RO)
 *
 * Reset value: 0x00U
 *
 * This read-only register holds all bits associated with the security of the
 * MCU and FTFL module. During the reset sequence, the register is loaded with the
 * contents of the flash security byte in the Flash Configuration Field located
 * in program flash memory. The Flash basis for the values is signified by X in
 * the reset value.
 */
typedef union _hw_ftfl_fsec
{
    uint8_t U;
    struct _hw_ftfl_fsec_bitfields
    {
        uint8_t SEC : 2;               /*!< [1:0] Flash Security */
        uint8_t FSLACC : 2;            /*!< [3:2] Freescale Failure Analysis Access Code
                                        * */
        uint8_t MEEN : 2;              /*!< [5:4] Mass Erase Enable Bits */
        uint8_t KEYEN : 2;             /*!< [7:6] Backdoor Key Security Enable */
    } B;
} hw_ftfl_fsec_t;

/*!
 * @name Constants and macros for entire FTFL_FSEC register
 */
/*@{*/
#define HW_FTFL_FSEC_ADDR(x)     ((uint32_t)(x) + 0x2U)

#define HW_FTFL_FSEC(x)          (*(__I hw_ftfl_fsec_t *) HW_FTFL_FSEC_ADDR(x))
#define HW_FTFL_FSEC_RD(x)       (HW_FTFL_FSEC(x).U)
/*@}*/

/*
 * Constants & macros for individual FTFL_FSEC bitfields
 */

/*!
 * @name Register FTFL_FSEC, field SEC[1:0] (RO)
 *
 * These bits define the security state of the MCU. In the secure state, the MCU
 * limits access to FTFL module resources. The limitations are defined per
 * device and are detailed in the Chip Configuration details. If the FTFL module is
 * unsecured using backdoor key access, the SEC bits are forced to 10b.
 *
 * Values:
 * - 00 - MCU security status is secure
 * - 01 - MCU security status is secure
 * - 10 - MCU security status is unsecure (The standard shipping condition of
 *     the FTFL is unsecure.)
 * - 11 - MCU security status is secure
 */
/*@{*/
#define BP_FTFL_FSEC_SEC     (0U)          /*!< Bit position for FTFL_FSEC_SEC. */
#define BM_FTFL_FSEC_SEC     (0x03U)       /*!< Bit mask for FTFL_FSEC_SEC. */
#define BS_FTFL_FSEC_SEC     (2U)          /*!< Bit field size in bits for FTFL_FSEC_SEC. */

/*! @brief Read current value of the FTFL_FSEC_SEC field. */
#define BR_FTFL_FSEC_SEC(x)  (HW_FTFL_FSEC(x).B.SEC)
/*@}*/

/*!
 * @name Register FTFL_FSEC, field FSLACC[3:2] (RO)
 *
 * These bits enable or disable access to the flash memory contents during
 * returned part failure analysis at Freescale. When SEC is secure and FSLACC is
 * denied, access to the program flash contents is denied and any failure analysis
 * performed by Freescale factory test must begin with a full erase to unsecure the
 * part. When access is granted (SEC is unsecure, or SEC is secure and FSLACC is
 * granted), Freescale factory testing has visibility of the current flash
 * contents. The state of the FSLACC bits is only relevant when the SEC bits are set to
 * secure. When the SEC field is set to unsecure, the FSLACC setting does not
 * matter.
 *
 * Values:
 * - 00 - Freescale factory access granted
 * - 01 - Freescale factory access denied
 * - 10 - Freescale factory access denied
 * - 11 - Freescale factory access granted
 */
/*@{*/
#define BP_FTFL_FSEC_FSLACC  (2U)          /*!< Bit position for FTFL_FSEC_FSLACC. */
#define BM_FTFL_FSEC_FSLACC  (0x0CU)       /*!< Bit mask for FTFL_FSEC_FSLACC. */
#define BS_FTFL_FSEC_FSLACC  (2U)          /*!< Bit field size in bits for FTFL_FSEC_FSLACC. */

/*! @brief Read current value of the FTFL_FSEC_FSLACC field. */
#define BR_FTFL_FSEC_FSLACC(x) (HW_FTFL_FSEC(x).B.FSLACC)
/*@}*/

/*!
 * @name Register FTFL_FSEC, field MEEN[5:4] (RO)
 *
 * Enables and disables mass erase capability of the FTFL module. The state of
 * the MEEN bits is only relevant when the SEC bits are set to secure outside of
 * NVM Normal Mode. When the SEC field is set to unsecure, the MEEN setting does
 * not matter.
 *
 * Values:
 * - 00 - Mass erase is enabled
 * - 01 - Mass erase is enabled
 * - 10 - Mass erase is disabled
 * - 11 - Mass erase is enabled
 */
/*@{*/
#define BP_FTFL_FSEC_MEEN    (4U)          /*!< Bit position for FTFL_FSEC_MEEN. */
#define BM_FTFL_FSEC_MEEN    (0x30U)       /*!< Bit mask for FTFL_FSEC_MEEN. */
#define BS_FTFL_FSEC_MEEN    (2U)          /*!< Bit field size in bits for FTFL_FSEC_MEEN. */

/*! @brief Read current value of the FTFL_FSEC_MEEN field. */
#define BR_FTFL_FSEC_MEEN(x) (HW_FTFL_FSEC(x).B.MEEN)
/*@}*/

/*!
 * @name Register FTFL_FSEC, field KEYEN[7:6] (RO)
 *
 * These bits enable and disable backdoor key access to the FTFL module.
 *
 * Values:
 * - 00 - Backdoor key access disabled
 * - 01 - Backdoor key access disabled (preferred KEYEN state to disable
 *     backdoor key access)
 * - 10 - Backdoor key access enabled
 * - 11 - Backdoor key access disabled
 */
/*@{*/
#define BP_FTFL_FSEC_KEYEN   (6U)          /*!< Bit position for FTFL_FSEC_KEYEN. */
#define BM_FTFL_FSEC_KEYEN   (0xC0U)       /*!< Bit mask for FTFL_FSEC_KEYEN. */
#define BS_FTFL_FSEC_KEYEN   (2U)          /*!< Bit field size in bits for FTFL_FSEC_KEYEN. */

/*! @brief Read current value of the FTFL_FSEC_KEYEN field. */
#define BR_FTFL_FSEC_KEYEN(x) (HW_FTFL_FSEC(x).B.KEYEN)
/*@}*/

