flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*******************************************************************************
 * HW_FTFL_FOPT - Flash Option Register
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FOPT - Flash Option Register (RO)
 *
 * Reset value: 0x00U
 *
 * The flash option register allows the MCU to customize its operations by
 * examining the state of these read-only bits, which are loaded from NVM at reset.
 * The function of the bits is defined in the device's Chip Configuration details.
 * All bits in the register are read-only . During the reset sequence, the
 * register is loaded from the flash nonvolatile option byte in the Flash Configuration
 * Field located in program flash memory. The flash basis for the values is
 * signified by X in the reset value.
 */
typedef union _hw_ftfl_fopt
{
    uint8_t U;
    struct _hw_ftfl_fopt_bitfields
    {
        uint8_t OPT : 8;               /*!< [7:0] Nonvolatile Option */
    } B;
} hw_ftfl_fopt_t;

/*!
 * @name Constants and macros for entire FTFL_FOPT register
 */
/*@{*/
#define HW_FTFL_FOPT_ADDR(x)     ((uint32_t)(x) + 0x3U)

#define HW_FTFL_FOPT(x)          (*(__I hw_ftfl_fopt_t *) HW_FTFL_FOPT_ADDR(x))
#define HW_FTFL_FOPT_RD(x)       (HW_FTFL_FOPT(x).U)
/*@}*/

/*
 * Constants & macros for individual FTFL_FOPT bitfields
 */

/*!
 * @name Register FTFL_FOPT, field OPT[7:0] (RO)
 *
 * These bits are loaded from flash to this register at reset. Refer to the
 * device's Chip Configuration details for the definition and use of these bits.
 */
/*@{*/
#define BP_FTFL_FOPT_OPT     (0U)          /*!< Bit position for FTFL_FOPT_OPT. */
#define BM_FTFL_FOPT_OPT     (0xFFU)       /*!< Bit mask for FTFL_FOPT_OPT. */
#define BS_FTFL_FOPT_OPT     (8U)          /*!< Bit field size in bits for FTFL_FOPT_OPT. */

/*! @brief Read current value of the FTFL_FOPT_OPT field. */
#define BR_FTFL_FOPT_OPT(x)  (HW_FTFL_FOPT(x).U)
/*@}*/

/*******************************************************************************
 * HW_FTFL_FCCOB3 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FCCOB3 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
typedef union _hw_ftfl_fccob3
{
    uint8_t U;
    struct _hw_ftfl_fccob3_bitfields
    {
        uint8_t CCOBn : 8;             /*!< [7:0]  */
    } B;
} hw_ftfl_fccob3_t;

/*!
 * @name Constants and macros for entire FTFL_FCCOB3 register
 */
/*@{*/
#define HW_FTFL_FCCOB3_ADDR(x)   ((uint32_t)(x) + 0x4U)

#define HW_FTFL_FCCOB3(x)        (*(__IO hw_ftfl_fccob3_t *) HW_FTFL_FCCOB3_ADDR(x))
#define HW_FTFL_FCCOB3_RD(x)     (HW_FTFL_FCCOB3(x).U)
#define HW_FTFL_FCCOB3_WR(x, v)  (HW_FTFL_FCCOB3(x).U = (v))
#define HW_FTFL_FCCOB3_SET(x, v) (HW_FTFL_FCCOB3_WR(x, HW_FTFL_FCCOB3_RD(x) |  (v)))
#define HW_FTFL_FCCOB3_CLR(x, v) (HW_FTFL_FCCOB3_WR(x, HW_FTFL_FCCOB3_RD(x) & ~(v)))
#define HW_FTFL_FCCOB3_TOG(x, v) (HW_FTFL_FCCOB3_WR(x, HW_FTFL_FCCOB3_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FCCOB3 bitfields
 */

/*!
 * @name Register FTFL_FCCOB3, field CCOBn[7:0] (RW)
 */
/*@{*/
#define BP_FTFL_FCCOB3_CCOBn (0U)          /*!< Bit position for FTFL_FCCOB3_CCOBn. */
#define BM_FTFL_FCCOB3_CCOBn (0xFFU)       /*!< Bit mask for FTFL_FCCOB3_CCOBn. */
#define BS_FTFL_FCCOB3_CCOBn (8U)          /*!< Bit field size in bits for FTFL_FCCOB3_CCOBn. */

/*! @brief Read current value of the FTFL_FCCOB3_CCOBn field. */
#define BR_FTFL_FCCOB3_CCOBn(x) (HW_FTFL_FCCOB3(x).U)

/*! @brief Format value for bitfield FTFL_FCCOB3_CCOBn. */
#define BF_FTFL_FCCOB3_CCOBn(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FCCOB3_CCOBn) & BM_FTFL_FCCOB3_CCOBn)

/*! @brief Set the CCOBn field to a new value. */
#define BW_FTFL_FCCOB3_CCOBn(x, v) (HW_FTFL_FCCOB3_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_FTFL_FCCOB2 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FCCOB2 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
typedef union _hw_ftfl_fccob2
{
    uint8_t U;
    struct _hw_ftfl_fccob2_bitfields
    {
        uint8_t CCOBn : 8;             /*!< [7:0]  */
    } B;
} hw_ftfl_fccob2_t;

/*!
 * @name Constants and macros for entire FTFL_FCCOB2 register
 */
/*@{*/
#define HW_FTFL_FCCOB2_ADDR(x)   ((uint32_t)(x) + 0x5U)

#define HW_FTFL_FCCOB2(x)        (*(__IO hw_ftfl_fccob2_t *) HW_FTFL_FCCOB2_ADDR(x))
#define HW_FTFL_FCCOB2_RD(x)     (HW_FTFL_FCCOB2(x).U)
#define HW_FTFL_FCCOB2_WR(x, v)  (HW_FTFL_FCCOB2(x).U = (v))
#define HW_FTFL_FCCOB2_SET(x, v) (HW_FTFL_FCCOB2_WR(x, HW_FTFL_FCCOB2_RD(x) |  (v)))
#define HW_FTFL_FCCOB2_CLR(x, v) (HW_FTFL_FCCOB2_WR(x, HW_FTFL_FCCOB2_RD(x) & ~(v)))
#define HW_FTFL_FCCOB2_TOG(x, v) (HW_FTFL_FCCOB2_WR(x, HW_FTFL_FCCOB2_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FCCOB2 bitfields
 */

/*!
 * @name Register FTFL_FCCOB2, field CCOBn[7:0] (RW)
 */
/*@{*/
#define BP_FTFL_FCCOB2_CCOBn (0U)          /*!< Bit position for FTFL_FCCOB2_CCOBn. */
#define BM_FTFL_FCCOB2_CCOBn (0xFFU)       /*!< Bit mask for FTFL_FCCOB2_CCOBn. */
#define BS_FTFL_FCCOB2_CCOBn (8U)          /*!< Bit field size in bits for FTFL_FCCOB2_CCOBn. */

/*! @brief Read current value of the FTFL_FCCOB2_CCOBn field. */
#define BR_FTFL_FCCOB2_CCOBn(x) (HW_FTFL_FCCOB2(x).U)

/*! @brief Format value for bitfield FTFL_FCCOB2_CCOBn. */
#define BF_FTFL_FCCOB2_CCOBn(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FCCOB2_CCOBn) & BM_FTFL_FCCOB2_CCOBn)

/*! @brief Set the CCOBn field to a new value. */
#define BW_FTFL_FCCOB2_CCOBn(x, v) (HW_FTFL_FCCOB2_WR(x, v))
/*@}*/

