flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*******************************************************************************
 * HW_FTFL_FCCOB1 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FCCOB1 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
typedef union _hw_ftfl_fccob1
{
    uint8_t U;
    struct _hw_ftfl_fccob1_bitfields
    {
        uint8_t CCOBn : 8;             /*!< [7:0]  */
    } B;
} hw_ftfl_fccob1_t;

/*!
 * @name Constants and macros for entire FTFL_FCCOB1 register
 */
/*@{*/
#define HW_FTFL_FCCOB1_ADDR(x)   ((uint32_t)(x) + 0x6U)

#define HW_FTFL_FCCOB1(x)        (*(__IO hw_ftfl_fccob1_t *) HW_FTFL_FCCOB1_ADDR(x))
#define HW_FTFL_FCCOB1_RD(x)     (HW_FTFL_FCCOB1(x).U)
#define HW_FTFL_FCCOB1_WR(x, v)  (HW_FTFL_FCCOB1(x).U = (v))
#define HW_FTFL_FCCOB1_SET(x, v) (HW_FTFL_FCCOB1_WR(x, HW_FTFL_FCCOB1_RD(x) |  (v)))
#define HW_FTFL_FCCOB1_CLR(x, v) (HW_FTFL_FCCOB1_WR(x, HW_FTFL_FCCOB1_RD(x) & ~(v)))
#define HW_FTFL_FCCOB1_TOG(x, v) (HW_FTFL_FCCOB1_WR(x, HW_FTFL_FCCOB1_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FCCOB1 bitfields
 */

/*!
 * @name Register FTFL_FCCOB1, field CCOBn[7:0] (RW)
 */
/*@{*/
#define BP_FTFL_FCCOB1_CCOBn (0U)          /*!< Bit position for FTFL_FCCOB1_CCOBn. */
#define BM_FTFL_FCCOB1_CCOBn (0xFFU)       /*!< Bit mask for FTFL_FCCOB1_CCOBn. */
#define BS_FTFL_FCCOB1_CCOBn (8U)          /*!< Bit field size in bits for FTFL_FCCOB1_CCOBn. */

/*! @brief Read current value of the FTFL_FCCOB1_CCOBn field. */
#define BR_FTFL_FCCOB1_CCOBn(x) (HW_FTFL_FCCOB1(x).U)

/*! @brief Format value for bitfield FTFL_FCCOB1_CCOBn. */
#define BF_FTFL_FCCOB1_CCOBn(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FCCOB1_CCOBn) & BM_FTFL_FCCOB1_CCOBn)

/*! @brief Set the CCOBn field to a new value. */
#define BW_FTFL_FCCOB1_CCOBn(x, v) (HW_FTFL_FCCOB1_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_FTFL_FCCOB0 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FCCOB0 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
typedef union _hw_ftfl_fccob0
{
    uint8_t U;
    struct _hw_ftfl_fccob0_bitfields
    {
        uint8_t CCOBn : 8;             /*!< [7:0]  */
    } B;
} hw_ftfl_fccob0_t;

/*!
 * @name Constants and macros for entire FTFL_FCCOB0 register
 */
/*@{*/
#define HW_FTFL_FCCOB0_ADDR(x)   ((uint32_t)(x) + 0x7U)

#define HW_FTFL_FCCOB0(x)        (*(__IO hw_ftfl_fccob0_t *) HW_FTFL_FCCOB0_ADDR(x))
#define HW_FTFL_FCCOB0_RD(x)     (HW_FTFL_FCCOB0(x).U)
#define HW_FTFL_FCCOB0_WR(x, v)  (HW_FTFL_FCCOB0(x).U = (v))
#define HW_FTFL_FCCOB0_SET(x, v) (HW_FTFL_FCCOB0_WR(x, HW_FTFL_FCCOB0_RD(x) |  (v)))
#define HW_FTFL_FCCOB0_CLR(x, v) (HW_FTFL_FCCOB0_WR(x, HW_FTFL_FCCOB0_RD(x) & ~(v)))
#define HW_FTFL_FCCOB0_TOG(x, v) (HW_FTFL_FCCOB0_WR(x, HW_FTFL_FCCOB0_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FCCOB0 bitfields
 */

/*!
 * @name Register FTFL_FCCOB0, field CCOBn[7:0] (RW)
 */
/*@{*/
#define BP_FTFL_FCCOB0_CCOBn (0U)          /*!< Bit position for FTFL_FCCOB0_CCOBn. */
#define BM_FTFL_FCCOB0_CCOBn (0xFFU)       /*!< Bit mask for FTFL_FCCOB0_CCOBn. */
#define BS_FTFL_FCCOB0_CCOBn (8U)          /*!< Bit field size in bits for FTFL_FCCOB0_CCOBn. */

/*! @brief Read current value of the FTFL_FCCOB0_CCOBn field. */
#define BR_FTFL_FCCOB0_CCOBn(x) (HW_FTFL_FCCOB0(x).U)

/*! @brief Format value for bitfield FTFL_FCCOB0_CCOBn. */
#define BF_FTFL_FCCOB0_CCOBn(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FCCOB0_CCOBn) & BM_FTFL_FCCOB0_CCOBn)

/*! @brief Set the CCOBn field to a new value. */
#define BW_FTFL_FCCOB0_CCOBn(x, v) (HW_FTFL_FCCOB0_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_FTFL_FCCOB7 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FCCOB7 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
typedef union _hw_ftfl_fccob7
{
    uint8_t U;
    struct _hw_ftfl_fccob7_bitfields
    {
        uint8_t CCOBn : 8;             /*!< [7:0]  */
    } B;
} hw_ftfl_fccob7_t;

/*!
 * @name Constants and macros for entire FTFL_FCCOB7 register
 */
/*@{*/
#define HW_FTFL_FCCOB7_ADDR(x)   ((uint32_t)(x) + 0x8U)

#define HW_FTFL_FCCOB7(x)        (*(__IO hw_ftfl_fccob7_t *) HW_FTFL_FCCOB7_ADDR(x))
#define HW_FTFL_FCCOB7_RD(x)     (HW_FTFL_FCCOB7(x).U)
#define HW_FTFL_FCCOB7_WR(x, v)  (HW_FTFL_FCCOB7(x).U = (v))
#define HW_FTFL_FCCOB7_SET(x, v) (HW_FTFL_FCCOB7_WR(x, HW_FTFL_FCCOB7_RD(x) |  (v)))
#define HW_FTFL_FCCOB7_CLR(x, v) (HW_FTFL_FCCOB7_WR(x, HW_FTFL_FCCOB7_RD(x) & ~(v)))
#define HW_FTFL_FCCOB7_TOG(x, v) (HW_FTFL_FCCOB7_WR(x, HW_FTFL_FCCOB7_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FCCOB7 bitfields
 */

/*!
 * @name Register FTFL_FCCOB7, field CCOBn[7:0] (RW)
 */
/*@{*/
#define BP_FTFL_FCCOB7_CCOBn (0U)          /*!< Bit position for FTFL_FCCOB7_CCOBn. */
#define BM_FTFL_FCCOB7_CCOBn (0xFFU)       /*!< Bit mask for FTFL_FCCOB7_CCOBn. */
#define BS_FTFL_FCCOB7_CCOBn (8U)          /*!< Bit field size in bits for FTFL_FCCOB7_CCOBn. */

/*! @brief Read current value of the FTFL_FCCOB7_CCOBn field. */
#define BR_FTFL_FCCOB7_CCOBn(x) (HW_FTFL_FCCOB7(x).U)

/*! @brief Format value for bitfield FTFL_FCCOB7_CCOBn. */
#define BF_FTFL_FCCOB7_CCOBn(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FCCOB7_CCOBn) & BM_FTFL_FCCOB7_CCOBn)

/*! @brief Set the CCOBn field to a new value. */
#define BW_FTFL_FCCOB7_CCOBn(x, v) (HW_FTFL_FCCOB7_WR(x, v))
/*@}*/

