flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*******************************************************************************
 * HW_FTFL_FCCOB6 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FCCOB6 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
typedef union _hw_ftfl_fccob6
{
    uint8_t U;
    struct _hw_ftfl_fccob6_bitfields
    {
        uint8_t CCOBn : 8;             /*!< [7:0]  */
    } B;
} hw_ftfl_fccob6_t;

/*!
 * @name Constants and macros for entire FTFL_FCCOB6 register
 */
/*@{*/
#define HW_FTFL_FCCOB6_ADDR(x)   ((uint32_t)(x) + 0x9U)

#define HW_FTFL_FCCOB6(x)        (*(__IO hw_ftfl_fccob6_t *) HW_FTFL_FCCOB6_ADDR(x))
#define HW_FTFL_FCCOB6_RD(x)     (HW_FTFL_FCCOB6(x).U)
#define HW_FTFL_FCCOB6_WR(x, v)  (HW_FTFL_FCCOB6(x).U = (v))
#define HW_FTFL_FCCOB6_SET(x, v) (HW_FTFL_FCCOB6_WR(x, HW_FTFL_FCCOB6_RD(x) |  (v)))
#define HW_FTFL_FCCOB6_CLR(x, v) (HW_FTFL_FCCOB6_WR(x, HW_FTFL_FCCOB6_RD(x) & ~(v)))
#define HW_FTFL_FCCOB6_TOG(x, v) (HW_FTFL_FCCOB6_WR(x, HW_FTFL_FCCOB6_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FCCOB6 bitfields
 */

/*!
 * @name Register FTFL_FCCOB6, field CCOBn[7:0] (RW)
 */
/*@{*/
#define BP_FTFL_FCCOB6_CCOBn (0U)          /*!< Bit position for FTFL_FCCOB6_CCOBn. */
#define BM_FTFL_FCCOB6_CCOBn (0xFFU)       /*!< Bit mask for FTFL_FCCOB6_CCOBn. */
#define BS_FTFL_FCCOB6_CCOBn (8U)          /*!< Bit field size in bits for FTFL_FCCOB6_CCOBn. */

/*! @brief Read current value of the FTFL_FCCOB6_CCOBn field. */
#define BR_FTFL_FCCOB6_CCOBn(x) (HW_FTFL_FCCOB6(x).U)

/*! @brief Format value for bitfield FTFL_FCCOB6_CCOBn. */
#define BF_FTFL_FCCOB6_CCOBn(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FCCOB6_CCOBn) & BM_FTFL_FCCOB6_CCOBn)

/*! @brief Set the CCOBn field to a new value. */
#define BW_FTFL_FCCOB6_CCOBn(x, v) (HW_FTFL_FCCOB6_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_FTFL_FCCOB5 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FCCOB5 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
typedef union _hw_ftfl_fccob5
{
    uint8_t U;
    struct _hw_ftfl_fccob5_bitfields
    {
        uint8_t CCOBn : 8;             /*!< [7:0]  */
    } B;
} hw_ftfl_fccob5_t;

/*!
 * @name Constants and macros for entire FTFL_FCCOB5 register
 */
/*@{*/
#define HW_FTFL_FCCOB5_ADDR(x)   ((uint32_t)(x) + 0xAU)

#define HW_FTFL_FCCOB5(x)        (*(__IO hw_ftfl_fccob5_t *) HW_FTFL_FCCOB5_ADDR(x))
#define HW_FTFL_FCCOB5_RD(x)     (HW_FTFL_FCCOB5(x).U)
#define HW_FTFL_FCCOB5_WR(x, v)  (HW_FTFL_FCCOB5(x).U = (v))
#define HW_FTFL_FCCOB5_SET(x, v) (HW_FTFL_FCCOB5_WR(x, HW_FTFL_FCCOB5_RD(x) |  (v)))
#define HW_FTFL_FCCOB5_CLR(x, v) (HW_FTFL_FCCOB5_WR(x, HW_FTFL_FCCOB5_RD(x) & ~(v)))
#define HW_FTFL_FCCOB5_TOG(x, v) (HW_FTFL_FCCOB5_WR(x, HW_FTFL_FCCOB5_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FCCOB5 bitfields
 */

/*!
 * @name Register FTFL_FCCOB5, field CCOBn[7:0] (RW)
 */
/*@{*/
#define BP_FTFL_FCCOB5_CCOBn (0U)          /*!< Bit position for FTFL_FCCOB5_CCOBn. */
#define BM_FTFL_FCCOB5_CCOBn (0xFFU)       /*!< Bit mask for FTFL_FCCOB5_CCOBn. */
#define BS_FTFL_FCCOB5_CCOBn (8U)          /*!< Bit field size in bits for FTFL_FCCOB5_CCOBn. */

/*! @brief Read current value of the FTFL_FCCOB5_CCOBn field. */
#define BR_FTFL_FCCOB5_CCOBn(x) (HW_FTFL_FCCOB5(x).U)

/*! @brief Format value for bitfield FTFL_FCCOB5_CCOBn. */
#define BF_FTFL_FCCOB5_CCOBn(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FCCOB5_CCOBn) & BM_FTFL_FCCOB5_CCOBn)

/*! @brief Set the CCOBn field to a new value. */
#define BW_FTFL_FCCOB5_CCOBn(x, v) (HW_FTFL_FCCOB5_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_FTFL_FCCOB4 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FCCOB4 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
typedef union _hw_ftfl_fccob4
{
    uint8_t U;
    struct _hw_ftfl_fccob4_bitfields
    {
        uint8_t CCOBn : 8;             /*!< [7:0]  */
    } B;
} hw_ftfl_fccob4_t;

/*!
 * @name Constants and macros for entire FTFL_FCCOB4 register
 */
/*@{*/
#define HW_FTFL_FCCOB4_ADDR(x)   ((uint32_t)(x) + 0xBU)

#define HW_FTFL_FCCOB4(x)        (*(__IO hw_ftfl_fccob4_t *) HW_FTFL_FCCOB4_ADDR(x))
#define HW_FTFL_FCCOB4_RD(x)     (HW_FTFL_FCCOB4(x).U)
#define HW_FTFL_FCCOB4_WR(x, v)  (HW_FTFL_FCCOB4(x).U = (v))
#define HW_FTFL_FCCOB4_SET(x, v) (HW_FTFL_FCCOB4_WR(x, HW_FTFL_FCCOB4_RD(x) |  (v)))
#define HW_FTFL_FCCOB4_CLR(x, v) (HW_FTFL_FCCOB4_WR(x, HW_FTFL_FCCOB4_RD(x) & ~(v)))
#define HW_FTFL_FCCOB4_TOG(x, v) (HW_FTFL_FCCOB4_WR(x, HW_FTFL_FCCOB4_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FCCOB4 bitfields
 */

/*!
 * @name Register FTFL_FCCOB4, field CCOBn[7:0] (RW)
 */
/*@{*/
#define BP_FTFL_FCCOB4_CCOBn (0U)          /*!< Bit position for FTFL_FCCOB4_CCOBn. */
#define BM_FTFL_FCCOB4_CCOBn (0xFFU)       /*!< Bit mask for FTFL_FCCOB4_CCOBn. */
#define BS_FTFL_FCCOB4_CCOBn (8U)          /*!< Bit field size in bits for FTFL_FCCOB4_CCOBn. */

/*! @brief Read current value of the FTFL_FCCOB4_CCOBn field. */
#define BR_FTFL_FCCOB4_CCOBn(x) (HW_FTFL_FCCOB4(x).U)

/*! @brief Format value for bitfield FTFL_FCCOB4_CCOBn. */
#define BF_FTFL_FCCOB4_CCOBn(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FCCOB4_CCOBn) & BM_FTFL_FCCOB4_CCOBn)

/*! @brief Set the CCOBn field to a new value. */
#define BW_FTFL_FCCOB4_CCOBn(x, v) (HW_FTFL_FCCOB4_WR(x, v))
/*@}*/

