flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*******************************************************************************
 * HW_FTFL_FCCOBB - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FCCOBB - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
typedef union _hw_ftfl_fccobb
{
    uint8_t U;
    struct _hw_ftfl_fccobb_bitfields
    {
        uint8_t CCOBn : 8;             /*!< [7:0]  */
    } B;
} hw_ftfl_fccobb_t;

/*!
 * @name Constants and macros for entire FTFL_FCCOBB register
 */
/*@{*/
#define HW_FTFL_FCCOBB_ADDR(x)   ((uint32_t)(x) + 0xCU)

#define HW_FTFL_FCCOBB(x)        (*(__IO hw_ftfl_fccobb_t *) HW_FTFL_FCCOBB_ADDR(x))
#define HW_FTFL_FCCOBB_RD(x)     (HW_FTFL_FCCOBB(x).U)
#define HW_FTFL_FCCOBB_WR(x, v)  (HW_FTFL_FCCOBB(x).U = (v))
#define HW_FTFL_FCCOBB_SET(x, v) (HW_FTFL_FCCOBB_WR(x, HW_FTFL_FCCOBB_RD(x) |  (v)))
#define HW_FTFL_FCCOBB_CLR(x, v) (HW_FTFL_FCCOBB_WR(x, HW_FTFL_FCCOBB_RD(x) & ~(v)))
#define HW_FTFL_FCCOBB_TOG(x, v) (HW_FTFL_FCCOBB_WR(x, HW_FTFL_FCCOBB_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FCCOBB bitfields
 */

/*!
 * @name Register FTFL_FCCOBB, field CCOBn[7:0] (RW)
 */
/*@{*/
#define BP_FTFL_FCCOBB_CCOBn (0U)          /*!< Bit position for FTFL_FCCOBB_CCOBn. */
#define BM_FTFL_FCCOBB_CCOBn (0xFFU)       /*!< Bit mask for FTFL_FCCOBB_CCOBn. */
#define BS_FTFL_FCCOBB_CCOBn (8U)          /*!< Bit field size in bits for FTFL_FCCOBB_CCOBn. */

/*! @brief Read current value of the FTFL_FCCOBB_CCOBn field. */
#define BR_FTFL_FCCOBB_CCOBn(x) (HW_FTFL_FCCOBB(x).U)

/*! @brief Format value for bitfield FTFL_FCCOBB_CCOBn. */
#define BF_FTFL_FCCOBB_CCOBn(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FCCOBB_CCOBn) & BM_FTFL_FCCOBB_CCOBn)

/*! @brief Set the CCOBn field to a new value. */
#define BW_FTFL_FCCOBB_CCOBn(x, v) (HW_FTFL_FCCOBB_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_FTFL_FCCOBA - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FCCOBA - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
typedef union _hw_ftfl_fccoba
{
    uint8_t U;
    struct _hw_ftfl_fccoba_bitfields
    {
        uint8_t CCOBn : 8;             /*!< [7:0]  */
    } B;
} hw_ftfl_fccoba_t;

/*!
 * @name Constants and macros for entire FTFL_FCCOBA register
 */
/*@{*/
#define HW_FTFL_FCCOBA_ADDR(x)   ((uint32_t)(x) + 0xDU)

#define HW_FTFL_FCCOBA(x)        (*(__IO hw_ftfl_fccoba_t *) HW_FTFL_FCCOBA_ADDR(x))
#define HW_FTFL_FCCOBA_RD(x)     (HW_FTFL_FCCOBA(x).U)
#define HW_FTFL_FCCOBA_WR(x, v)  (HW_FTFL_FCCOBA(x).U = (v))
#define HW_FTFL_FCCOBA_SET(x, v) (HW_FTFL_FCCOBA_WR(x, HW_FTFL_FCCOBA_RD(x) |  (v)))
#define HW_FTFL_FCCOBA_CLR(x, v) (HW_FTFL_FCCOBA_WR(x, HW_FTFL_FCCOBA_RD(x) & ~(v)))
#define HW_FTFL_FCCOBA_TOG(x, v) (HW_FTFL_FCCOBA_WR(x, HW_FTFL_FCCOBA_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FCCOBA bitfields
 */

/*!
 * @name Register FTFL_FCCOBA, field CCOBn[7:0] (RW)
 */
/*@{*/
#define BP_FTFL_FCCOBA_CCOBn (0U)          /*!< Bit position for FTFL_FCCOBA_CCOBn. */
#define BM_FTFL_FCCOBA_CCOBn (0xFFU)       /*!< Bit mask for FTFL_FCCOBA_CCOBn. */
#define BS_FTFL_FCCOBA_CCOBn (8U)          /*!< Bit field size in bits for FTFL_FCCOBA_CCOBn. */

/*! @brief Read current value of the FTFL_FCCOBA_CCOBn field. */
#define BR_FTFL_FCCOBA_CCOBn(x) (HW_FTFL_FCCOBA(x).U)

/*! @brief Format value for bitfield FTFL_FCCOBA_CCOBn. */
#define BF_FTFL_FCCOBA_CCOBn(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FCCOBA_CCOBn) & BM_FTFL_FCCOBA_CCOBn)

/*! @brief Set the CCOBn field to a new value. */
#define BW_FTFL_FCCOBA_CCOBn(x, v) (HW_FTFL_FCCOBA_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_FTFL_FCCOB9 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FCCOB9 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
typedef union _hw_ftfl_fccob9
{
    uint8_t U;
    struct _hw_ftfl_fccob9_bitfields
    {
        uint8_t CCOBn : 8;             /*!< [7:0]  */
    } B;
} hw_ftfl_fccob9_t;

/*!
 * @name Constants and macros for entire FTFL_FCCOB9 register
 */
/*@{*/
#define HW_FTFL_FCCOB9_ADDR(x)   ((uint32_t)(x) + 0xEU)

#define HW_FTFL_FCCOB9(x)        (*(__IO hw_ftfl_fccob9_t *) HW_FTFL_FCCOB9_ADDR(x))
#define HW_FTFL_FCCOB9_RD(x)     (HW_FTFL_FCCOB9(x).U)
#define HW_FTFL_FCCOB9_WR(x, v)  (HW_FTFL_FCCOB9(x).U = (v))
#define HW_FTFL_FCCOB9_SET(x, v) (HW_FTFL_FCCOB9_WR(x, HW_FTFL_FCCOB9_RD(x) |  (v)))
#define HW_FTFL_FCCOB9_CLR(x, v) (HW_FTFL_FCCOB9_WR(x, HW_FTFL_FCCOB9_RD(x) & ~(v)))
#define HW_FTFL_FCCOB9_TOG(x, v) (HW_FTFL_FCCOB9_WR(x, HW_FTFL_FCCOB9_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FCCOB9 bitfields
 */

/*!
 * @name Register FTFL_FCCOB9, field CCOBn[7:0] (RW)
 */
/*@{*/
#define BP_FTFL_FCCOB9_CCOBn (0U)          /*!< Bit position for FTFL_FCCOB9_CCOBn. */
#define BM_FTFL_FCCOB9_CCOBn (0xFFU)       /*!< Bit mask for FTFL_FCCOB9_CCOBn. */
#define BS_FTFL_FCCOB9_CCOBn (8U)          /*!< Bit field size in bits for FTFL_FCCOB9_CCOBn. */

/*! @brief Read current value of the FTFL_FCCOB9_CCOBn field. */
#define BR_FTFL_FCCOB9_CCOBn(x) (HW_FTFL_FCCOB9(x).U)

/*! @brief Format value for bitfield FTFL_FCCOB9_CCOBn. */
#define BF_FTFL_FCCOB9_CCOBn(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FCCOB9_CCOBn) & BM_FTFL_FCCOB9_CCOBn)

/*! @brief Set the CCOBn field to a new value. */
#define BW_FTFL_FCCOB9_CCOBn(x, v) (HW_FTFL_FCCOB9_WR(x, v))
/*@}*/

