flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*******************************************************************************
 * HW_FTFL_FCCOB8 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FCCOB8 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
typedef union _hw_ftfl_fccob8
{
    uint8_t U;
    struct _hw_ftfl_fccob8_bitfields
    {
        uint8_t CCOBn : 8;             /*!< [7:0]  */
    } B;
} hw_ftfl_fccob8_t;

/*!
 * @name Constants and macros for entire FTFL_FCCOB8 register
 */
/*@{*/
#define HW_FTFL_FCCOB8_ADDR(x)   ((uint32_t)(x) + 0xFU)

#define HW_FTFL_FCCOB8(x)        (*(__IO hw_ftfl_fccob8_t *) HW_FTFL_FCCOB8_ADDR(x))
#define HW_FTFL_FCCOB8_RD(x)     (HW_FTFL_FCCOB8(x).U)
#define HW_FTFL_FCCOB8_WR(x, v)  (HW_FTFL_FCCOB8(x).U = (v))
#define HW_FTFL_FCCOB8_SET(x, v) (HW_FTFL_FCCOB8_WR(x, HW_FTFL_FCCOB8_RD(x) |  (v)))
#define HW_FTFL_FCCOB8_CLR(x, v) (HW_FTFL_FCCOB8_WR(x, HW_FTFL_FCCOB8_RD(x) & ~(v)))
#define HW_FTFL_FCCOB8_TOG(x, v) (HW_FTFL_FCCOB8_WR(x, HW_FTFL_FCCOB8_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FCCOB8 bitfields
 */

/*!
 * @name Register FTFL_FCCOB8, field CCOBn[7:0] (RW)
 */
/*@{*/
#define BP_FTFL_FCCOB8_CCOBn (0U)          /*!< Bit position for FTFL_FCCOB8_CCOBn. */
#define BM_FTFL_FCCOB8_CCOBn (0xFFU)       /*!< Bit mask for FTFL_FCCOB8_CCOBn. */
#define BS_FTFL_FCCOB8_CCOBn (8U)          /*!< Bit field size in bits for FTFL_FCCOB8_CCOBn. */

/*! @brief Read current value of the FTFL_FCCOB8_CCOBn field. */
#define BR_FTFL_FCCOB8_CCOBn(x) (HW_FTFL_FCCOB8(x).U)

/*! @brief Format value for bitfield FTFL_FCCOB8_CCOBn. */
#define BF_FTFL_FCCOB8_CCOBn(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FCCOB8_CCOBn) & BM_FTFL_FCCOB8_CCOBn)

/*! @brief Set the CCOBn field to a new value. */
#define BW_FTFL_FCCOB8_CCOBn(x, v) (HW_FTFL_FCCOB8_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_FTFL_FPROT3 - Program Flash Protection Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FPROT3 - Program Flash Protection Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FPROT registers define which logical program flash regions are protected
 * from program and erase operations. Protected flash regions cannot have their
 * content changed; that is, these regions cannot be programmed and cannot be
 * erased by any FTFL command. Unprotected regions can be changed by program and
 * erase operations. The four FPROT registers allow 32 protectable regions. Each bit
 * protects a 1/32 region of the program flash memory. The bitfields are defined
 * in each register as follows: Program flash protection register Program flash
 * protection bits FPROT0 PROT[31:24] FPROT1 PROT[23:16] FPROT2 PROT[15:8] FPROT3
 * PROT[7:0] During the reset sequence, the FPROT registers are loaded with the
 * contents of the program flash protection bytes in the Flash Configuration Field
 * as indicated in the following table. Program flash protection register Flash
 * Configuration Field offset address FPROT0 0x0008 FPROT1 0x0009 FPROT2 0x000A
 * FPROT3 0x000B To change the program flash protection that is loaded during the
 * reset sequence, unprotect the sector of program flash memory that contains the
 * Flash Configuration Field. Then, reprogram the program flash protection byte.
 */
typedef union _hw_ftfl_fprot3
{
    uint8_t U;
    struct _hw_ftfl_fprot3_bitfields
    {
        uint8_t PROT : 8;              /*!< [7:0] Program Flash Region Protect */
    } B;
} hw_ftfl_fprot3_t;

/*!
 * @name Constants and macros for entire FTFL_FPROT3 register
 */
/*@{*/
#define HW_FTFL_FPROT3_ADDR(x)   ((uint32_t)(x) + 0x10U)

#define HW_FTFL_FPROT3(x)        (*(__IO hw_ftfl_fprot3_t *) HW_FTFL_FPROT3_ADDR(x))
#define HW_FTFL_FPROT3_RD(x)     (HW_FTFL_FPROT3(x).U)
#define HW_FTFL_FPROT3_WR(x, v)  (HW_FTFL_FPROT3(x).U = (v))
#define HW_FTFL_FPROT3_SET(x, v) (HW_FTFL_FPROT3_WR(x, HW_FTFL_FPROT3_RD(x) |  (v)))
#define HW_FTFL_FPROT3_CLR(x, v) (HW_FTFL_FPROT3_WR(x, HW_FTFL_FPROT3_RD(x) & ~(v)))
#define HW_FTFL_FPROT3_TOG(x, v) (HW_FTFL_FPROT3_WR(x, HW_FTFL_FPROT3_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FPROT3 bitfields
 */

/*!
 * @name Register FTFL_FPROT3, field PROT[7:0] (RW)
 *
 * Values:
 * - 0 - Program flash region is protected.
 * - 1 - Program flash region is not protected
 */
/*@{*/
#define BP_FTFL_FPROT3_PROT  (0U)          /*!< Bit position for FTFL_FPROT3_PROT. */
#define BM_FTFL_FPROT3_PROT  (0xFFU)       /*!< Bit mask for FTFL_FPROT3_PROT. */
#define BS_FTFL_FPROT3_PROT  (8U)          /*!< Bit field size in bits for FTFL_FPROT3_PROT. */

/*! @brief Read current value of the FTFL_FPROT3_PROT field. */
#define BR_FTFL_FPROT3_PROT(x) (HW_FTFL_FPROT3(x).U)

/*! @brief Format value for bitfield FTFL_FPROT3_PROT. */
#define BF_FTFL_FPROT3_PROT(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FPROT3_PROT) & BM_FTFL_FPROT3_PROT)

/*! @brief Set the PROT field to a new value. */
#define BW_FTFL_FPROT3_PROT(x, v) (HW_FTFL_FPROT3_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_FTFL_FPROT2 - Program Flash Protection Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FPROT2 - Program Flash Protection Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FPROT registers define which logical program flash regions are protected
 * from program and erase operations. Protected flash regions cannot have their
 * content changed; that is, these regions cannot be programmed and cannot be
 * erased by any FTFL command. Unprotected regions can be changed by program and
 * erase operations. The four FPROT registers allow 32 protectable regions. Each bit
 * protects a 1/32 region of the program flash memory. The bitfields are defined
 * in each register as follows: Program flash protection register Program flash
 * protection bits FPROT0 PROT[31:24] FPROT1 PROT[23:16] FPROT2 PROT[15:8] FPROT3
 * PROT[7:0] During the reset sequence, the FPROT registers are loaded with the
 * contents of the program flash protection bytes in the Flash Configuration Field
 * as indicated in the following table. Program flash protection register Flash
 * Configuration Field offset address FPROT0 0x0008 FPROT1 0x0009 FPROT2 0x000A
 * FPROT3 0x000B To change the program flash protection that is loaded during the
 * reset sequence, unprotect the sector of program flash memory that contains the
 * Flash Configuration Field. Then, reprogram the program flash protection byte.
 */
typedef union _hw_ftfl_fprot2
{
    uint8_t U;
    struct _hw_ftfl_fprot2_bitfields
    {
        uint8_t PROT : 8;              /*!< [7:0] Program Flash Region Protect */
    } B;
} hw_ftfl_fprot2_t;

/*!
 * @name Constants and macros for entire FTFL_FPROT2 register
 */
/*@{*/
#define HW_FTFL_FPROT2_ADDR(x)   ((uint32_t)(x) + 0x11U)

#define HW_FTFL_FPROT2(x)        (*(__IO hw_ftfl_fprot2_t *) HW_FTFL_FPROT2_ADDR(x))
#define HW_FTFL_FPROT2_RD(x)     (HW_FTFL_FPROT2(x).U)
#define HW_FTFL_FPROT2_WR(x, v)  (HW_FTFL_FPROT2(x).U = (v))
#define HW_FTFL_FPROT2_SET(x, v) (HW_FTFL_FPROT2_WR(x, HW_FTFL_FPROT2_RD(x) |  (v)))
#define HW_FTFL_FPROT2_CLR(x, v) (HW_FTFL_FPROT2_WR(x, HW_FTFL_FPROT2_RD(x) & ~(v)))
#define HW_FTFL_FPROT2_TOG(x, v) (HW_FTFL_FPROT2_WR(x, HW_FTFL_FPROT2_RD(x) ^  (v)))
/*@}*/

