flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*
 * Constants & macros for individual FTFL_FPROT2 bitfields
 */

/*!
 * @name Register FTFL_FPROT2, field PROT[7:0] (RW)
 *
 * Values:
 * - 0 - Program flash region is protected.
 * - 1 - Program flash region is not protected
 */
/*@{*/
#define BP_FTFL_FPROT2_PROT  (0U)          /*!< Bit position for FTFL_FPROT2_PROT. */
#define BM_FTFL_FPROT2_PROT  (0xFFU)       /*!< Bit mask for FTFL_FPROT2_PROT. */
#define BS_FTFL_FPROT2_PROT  (8U)          /*!< Bit field size in bits for FTFL_FPROT2_PROT. */

/*! @brief Read current value of the FTFL_FPROT2_PROT field. */
#define BR_FTFL_FPROT2_PROT(x) (HW_FTFL_FPROT2(x).U)

/*! @brief Format value for bitfield FTFL_FPROT2_PROT. */
#define BF_FTFL_FPROT2_PROT(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FPROT2_PROT) & BM_FTFL_FPROT2_PROT)

/*! @brief Set the PROT field to a new value. */
#define BW_FTFL_FPROT2_PROT(x, v) (HW_FTFL_FPROT2_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_FTFL_FPROT1 - Program Flash Protection Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FPROT1 - Program Flash Protection Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FPROT registers define which logical program flash regions are protected
 * from program and erase operations. Protected flash regions cannot have their
 * content changed; that is, these regions cannot be programmed and cannot be
 * erased by any FTFL command. Unprotected regions can be changed by program and
 * erase operations. The four FPROT registers allow 32 protectable regions. Each bit
 * protects a 1/32 region of the program flash memory. The bitfields are defined
 * in each register as follows: Program flash protection register Program flash
 * protection bits FPROT0 PROT[31:24] FPROT1 PROT[23:16] FPROT2 PROT[15:8] FPROT3
 * PROT[7:0] During the reset sequence, the FPROT registers are loaded with the
 * contents of the program flash protection bytes in the Flash Configuration Field
 * as indicated in the following table. Program flash protection register Flash
 * Configuration Field offset address FPROT0 0x0008 FPROT1 0x0009 FPROT2 0x000A
 * FPROT3 0x000B To change the program flash protection that is loaded during the
 * reset sequence, unprotect the sector of program flash memory that contains the
 * Flash Configuration Field. Then, reprogram the program flash protection byte.
 */
typedef union _hw_ftfl_fprot1
{
    uint8_t U;
    struct _hw_ftfl_fprot1_bitfields
    {
        uint8_t PROT : 8;              /*!< [7:0] Program Flash Region Protect */
    } B;
} hw_ftfl_fprot1_t;

/*!
 * @name Constants and macros for entire FTFL_FPROT1 register
 */
/*@{*/
#define HW_FTFL_FPROT1_ADDR(x)   ((uint32_t)(x) + 0x12U)

#define HW_FTFL_FPROT1(x)        (*(__IO hw_ftfl_fprot1_t *) HW_FTFL_FPROT1_ADDR(x))
#define HW_FTFL_FPROT1_RD(x)     (HW_FTFL_FPROT1(x).U)
#define HW_FTFL_FPROT1_WR(x, v)  (HW_FTFL_FPROT1(x).U = (v))
#define HW_FTFL_FPROT1_SET(x, v) (HW_FTFL_FPROT1_WR(x, HW_FTFL_FPROT1_RD(x) |  (v)))
#define HW_FTFL_FPROT1_CLR(x, v) (HW_FTFL_FPROT1_WR(x, HW_FTFL_FPROT1_RD(x) & ~(v)))
#define HW_FTFL_FPROT1_TOG(x, v) (HW_FTFL_FPROT1_WR(x, HW_FTFL_FPROT1_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FPROT1 bitfields
 */

/*!
 * @name Register FTFL_FPROT1, field PROT[7:0] (RW)
 *
 * Values:
 * - 0 - Program flash region is protected.
 * - 1 - Program flash region is not protected
 */
/*@{*/
#define BP_FTFL_FPROT1_PROT  (0U)          /*!< Bit position for FTFL_FPROT1_PROT. */
#define BM_FTFL_FPROT1_PROT  (0xFFU)       /*!< Bit mask for FTFL_FPROT1_PROT. */
#define BS_FTFL_FPROT1_PROT  (8U)          /*!< Bit field size in bits for FTFL_FPROT1_PROT. */

/*! @brief Read current value of the FTFL_FPROT1_PROT field. */
#define BR_FTFL_FPROT1_PROT(x) (HW_FTFL_FPROT1(x).U)

/*! @brief Format value for bitfield FTFL_FPROT1_PROT. */
#define BF_FTFL_FPROT1_PROT(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FPROT1_PROT) & BM_FTFL_FPROT1_PROT)

/*! @brief Set the PROT field to a new value. */
#define BW_FTFL_FPROT1_PROT(x, v) (HW_FTFL_FPROT1_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_FTFL_FPROT0 - Program Flash Protection Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FPROT0 - Program Flash Protection Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FPROT registers define which logical program flash regions are protected
 * from program and erase operations. Protected flash regions cannot have their
 * content changed; that is, these regions cannot be programmed and cannot be
 * erased by any FTFL command. Unprotected regions can be changed by program and
 * erase operations. The four FPROT registers allow 32 protectable regions. Each bit
 * protects a 1/32 region of the program flash memory. The bitfields are defined
 * in each register as follows: Program flash protection register Program flash
 * protection bits FPROT0 PROT[31:24] FPROT1 PROT[23:16] FPROT2 PROT[15:8] FPROT3
 * PROT[7:0] During the reset sequence, the FPROT registers are loaded with the
 * contents of the program flash protection bytes in the Flash Configuration Field
 * as indicated in the following table. Program flash protection register Flash
 * Configuration Field offset address FPROT0 0x0008 FPROT1 0x0009 FPROT2 0x000A
 * FPROT3 0x000B To change the program flash protection that is loaded during the
 * reset sequence, unprotect the sector of program flash memory that contains the
 * Flash Configuration Field. Then, reprogram the program flash protection byte.
 */
typedef union _hw_ftfl_fprot0
{
    uint8_t U;
    struct _hw_ftfl_fprot0_bitfields
    {
        uint8_t PROT : 8;              /*!< [7:0] Program Flash Region Protect */
    } B;
} hw_ftfl_fprot0_t;

/*!
 * @name Constants and macros for entire FTFL_FPROT0 register
 */
/*@{*/
#define HW_FTFL_FPROT0_ADDR(x)   ((uint32_t)(x) + 0x13U)

#define HW_FTFL_FPROT0(x)        (*(__IO hw_ftfl_fprot0_t *) HW_FTFL_FPROT0_ADDR(x))
#define HW_FTFL_FPROT0_RD(x)     (HW_FTFL_FPROT0(x).U)
#define HW_FTFL_FPROT0_WR(x, v)  (HW_FTFL_FPROT0(x).U = (v))
#define HW_FTFL_FPROT0_SET(x, v) (HW_FTFL_FPROT0_WR(x, HW_FTFL_FPROT0_RD(x) |  (v)))
#define HW_FTFL_FPROT0_CLR(x, v) (HW_FTFL_FPROT0_WR(x, HW_FTFL_FPROT0_RD(x) & ~(v)))
#define HW_FTFL_FPROT0_TOG(x, v) (HW_FTFL_FPROT0_WR(x, HW_FTFL_FPROT0_RD(x) ^  (v)))
/*@}*/

