flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*
 * Constants & macros for individual FTFL_FPROT0 bitfields
 */

/*!
 * @name Register FTFL_FPROT0, field PROT[7:0] (RW)
 *
 * Values:
 * - 0 - Program flash region is protected.
 * - 1 - Program flash region is not protected
 */
/*@{*/
#define BP_FTFL_FPROT0_PROT  (0U)          /*!< Bit position for FTFL_FPROT0_PROT. */
#define BM_FTFL_FPROT0_PROT  (0xFFU)       /*!< Bit mask for FTFL_FPROT0_PROT. */
#define BS_FTFL_FPROT0_PROT  (8U)          /*!< Bit field size in bits for FTFL_FPROT0_PROT. */

/*! @brief Read current value of the FTFL_FPROT0_PROT field. */
#define BR_FTFL_FPROT0_PROT(x) (HW_FTFL_FPROT0(x).U)

/*! @brief Format value for bitfield FTFL_FPROT0_PROT. */
#define BF_FTFL_FPROT0_PROT(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FPROT0_PROT) & BM_FTFL_FPROT0_PROT)

/*! @brief Set the PROT field to a new value. */
#define BW_FTFL_FPROT0_PROT(x, v) (HW_FTFL_FPROT0_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_FTFL_FEPROT - EEPROM Protection Register
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FEPROT - EEPROM Protection Register (RW)
 *
 * Reset value: 0x00U
 *
 * The FEPROT register defines which EEPROM regions of the FlexRAM are protected
 * against program and erase operations. Protected EEPROM regions cannot have
 * their content changed by writing to it. Unprotected regions can be changed by
 * writing to the FlexRAM.
 */
typedef union _hw_ftfl_feprot
{
    uint8_t U;
    struct _hw_ftfl_feprot_bitfields
    {
        uint8_t EPROT : 8;             /*!< [7:0] EEPROM Region Protect */
    } B;
} hw_ftfl_feprot_t;

/*!
 * @name Constants and macros for entire FTFL_FEPROT register
 */
/*@{*/
#define HW_FTFL_FEPROT_ADDR(x)   ((uint32_t)(x) + 0x16U)

#define HW_FTFL_FEPROT(x)        (*(__IO hw_ftfl_feprot_t *) HW_FTFL_FEPROT_ADDR(x))
#define HW_FTFL_FEPROT_RD(x)     (HW_FTFL_FEPROT(x).U)
#define HW_FTFL_FEPROT_WR(x, v)  (HW_FTFL_FEPROT(x).U = (v))
#define HW_FTFL_FEPROT_SET(x, v) (HW_FTFL_FEPROT_WR(x, HW_FTFL_FEPROT_RD(x) |  (v)))
#define HW_FTFL_FEPROT_CLR(x, v) (HW_FTFL_FEPROT_WR(x, HW_FTFL_FEPROT_RD(x) & ~(v)))
#define HW_FTFL_FEPROT_TOG(x, v) (HW_FTFL_FEPROT_WR(x, HW_FTFL_FEPROT_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FEPROT bitfields
 */

/*!
 * @name Register FTFL_FEPROT, field EPROT[7:0] (RW)
 *
 * Individual EEPROM regions can be protected from alteration by setting the
 * associated EPROT bit. The EPROT bits are not used when the FlexNVM Partition Code
 * is set to data flash only. When the FlexNVM Partition Code is set to data
 * flash and EEPROM or EEPROM only, each EPROT bit covers one-eighth of the
 * configured EEPROM data (see the EEPROM Data Set Size parameter description). In NVM
 * Normal mode: The protection can only be increased. This means that
 * currently-unprotected memory can be protected, but currently-protected memory cannot be
 * unprotected. Since unprotected regions are marked with a 1 and protected regions
 * use a 0, only writes changing 1s to 0s are accepted. This 1-to-0 transition
 * check is performed on a bit-by-bit basis. Those FEPROT bits with 1-to-0
 * transitions are accepted while all bits with 0-to-1 transitions are ignored . In NVM
 * Special mode : All bits of the FEPROT register are writable without
 * restriction. Unprotected areas can be protected and protected areas can be unprotected.
 * Never write to the FEPROT register while a command is running (CCIF=0). Reset:
 * During the reset sequence, the FEPROT register is loaded with the contents of
 * the FlexRAM protection byte in the Flash Configuration Field located in
 * program flash. The flash basis for the reset values is signified by X in the
 * register diagram. To change the EEPROM protection that will be loaded during the
 * reset sequence, the sector of program flash that contains the Flash Configuration
 * Field must be unprotected; then the EEPROM protection byte must be erased and
 * reprogrammed. Trying to alter data by writing to any protected area in the
 * EEPROM results in a protection violation error and sets the FPVIOL bit in the
 * FSTAT register.
 *
 * Values:
 * - 0 - EEPROM region is protected
 * - 1 - EEPROM region is not protected
 */
/*@{*/
#define BP_FTFL_FEPROT_EPROT (0U)          /*!< Bit position for FTFL_FEPROT_EPROT. */
#define BM_FTFL_FEPROT_EPROT (0xFFU)       /*!< Bit mask for FTFL_FEPROT_EPROT. */
#define BS_FTFL_FEPROT_EPROT (8U)          /*!< Bit field size in bits for FTFL_FEPROT_EPROT. */

/*! @brief Read current value of the FTFL_FEPROT_EPROT field. */
#define BR_FTFL_FEPROT_EPROT(x) (HW_FTFL_FEPROT(x).U)

/*! @brief Format value for bitfield FTFL_FEPROT_EPROT. */
#define BF_FTFL_FEPROT_EPROT(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FEPROT_EPROT) & BM_FTFL_FEPROT_EPROT)

/*! @brief Set the EPROT field to a new value. */
#define BW_FTFL_FEPROT_EPROT(x, v) (HW_FTFL_FEPROT_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_FTFL_FDPROT - Data Flash Protection Register
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FDPROT - Data Flash Protection Register (RW)
 *
 * Reset value: 0x00U
 *
 * The FDPROT register defines which data flash regions are protected against
 * program and erase operations. Protected Flash regions cannot have their content
 * changed; that is, these regions cannot be programmed and cannot be erased by
 * any FTFL command. Unprotected regions can be changed by both program and erase
 * operations.
 */
typedef union _hw_ftfl_fdprot
{
    uint8_t U;
    struct _hw_ftfl_fdprot_bitfields
    {
        uint8_t DPROT : 8;             /*!< [7:0] Data Flash Region Protect */
    } B;
} hw_ftfl_fdprot_t;

/*!
 * @name Constants and macros for entire FTFL_FDPROT register
 */
/*@{*/
#define HW_FTFL_FDPROT_ADDR(x)   ((uint32_t)(x) + 0x17U)

#define HW_FTFL_FDPROT(x)        (*(__IO hw_ftfl_fdprot_t *) HW_FTFL_FDPROT_ADDR(x))
#define HW_FTFL_FDPROT_RD(x)     (HW_FTFL_FDPROT(x).U)
#define HW_FTFL_FDPROT_WR(x, v)  (HW_FTFL_FDPROT(x).U = (v))
#define HW_FTFL_FDPROT_SET(x, v) (HW_FTFL_FDPROT_WR(x, HW_FTFL_FDPROT_RD(x) |  (v)))
#define HW_FTFL_FDPROT_CLR(x, v) (HW_FTFL_FDPROT_WR(x, HW_FTFL_FDPROT_RD(x) & ~(v)))
#define HW_FTFL_FDPROT_TOG(x, v) (HW_FTFL_FDPROT_WR(x, HW_FTFL_FDPROT_RD(x) ^  (v)))
/*@}*/

