flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*
 * Constants & macros for individual FTFL_FDPROT bitfields
 */

/*!
 * @name Register FTFL_FDPROT, field DPROT[7:0] (RW)
 *
 * Individual data flash regions can be protected from program and erase
 * operations by setting the associated DPROT bit. Each DPROT bit protects one-eighth of
 * the partitioned data flash memory space. The granularity of data flash
 * protection cannot be less than the data flash sector size. If an unused DPROT bit is
 * set, the Erase all Blocks command does not execute and the FSTAT[FPVIOL] flag
 * is set. In NVM Normal mode: The protection can only be increased, meaning
 * that currently unprotected memory can be protected but currently protected memory
 * cannot be unprotected. Since unprotected regions are marked with a 1 and
 * protected regions use a 0, only writes changing 1s to 0s are accepted. This 1-to-0
 * transition check is performed on a bit-by-bit basis. Those FDPROT bits with
 * 1-to-0 transitions are accepted while all bits with 0-to-1 transitions are
 * ignored . In NVM Special mode: All bits of the FDPROT register are writable
 * without restriction. Unprotected areas can be protected and protected areas can be
 * unprotected. The user must never write to the FDPROT register while a command
 * is running (CCIF=0). Reset: During the reset sequence, the FDPROT register is
 * loaded with the contents of the data flash protection byte in the Flash
 * Configuration Field located in program flash memory. The flash basis for the reset
 * values is signified by X in the register diagram. To change the data flash
 * protection that will be loaded during the reset sequence, unprotect the sector of
 * program flash that contains the Flash Configuration Field. Then, erase and
 * reprogram the data flash protection byte. Trying to alter data with the program
 * and erase commands in any protected area in the data flash memory results in a
 * protection violation error and sets the FSTAT[FPVIOL] bit. A full block erase
 * of the data flash memory (see the Erase Flash Block command description) is not
 * possible if the data flash memory contains any protected region or if the
 * FlexNVM block has been partitioned for EEPROM.
 *
 * Values:
 * - 0 - Data Flash region is protected
 * - 1 - Data Flash region is not protected
 */
/*@{*/
#define BP_FTFL_FDPROT_DPROT (0U)          /*!< Bit position for FTFL_FDPROT_DPROT. */
#define BM_FTFL_FDPROT_DPROT (0xFFU)       /*!< Bit mask for FTFL_FDPROT_DPROT. */
#define BS_FTFL_FDPROT_DPROT (8U)          /*!< Bit field size in bits for FTFL_FDPROT_DPROT. */

/*! @brief Read current value of the FTFL_FDPROT_DPROT field. */
#define BR_FTFL_FDPROT_DPROT(x) (HW_FTFL_FDPROT(x).U)

/*! @brief Format value for bitfield FTFL_FDPROT_DPROT. */
#define BF_FTFL_FDPROT_DPROT(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FDPROT_DPROT) & BM_FTFL_FDPROT_DPROT)

/*! @brief Set the DPROT field to a new value. */
#define BW_FTFL_FDPROT_DPROT(x, v) (HW_FTFL_FDPROT_WR(x, v))
/*@}*/

/*******************************************************************************
 * hw_ftfl_t - module struct
 ******************************************************************************/
/*!
 * @brief All FTFL module registers.
 */
#pragma pack(1)
typedef struct _hw_ftfl
{
    __IO hw_ftfl_fstat_t FSTAT;            /*!< [0x0] Flash Status Register */
    __IO hw_ftfl_fcnfg_t FCNFG;            /*!< [0x1] Flash Configuration Register */
    __I hw_ftfl_fsec_t FSEC;               /*!< [0x2] Flash Security Register */
    __I hw_ftfl_fopt_t FOPT;               /*!< [0x3] Flash Option Register */
    __IO hw_ftfl_fccob3_t FCCOB3;          /*!< [0x4] Flash Common Command Object Registers */
    __IO hw_ftfl_fccob2_t FCCOB2;          /*!< [0x5] Flash Common Command Object Registers */
    __IO hw_ftfl_fccob1_t FCCOB1;          /*!< [0x6] Flash Common Command Object Registers */
    __IO hw_ftfl_fccob0_t FCCOB0;          /*!< [0x7] Flash Common Command Object Registers */
    __IO hw_ftfl_fccob7_t FCCOB7;          /*!< [0x8] Flash Common Command Object Registers */
    __IO hw_ftfl_fccob6_t FCCOB6;          /*!< [0x9] Flash Common Command Object Registers */
    __IO hw_ftfl_fccob5_t FCCOB5;          /*!< [0xA] Flash Common Command Object Registers */
    __IO hw_ftfl_fccob4_t FCCOB4;          /*!< [0xB] Flash Common Command Object Registers */
    __IO hw_ftfl_fccobb_t FCCOBB;          /*!< [0xC] Flash Common Command Object Registers */
    __IO hw_ftfl_fccoba_t FCCOBA;          /*!< [0xD] Flash Common Command Object Registers */
    __IO hw_ftfl_fccob9_t FCCOB9;          /*!< [0xE] Flash Common Command Object Registers */
    __IO hw_ftfl_fccob8_t FCCOB8;          /*!< [0xF] Flash Common Command Object Registers */
    __IO hw_ftfl_fprot3_t FPROT3;          /*!< [0x10] Program Flash Protection Registers */
    __IO hw_ftfl_fprot2_t FPROT2;          /*!< [0x11] Program Flash Protection Registers */
    __IO hw_ftfl_fprot1_t FPROT1;          /*!< [0x12] Program Flash Protection Registers */
    __IO hw_ftfl_fprot0_t FPROT0;          /*!< [0x13] Program Flash Protection Registers */
    uint8_t _reserved0[2];
    __IO hw_ftfl_feprot_t FEPROT;          /*!< [0x16] EEPROM Protection Register */
    __IO hw_ftfl_fdprot_t FDPROT;          /*!< [0x17] Data Flash Protection Register */
} hw_ftfl_t;
#pragma pack()

/*! @brief Macro to access all FTFL registers. */
/*! @param x FTFL module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_FTFL_REGS(FTFL_BASE)</code>. */
#define HW_FTFL_REGS(x) (*(hw_ftfl_t *)(x))

/*
 * MK20D5 FTM
 *
 * FlexTimer Module
 *
 * Registers defined in this header file:
 * - HW_FTM_SC - Status and Control
 * - HW_FTM_CNT - Counter
 * - HW_FTM_MOD - Modulo
 * - HW_FTM_CnSC - Channel (n) Status and Control
 * - HW_FTM_CnV - Channel (n) Value
 * - HW_FTM_CNTIN - Counter Initial Value
 * - HW_FTM_STATUS - Capture and Compare Status
 * - HW_FTM_MODE - Features Mode Selection
 * - HW_FTM_SYNC - Synchronization
 * - HW_FTM_OUTINIT - Initial State for Channels Output
 * - HW_FTM_OUTMASK - Output Mask
 * - HW_FTM_COMBINE - Function for Linked Channels
 * - HW_FTM_DEADTIME - Deadtime Insertion Control
 * - HW_FTM_EXTTRIG - FTM External Trigger
 * - HW_FTM_POL - Channels Polarity
 * - HW_FTM_FMS - Fault Mode Status
 * - HW_FTM_FILTER - Input Capture Filter Control
 * - HW_FTM_FLTCTRL - Fault Control
 * - HW_FTM_QDCTRL - Quadrature Decoder Control and Status
 * - HW_FTM_CONF - Configuration
 * - HW_FTM_FLTPOL - FTM Fault Input Polarity
 * - HW_FTM_SYNCONF - Synchronization Configuration
 * - HW_FTM_INVCTRL - FTM Inverting Control
 * - HW_FTM_SWOCTRL - FTM Software Output Control
 * - HW_FTM_PWMLOAD - FTM PWM Load
 *
 * - hw_ftm_t - Struct containing all module registers.
 */

