flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*! @brief Macro to access all SPI registers. */
/*! @param x SPI module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_SPI_REGS(SPI0_BASE)</code>. */
#define HW_SPI_REGS(x) (*(hw_spi_t *)(x))

/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #pragma pop
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*
 * MK20D5 TSI
 *
 * Touch Sensing Input
 *
 * Registers defined in this header file:
 * - HW_TSI_GENCS - General Control and Status Register
 * - HW_TSI_SCANC - SCAN Control Register
 * - HW_TSI_PEN - Pin Enable Register
 * - HW_TSI_WUCNTR - Wake-Up Channel Counter Register
 * - HW_TSI_CNTR1 - Counter Register
 * - HW_TSI_CNTR3 - Counter Register
 * - HW_TSI_CNTR5 - Counter Register
 * - HW_TSI_CNTR7 - Counter Register
 * - HW_TSI_CNTR9 - Counter Register
 * - HW_TSI_CNTR11 - Counter Register
 * - HW_TSI_CNTR13 - Counter Register
 * - HW_TSI_CNTR15 - Counter Register
 * - HW_TSI_THRESHOLD - Low Power Channel Threshold Register
 *
 * - hw_tsi_t - Struct containing all module registers.
 */

#define HW_TSI_INSTANCE_COUNT (1U) /*!< Number of instances of the TSI module. */
#define HW_TSI0 (0U) /*!< Instance number for TSI0. */

/*******************************************************************************
 * HW_TSI_GENCS - General Control and Status Register
 ******************************************************************************/

/*!
 * @brief HW_TSI_GENCS - General Control and Status Register (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_tsi_gencs
{
    uint32_t U;
    struct _hw_tsi_gencs_bitfields
    {
        uint32_t STPE : 1;             /*!< [0]  */
        uint32_t STM : 1;              /*!< [1] Scan Trigger Mode. This bit-field can only
                                        * be changed if the TSI module is disabled (TSIEN bit = 0). */
        uint32_t RESERVED0 : 2;        /*!< [3:2]  */
        uint32_t ESOR : 1;             /*!< [4] End-of-Scan or Out-of-Range Interrupt
                                        * select */
        uint32_t ERIE : 1;             /*!< [5] Error Interrupt Enable */
        uint32_t TSIIE : 1;            /*!< [6] Touch Sensing Input Interrupt Module
                                        * Enable */
        uint32_t TSIEN : 1;            /*!< [7] Touch Sensing Input Module Enable */
        uint32_t SWTS : 1;             /*!< [8] Software Trigger Start */
        uint32_t SCNIP : 1;            /*!< [9] Scan In Progress status */
        uint32_t RESERVED1 : 2;        /*!< [11:10]  */
        uint32_t OVRF : 1;             /*!< [12] Overrun error Flag. This flag is set
                                        * when a scan trigger occurs while a scan is still in progress. Write "1",
                                        * when this flag is set, to clear it.. */
        uint32_t EXTERF : 1;           /*!< [13] External Electrode error occurred */
        uint32_t OUTRGF : 1;           /*!< [14] Out of Range Flag. */
        uint32_t EOSF : 1;             /*!< [15] End of Scan Flag. */
        uint32_t PS : 3;               /*!< [18:16] Electrode Oscillator prescaler. . */
        uint32_t NSCN : 5;             /*!< [23:19] Number of Consecutive Scans per
                                        * Electrode electrode. */
        uint32_t LPSCNITV : 4;         /*!< [27:24] TSI Low Power Mode Scan Interval.
                                        * */
        uint32_t LPCLKS : 1;           /*!< [28] Low Power Mode Clock Source Selection.
                                        * */
        uint32_t RESERVED2 : 3;        /*!< [31:29]  */
    } B;
} hw_tsi_gencs_t;

/*!
 * @name Constants and macros for entire TSI_GENCS register
 */
/*@{*/
#define HW_TSI_GENCS_ADDR(x)     ((uint32_t)(x) + 0x0U)

#define HW_TSI_GENCS(x)          (*(__IO hw_tsi_gencs_t *) HW_TSI_GENCS_ADDR(x))
#define HW_TSI_GENCS_RD(x)       (HW_TSI_GENCS(x).U)
#define HW_TSI_GENCS_WR(x, v)    (HW_TSI_GENCS(x).U = (v))
#define HW_TSI_GENCS_SET(x, v)   (HW_TSI_GENCS_WR(x, HW_TSI_GENCS_RD(x) |  (v)))
#define HW_TSI_GENCS_CLR(x, v)   (HW_TSI_GENCS_WR(x, HW_TSI_GENCS_RD(x) & ~(v)))
#define HW_TSI_GENCS_TOG(x, v)   (HW_TSI_GENCS_WR(x, HW_TSI_GENCS_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual TSI_GENCS bitfields
 */

/*!
 * @name Register TSI_GENCS, field STPE[0] (RW)
 *
 * TSI STOP Enable while in Low Power Modes (STOP, VLPS, LLS and VLLS{3,2,1})
 *
 * Values:
 * - 0 - Disable TSI when MCU goes into low power modes.
 * - 1 - Allows TSI to continue running in all low power modes.
 */
/*@{*/
#define BP_TSI_GENCS_STPE    (0U)          /*!< Bit position for TSI_GENCS_STPE. */
#define BM_TSI_GENCS_STPE    (0x00000001U) /*!< Bit mask for TSI_GENCS_STPE. */
#define BS_TSI_GENCS_STPE    (1U)          /*!< Bit field size in bits for TSI_GENCS_STPE. */

/*! @brief Read current value of the TSI_GENCS_STPE field. */
#define BR_TSI_GENCS_STPE(x) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_STPE))

/*! @brief Format value for bitfield TSI_GENCS_STPE. */
#define BF_TSI_GENCS_STPE(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_STPE) & BM_TSI_GENCS_STPE)

/*! @brief Set the STPE field to a new value. */
#define BW_TSI_GENCS_STPE(x, v) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_STPE) = (v))
/*@}*/

/*!
 * @name Register TSI_GENCS, field STM[1] (RW)
 *
 * Values:
 * - 0 - Software trigger scan.
 * - 1 - Periodical Scan.
 */
/*@{*/
#define BP_TSI_GENCS_STM     (1U)          /*!< Bit position for TSI_GENCS_STM. */
#define BM_TSI_GENCS_STM     (0x00000002U) /*!< Bit mask for TSI_GENCS_STM. */
#define BS_TSI_GENCS_STM     (1U)          /*!< Bit field size in bits for TSI_GENCS_STM. */

/*! @brief Read current value of the TSI_GENCS_STM field. */
#define BR_TSI_GENCS_STM(x)  (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_STM))

/*! @brief Format value for bitfield TSI_GENCS_STM. */
#define BF_TSI_GENCS_STM(v)  ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_STM) & BM_TSI_GENCS_STM)

/*! @brief Set the STM field to a new value. */
#define BW_TSI_GENCS_STM(x, v) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_STM) = (v))
/*@}*/

/*!
 * @name Register TSI_GENCS, field ESOR[4] (RW)
 *
 * Values:
 * - 0 - Out-of-Range interrupt is allowed.
 * - 1 - End-of-Scan interrupt is allowed.
 */
/*@{*/
#define BP_TSI_GENCS_ESOR    (4U)          /*!< Bit position for TSI_GENCS_ESOR. */
#define BM_TSI_GENCS_ESOR    (0x00000010U) /*!< Bit mask for TSI_GENCS_ESOR. */
#define BS_TSI_GENCS_ESOR    (1U)          /*!< Bit field size in bits for TSI_GENCS_ESOR. */

