flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*! @brief Read current value of the TSI_GENCS_OUTRGF field. */
#define BR_TSI_GENCS_OUTRGF(x) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_OUTRGF))

/*! @brief Format value for bitfield TSI_GENCS_OUTRGF. */
#define BF_TSI_GENCS_OUTRGF(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_OUTRGF) & BM_TSI_GENCS_OUTRGF)

/*! @brief Set the OUTRGF field to a new value. */
#define BW_TSI_GENCS_OUTRGF(x, v) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_OUTRGF) = (v))
/*@}*/

/*!
 * @name Register TSI_GENCS, field EOSF[15] (RW)
 *
 * This flag is set when all active electrodes are scanned is ended after a scan
 * trigger. Write "1" , when this flag is set, to clear it..
 */
/*@{*/
#define BP_TSI_GENCS_EOSF    (15U)         /*!< Bit position for TSI_GENCS_EOSF. */
#define BM_TSI_GENCS_EOSF    (0x00008000U) /*!< Bit mask for TSI_GENCS_EOSF. */
#define BS_TSI_GENCS_EOSF    (1U)          /*!< Bit field size in bits for TSI_GENCS_EOSF. */

/*! @brief Read current value of the TSI_GENCS_EOSF field. */
#define BR_TSI_GENCS_EOSF(x) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_EOSF))

/*! @brief Format value for bitfield TSI_GENCS_EOSF. */
#define BF_TSI_GENCS_EOSF(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_EOSF) & BM_TSI_GENCS_EOSF)

/*! @brief Set the EOSF field to a new value. */
#define BW_TSI_GENCS_EOSF(x, v) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_EOSF) = (v))
/*@}*/

/*!
 * @name Register TSI_GENCS, field PS[18:16] (RW)
 *
 * This bit-field can only be changed if the TSI module is disabled (TSIEN bit =
 * 0)
 *
 * Values:
 * - 000 - Electrode Oscillator Frequency divided by 1
 * - 001 - Electrode Oscillator Frequency divided by 2
 * - 010 - Electrode Oscillator Frequency divided by 4
 * - 011 - Electrode Oscillator Frequency divided by 8
 * - 100 - Electrode Oscillator Frequency divided by 16
 * - 101 - Electrode Oscillator Frequency divided by 32
 * - 110 - Electrode Oscillator Frequency divided by 64
 * - 111 - Electrode Oscillator Frequency divided by 128
 */
/*@{*/
#define BP_TSI_GENCS_PS      (16U)         /*!< Bit position for TSI_GENCS_PS. */
#define BM_TSI_GENCS_PS      (0x00070000U) /*!< Bit mask for TSI_GENCS_PS. */
#define BS_TSI_GENCS_PS      (3U)          /*!< Bit field size in bits for TSI_GENCS_PS. */

/*! @brief Read current value of the TSI_GENCS_PS field. */
#define BR_TSI_GENCS_PS(x)   (HW_TSI_GENCS(x).B.PS)

/*! @brief Format value for bitfield TSI_GENCS_PS. */
#define BF_TSI_GENCS_PS(v)   ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_PS) & BM_TSI_GENCS_PS)

/*! @brief Set the PS field to a new value. */
#define BW_TSI_GENCS_PS(x, v) (HW_TSI_GENCS_WR(x, (HW_TSI_GENCS_RD(x) & ~BM_TSI_GENCS_PS) | BF_TSI_GENCS_PS(v)))
/*@}*/

/*!
 * @name Register TSI_GENCS, field NSCN[23:19] (RW)
 *
 * This bit-field can only be changed if the TSI module is disabled (TSIEN bit =
 * 0).
 *
 * Values:
 * - 00000 - Once per electrode
 * - 00001 - Twice per electrode
 * - 00010 - 3 times per electrode
 * - 00011 - 4 times per electrode
 * - 00100 - 5 times per electrode
 * - 00101 - 6 times per electrode
 * - 00110 - 7 times per electrode
 * - 00111 - 8 times per electrode
 * - 01000 - 9 times per electrode
 * - 01001 - 10 times per electrode
 * - 01010 - 11 times per electrode
 * - 01011 - 12 times per electrode
 * - 01100 - 13 times per electrode
 * - 01101 - 14 times per electrode
 * - 01110 - 15 times per electrode
 * - 01111 - 16 times per electrode
 * - 10000 - 17 times per electrode
 * - 10001 - 18 times per electrode
 * - 10010 - 19 times per electrode
 * - 10011 - 20 times per electrode
 * - 10100 - 21 times per electrode
 * - 10101 - 22 times per electrode
 * - 10110 - 23 times per electrode
 * - 10111 - 24 times per electrode
 * - 11000 - 25 times per electrode
 * - 11001 - 26 times per electrode
 * - 11010 - 27 times per electrode
 * - 11011 - 28 times per electrode
 * - 11100 - 29 times per electrode
 * - 11101 - 30 times per electrode
 * - 11110 - 31 times per electrode
 * - 11111 - 32 times per electrode
 */
/*@{*/
#define BP_TSI_GENCS_NSCN    (19U)         /*!< Bit position for TSI_GENCS_NSCN. */
#define BM_TSI_GENCS_NSCN    (0x00F80000U) /*!< Bit mask for TSI_GENCS_NSCN. */
#define BS_TSI_GENCS_NSCN    (5U)          /*!< Bit field size in bits for TSI_GENCS_NSCN. */

/*! @brief Read current value of the TSI_GENCS_NSCN field. */
#define BR_TSI_GENCS_NSCN(x) (HW_TSI_GENCS(x).B.NSCN)

/*! @brief Format value for bitfield TSI_GENCS_NSCN. */
#define BF_TSI_GENCS_NSCN(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_NSCN) & BM_TSI_GENCS_NSCN)

/*! @brief Set the NSCN field to a new value. */
#define BW_TSI_GENCS_NSCN(x, v) (HW_TSI_GENCS_WR(x, (HW_TSI_GENCS_RD(x) & ~BM_TSI_GENCS_NSCN) | BF_TSI_GENCS_NSCN(v)))
/*@}*/

/*!
 * @name Register TSI_GENCS, field LPSCNITV[27:24] (RW)
 *
 * This bit-field can only be changed if the TSI module is disabled (TSIEN bit =
 * 0).
 *
 * Values:
 * - 0000 - 1 ms scan interval
 * - 0001 - 5 ms scan interval
 * - 0010 - 10 ms scan interval
 * - 0011 - 15 ms scan interval
 * - 0100 - 20 ms scan interval
 * - 0101 - 30 ms scan interval
 * - 0110 - 40 ms scan interval
 * - 0111 - 50 ms scan interval
 * - 1000 - 75 ms scan interval
 * - 1001 - 100 ms scan interval
 * - 1010 - 125 ms scan interval
 * - 1011 - 150 ms scan interval
 * - 1100 - 200 ms scan interval
 * - 1101 - 300 ms scan interval
 * - 1110 - 400 ms scan interval
 * - 1111 - 500 ms scan interval
 */
/*@{*/
#define BP_TSI_GENCS_LPSCNITV (24U)        /*!< Bit position for TSI_GENCS_LPSCNITV. */
#define BM_TSI_GENCS_LPSCNITV (0x0F000000U) /*!< Bit mask for TSI_GENCS_LPSCNITV. */
#define BS_TSI_GENCS_LPSCNITV (4U)         /*!< Bit field size in bits for TSI_GENCS_LPSCNITV. */

/*! @brief Read current value of the TSI_GENCS_LPSCNITV field. */
#define BR_TSI_GENCS_LPSCNITV(x) (HW_TSI_GENCS(x).B.LPSCNITV)

/*! @brief Format value for bitfield TSI_GENCS_LPSCNITV. */
#define BF_TSI_GENCS_LPSCNITV(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_LPSCNITV) & BM_TSI_GENCS_LPSCNITV)

/*! @brief Set the LPSCNITV field to a new value. */
#define BW_TSI_GENCS_LPSCNITV(x, v) (HW_TSI_GENCS_WR(x, (HW_TSI_GENCS_RD(x) & ~BM_TSI_GENCS_LPSCNITV) | BF_TSI_GENCS_LPSCNITV(v)))
/*@}*/

/*!
 * @name Register TSI_GENCS, field LPCLKS[28] (RW)
 *
 * This bit-field can only be changed if the TSI module is disabled (TSIEN bit =
 * 0).
 *
 * Values:
 * - 0 - LPOCLK is selected to determine the scan period in low power mode
 * - 1 - VLPOSCCLK is selected to determine the scan period in low power mode
 */
/*@{*/
#define BP_TSI_GENCS_LPCLKS  (28U)         /*!< Bit position for TSI_GENCS_LPCLKS. */
#define BM_TSI_GENCS_LPCLKS  (0x10000000U) /*!< Bit mask for TSI_GENCS_LPCLKS. */
#define BS_TSI_GENCS_LPCLKS  (1U)          /*!< Bit field size in bits for TSI_GENCS_LPCLKS. */

/*! @brief Read current value of the TSI_GENCS_LPCLKS field. */
#define BR_TSI_GENCS_LPCLKS(x) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_LPCLKS))

