flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*! @brief Format value for bitfield TSI_GENCS_LPCLKS. */
#define BF_TSI_GENCS_LPCLKS(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_LPCLKS) & BM_TSI_GENCS_LPCLKS)

/*! @brief Set the LPCLKS field to a new value. */
#define BW_TSI_GENCS_LPCLKS(x, v) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_LPCLKS) = (v))
/*@}*/

/*******************************************************************************
 * HW_TSI_SCANC - SCAN Control Register
 ******************************************************************************/

/*!
 * @brief HW_TSI_SCANC - SCAN Control Register (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_tsi_scanc
{
    uint32_t U;
    struct _hw_tsi_scanc_bitfields
    {
        uint32_t AMPSC : 3;            /*!< [2:0] Active Mode Prescaler */
        uint32_t AMCLKS : 2;           /*!< [4:3] Active Mode Clock Source */
        uint32_t RESERVED0 : 3;        /*!< [7:5]  */
        uint32_t SMOD : 8;             /*!< [15:8] Scan Module */
        uint32_t EXTCHRG : 4;          /*!< [19:16] External OSC Charge Current select
                                        * */
        uint32_t RESERVED1 : 4;        /*!< [23:20]  */
        uint32_t REFCHRG : 4;          /*!< [27:24] Ref OSC Charge Current select */
        uint32_t RESERVED2 : 4;        /*!< [31:28]  */
    } B;
} hw_tsi_scanc_t;

/*!
 * @name Constants and macros for entire TSI_SCANC register
 */
/*@{*/
#define HW_TSI_SCANC_ADDR(x)     ((uint32_t)(x) + 0x4U)

#define HW_TSI_SCANC(x)          (*(__IO hw_tsi_scanc_t *) HW_TSI_SCANC_ADDR(x))
#define HW_TSI_SCANC_RD(x)       (HW_TSI_SCANC(x).U)
#define HW_TSI_SCANC_WR(x, v)    (HW_TSI_SCANC(x).U = (v))
#define HW_TSI_SCANC_SET(x, v)   (HW_TSI_SCANC_WR(x, HW_TSI_SCANC_RD(x) |  (v)))
#define HW_TSI_SCANC_CLR(x, v)   (HW_TSI_SCANC_WR(x, HW_TSI_SCANC_RD(x) & ~(v)))
#define HW_TSI_SCANC_TOG(x, v)   (HW_TSI_SCANC_WR(x, HW_TSI_SCANC_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual TSI_SCANC bitfields
 */

/*!
 * @name Register TSI_SCANC, field AMPSC[2:0] (RW)
 *
 * Values:
 * - 000 - Input Clock Source divided by 1.
 * - 001 - Input Clock Source divided by 2.
 * - 010 - Input Clock Source divided by 4.
 * - 011 - Input Clock Source divided by 8.
 * - 100 - Input Clock Source divided by 16.
 * - 101 - Input Clock Source divided by 32.
 * - 110 - Input Clock Source divided by 64.
 * - 111 - Input Clock Source divided by 128.
 */
/*@{*/
#define BP_TSI_SCANC_AMPSC   (0U)          /*!< Bit position for TSI_SCANC_AMPSC. */
#define BM_TSI_SCANC_AMPSC   (0x00000007U) /*!< Bit mask for TSI_SCANC_AMPSC. */
#define BS_TSI_SCANC_AMPSC   (3U)          /*!< Bit field size in bits for TSI_SCANC_AMPSC. */

/*! @brief Read current value of the TSI_SCANC_AMPSC field. */
#define BR_TSI_SCANC_AMPSC(x) (HW_TSI_SCANC(x).B.AMPSC)

/*! @brief Format value for bitfield TSI_SCANC_AMPSC. */
#define BF_TSI_SCANC_AMPSC(v) ((uint32_t)((uint32_t)(v) << BP_TSI_SCANC_AMPSC) & BM_TSI_SCANC_AMPSC)

/*! @brief Set the AMPSC field to a new value. */
#define BW_TSI_SCANC_AMPSC(x, v) (HW_TSI_SCANC_WR(x, (HW_TSI_SCANC_RD(x) & ~BM_TSI_SCANC_AMPSC) | BF_TSI_SCANC_AMPSC(v)))
/*@}*/

/*!
 * @name Register TSI_SCANC, field AMCLKS[4:3] (RW)
 *
 * Values:
 * - 00 - LPOSCCLK
 * - 01 - MCGIRCLK.
 * - 10 - OSCERCLK.
 * - 11 - Not valid.
 */
/*@{*/
#define BP_TSI_SCANC_AMCLKS  (3U)          /*!< Bit position for TSI_SCANC_AMCLKS. */
#define BM_TSI_SCANC_AMCLKS  (0x00000018U) /*!< Bit mask for TSI_SCANC_AMCLKS. */
#define BS_TSI_SCANC_AMCLKS  (2U)          /*!< Bit field size in bits for TSI_SCANC_AMCLKS. */

/*! @brief Read current value of the TSI_SCANC_AMCLKS field. */
#define BR_TSI_SCANC_AMCLKS(x) (HW_TSI_SCANC(x).B.AMCLKS)

/*! @brief Format value for bitfield TSI_SCANC_AMCLKS. */
#define BF_TSI_SCANC_AMCLKS(v) ((uint32_t)((uint32_t)(v) << BP_TSI_SCANC_AMCLKS) & BM_TSI_SCANC_AMCLKS)

/*! @brief Set the AMCLKS field to a new value. */
#define BW_TSI_SCANC_AMCLKS(x, v) (HW_TSI_SCANC_WR(x, (HW_TSI_SCANC_RD(x) & ~BM_TSI_SCANC_AMCLKS) | BF_TSI_SCANC_AMCLKS(v)))
/*@}*/

/*!
 * @name Register TSI_SCANC, field SMOD[15:8] (RW)
 *
 * Values:
 * - 00000000 - Continue Scan.
 */
/*@{*/
#define BP_TSI_SCANC_SMOD    (8U)          /*!< Bit position for TSI_SCANC_SMOD. */
#define BM_TSI_SCANC_SMOD    (0x0000FF00U) /*!< Bit mask for TSI_SCANC_SMOD. */
#define BS_TSI_SCANC_SMOD    (8U)          /*!< Bit field size in bits for TSI_SCANC_SMOD. */

/*! @brief Read current value of the TSI_SCANC_SMOD field. */
#define BR_TSI_SCANC_SMOD(x) (HW_TSI_SCANC(x).B.SMOD)

/*! @brief Format value for bitfield TSI_SCANC_SMOD. */
#define BF_TSI_SCANC_SMOD(v) ((uint32_t)((uint32_t)(v) << BP_TSI_SCANC_SMOD) & BM_TSI_SCANC_SMOD)

/*! @brief Set the SMOD field to a new value. */
#define BW_TSI_SCANC_SMOD(x, v) (HW_TSI_SCANC_WR(x, (HW_TSI_SCANC_RD(x) & ~BM_TSI_SCANC_SMOD) | BF_TSI_SCANC_SMOD(v)))
/*@}*/

/*!
 * @name Register TSI_SCANC, field EXTCHRG[19:16] (RW)
 *
 * Values:
 * - 0000 - 2 uA charge current.
 * - 0001 - 4 uA charge current.
 * - 0010 - 6 uA charge current.
 * - 0011 - 8 uA charge current.
 * - 0100 - 10 uA charge current.
 * - 0101 - 12 uA charge current.
 * - 0110 - 14 uA charge current.
 * - 0111 - 16 uA charge current.
 * - 1000 - 18 uA charge current.
 * - 1001 - 20 uA charge current.
 * - 1010 - 22 uA charge current.
 * - 1011 - 24 uA charge current.
 * - 1100 - 26 uA charge current.
 * - 1101 - 28 uA charge current.
 * - 1110 - 30 uA charge current.
 * - 1111 - 32 uA charge current.
 */
/*@{*/
#define BP_TSI_SCANC_EXTCHRG (16U)         /*!< Bit position for TSI_SCANC_EXTCHRG. */
#define BM_TSI_SCANC_EXTCHRG (0x000F0000U) /*!< Bit mask for TSI_SCANC_EXTCHRG. */
#define BS_TSI_SCANC_EXTCHRG (4U)          /*!< Bit field size in bits for TSI_SCANC_EXTCHRG. */

/*! @brief Read current value of the TSI_SCANC_EXTCHRG field. */
#define BR_TSI_SCANC_EXTCHRG(x) (HW_TSI_SCANC(x).B.EXTCHRG)

/*! @brief Format value for bitfield TSI_SCANC_EXTCHRG. */
#define BF_TSI_SCANC_EXTCHRG(v) ((uint32_t)((uint32_t)(v) << BP_TSI_SCANC_EXTCHRG) & BM_TSI_SCANC_EXTCHRG)

/*! @brief Set the EXTCHRG field to a new value. */
#define BW_TSI_SCANC_EXTCHRG(x, v) (HW_TSI_SCANC_WR(x, (HW_TSI_SCANC_RD(x) & ~BM_TSI_SCANC_EXTCHRG) | BF_TSI_SCANC_EXTCHRG(v)))
/*@}*/

/*!
 * @name Register TSI_SCANC, field REFCHRG[27:24] (RW)
 *
 * Values:
 * - 0000 - 2 uA charge current.
 * - 0001 - 4 uA charge current.
 * - 0010 - 6 uA charge current.
 * - 0011 - 8 uA charge current.
 * - 0100 - 10 uA charge current.
 * - 0101 - 12 uA charge current.
 * - 0110 - 14 uA charge current.
 * - 0111 - 16 uA charge current.
 * - 1000 - 18 uA charge current.
 * - 1001 - 20 uA charge current.
 * - 1010 - 22 uA charge current.
 * - 1011 - 24 uA charge current.
 * - 1100 - 26 uA charge current.
 * - 1101 - 28 uA charge current.
 * - 1110 - 30 uA charge current.
 * - 1111 - 32 uA charge current.
 */
/*@{*/
#define BP_TSI_SCANC_REFCHRG (24U)         /*!< Bit position for TSI_SCANC_REFCHRG. */
#define BM_TSI_SCANC_REFCHRG (0x0F000000U) /*!< Bit mask for TSI_SCANC_REFCHRG. */
#define BS_TSI_SCANC_REFCHRG (4U)          /*!< Bit field size in bits for TSI_SCANC_REFCHRG. */

