flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*! @brief Read current value of the TSI_SCANC_REFCHRG field. */
#define BR_TSI_SCANC_REFCHRG(x) (HW_TSI_SCANC(x).B.REFCHRG)

/*! @brief Format value for bitfield TSI_SCANC_REFCHRG. */
#define BF_TSI_SCANC_REFCHRG(v) ((uint32_t)((uint32_t)(v) << BP_TSI_SCANC_REFCHRG) & BM_TSI_SCANC_REFCHRG)

/*! @brief Set the REFCHRG field to a new value. */
#define BW_TSI_SCANC_REFCHRG(x, v) (HW_TSI_SCANC_WR(x, (HW_TSI_SCANC_RD(x) & ~BM_TSI_SCANC_REFCHRG) | BF_TSI_SCANC_REFCHRG(v)))
/*@}*/

/*******************************************************************************
 * HW_TSI_PEN - Pin Enable Register
 ******************************************************************************/

/*!
 * @brief HW_TSI_PEN - Pin Enable Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * Do not change the settings when TSIEN is 1.
 */
typedef union _hw_tsi_pen
{
    uint32_t U;
    struct _hw_tsi_pen_bitfields
    {
        uint32_t PEN0 : 1;             /*!< [0] Touch Sensing Input Pin Enable Register 0
                                        * */
        uint32_t PEN1 : 1;             /*!< [1] Touch Sensing Input Pin Enable Register 1
                                        * */
        uint32_t PEN2 : 1;             /*!< [2] Touch Sensing Input Pin Enable Register 2
                                        * */
        uint32_t PEN3 : 1;             /*!< [3] Touch Sensing Input Pin Enable Register 3
                                        * */
        uint32_t PEN4 : 1;             /*!< [4] Touch Sensing Input Pin Enable Register 4
                                        * */
        uint32_t PEN5 : 1;             /*!< [5] Touch Sensing Input Pin Enable Register 5
                                        * */
        uint32_t PEN6 : 1;             /*!< [6] Touch Sensing Input Pin Enable Register 6
                                        * */
        uint32_t PEN7 : 1;             /*!< [7] Touch Sensing Input Pin Enable Register 7
                                        * */
        uint32_t PEN8 : 1;             /*!< [8] Touch Sensing Input Pin Enable Register 8
                                        * */
        uint32_t PEN9 : 1;             /*!< [9] Touch Sensing Input Pin Enable Register 9
                                        * */
        uint32_t PEN10 : 1;            /*!< [10] Touch Sensing Input Pin Enable Register
                                        * 10 */
        uint32_t PEN11 : 1;            /*!< [11] Touch Sensing Input Pin Enable Register
                                        * 11 */
        uint32_t PEN12 : 1;            /*!< [12] Touch Sensing Input Pin Enable Register
                                        * 12 */
        uint32_t PEN13 : 1;            /*!< [13] Touch Sensing Input Pin Enable Register
                                        * 13 */
        uint32_t PEN14 : 1;            /*!< [14] Touch Sensing Input Pin Enable Register
                                        * 14 */
        uint32_t PEN15 : 1;            /*!< [15] Touch Sensing Input Pin Enable Register
                                        * 15 */
        uint32_t LPSP : 4;             /*!< [19:16] Low Power Scan Pin */
        uint32_t RESERVED0 : 12;       /*!< [31:20]  */
    } B;
} hw_tsi_pen_t;

/*!
 * @name Constants and macros for entire TSI_PEN register
 */
/*@{*/
#define HW_TSI_PEN_ADDR(x)       ((uint32_t)(x) + 0x8U)

#define HW_TSI_PEN(x)            (*(__IO hw_tsi_pen_t *) HW_TSI_PEN_ADDR(x))
#define HW_TSI_PEN_RD(x)         (HW_TSI_PEN(x).U)
#define HW_TSI_PEN_WR(x, v)      (HW_TSI_PEN(x).U = (v))
#define HW_TSI_PEN_SET(x, v)     (HW_TSI_PEN_WR(x, HW_TSI_PEN_RD(x) |  (v)))
#define HW_TSI_PEN_CLR(x, v)     (HW_TSI_PEN_WR(x, HW_TSI_PEN_RD(x) & ~(v)))
#define HW_TSI_PEN_TOG(x, v)     (HW_TSI_PEN_WR(x, HW_TSI_PEN_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual TSI_PEN bitfields
 */

/*!
 * @name Register TSI_PEN, field PEN0[0] (RW)
 *
 * Values:
 * - 0 - The corresponding pin is not used by TSI.
 * - 1 - The corresponding pin is used by TSI.
 */
/*@{*/
#define BP_TSI_PEN_PEN0      (0U)          /*!< Bit position for TSI_PEN_PEN0. */
#define BM_TSI_PEN_PEN0      (0x00000001U) /*!< Bit mask for TSI_PEN_PEN0. */
#define BS_TSI_PEN_PEN0      (1U)          /*!< Bit field size in bits for TSI_PEN_PEN0. */

/*! @brief Read current value of the TSI_PEN_PEN0 field. */
#define BR_TSI_PEN_PEN0(x)   (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN0))

/*! @brief Format value for bitfield TSI_PEN_PEN0. */
#define BF_TSI_PEN_PEN0(v)   ((uint32_t)((uint32_t)(v) << BP_TSI_PEN_PEN0) & BM_TSI_PEN_PEN0)

/*! @brief Set the PEN0 field to a new value. */
#define BW_TSI_PEN_PEN0(x, v) (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN0) = (v))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN1[1] (RW)
 *
 * Values:
 * - 0 - The corresponding pin is not used by TSI.
 * - 1 - The corresponding pin is used by TSI.
 */
/*@{*/
#define BP_TSI_PEN_PEN1      (1U)          /*!< Bit position for TSI_PEN_PEN1. */
#define BM_TSI_PEN_PEN1      (0x00000002U) /*!< Bit mask for TSI_PEN_PEN1. */
#define BS_TSI_PEN_PEN1      (1U)          /*!< Bit field size in bits for TSI_PEN_PEN1. */

/*! @brief Read current value of the TSI_PEN_PEN1 field. */
#define BR_TSI_PEN_PEN1(x)   (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN1))

/*! @brief Format value for bitfield TSI_PEN_PEN1. */
#define BF_TSI_PEN_PEN1(v)   ((uint32_t)((uint32_t)(v) << BP_TSI_PEN_PEN1) & BM_TSI_PEN_PEN1)

/*! @brief Set the PEN1 field to a new value. */
#define BW_TSI_PEN_PEN1(x, v) (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN1) = (v))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN2[2] (RW)
 *
 * Values:
 * - 0 - The corresponding pin is not used by TSI.
 * - 1 - The corresponding pin is used by TSI.
 */
/*@{*/
#define BP_TSI_PEN_PEN2      (2U)          /*!< Bit position for TSI_PEN_PEN2. */
#define BM_TSI_PEN_PEN2      (0x00000004U) /*!< Bit mask for TSI_PEN_PEN2. */
#define BS_TSI_PEN_PEN2      (1U)          /*!< Bit field size in bits for TSI_PEN_PEN2. */

/*! @brief Read current value of the TSI_PEN_PEN2 field. */
#define BR_TSI_PEN_PEN2(x)   (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN2))

/*! @brief Format value for bitfield TSI_PEN_PEN2. */
#define BF_TSI_PEN_PEN2(v)   ((uint32_t)((uint32_t)(v) << BP_TSI_PEN_PEN2) & BM_TSI_PEN_PEN2)

/*! @brief Set the PEN2 field to a new value. */
#define BW_TSI_PEN_PEN2(x, v) (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN2) = (v))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN3[3] (RW)
 *
 * Values:
 * - 0 - The corresponding pin is not used by TSI.
 * - 1 - The corresponding pin is used by TSI.
 */
/*@{*/
#define BP_TSI_PEN_PEN3      (3U)          /*!< Bit position for TSI_PEN_PEN3. */
#define BM_TSI_PEN_PEN3      (0x00000008U) /*!< Bit mask for TSI_PEN_PEN3. */
#define BS_TSI_PEN_PEN3      (1U)          /*!< Bit field size in bits for TSI_PEN_PEN3. */

/*! @brief Read current value of the TSI_PEN_PEN3 field. */
#define BR_TSI_PEN_PEN3(x)   (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN3))

/*! @brief Format value for bitfield TSI_PEN_PEN3. */
#define BF_TSI_PEN_PEN3(v)   ((uint32_t)((uint32_t)(v) << BP_TSI_PEN_PEN3) & BM_TSI_PEN_PEN3)

