flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*! @brief Format value for bitfield TSI_PEN_PEN11. */
#define BF_TSI_PEN_PEN11(v)  ((uint32_t)((uint32_t)(v) << BP_TSI_PEN_PEN11) & BM_TSI_PEN_PEN11)

/*! @brief Set the PEN11 field to a new value. */
#define BW_TSI_PEN_PEN11(x, v) (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN11) = (v))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN12[12] (RW)
 *
 * Values:
 * - 0 - The corresponding pin is not used by TSI.
 * - 1 - The corresponding pin is used by TSI.
 */
/*@{*/
#define BP_TSI_PEN_PEN12     (12U)         /*!< Bit position for TSI_PEN_PEN12. */
#define BM_TSI_PEN_PEN12     (0x00001000U) /*!< Bit mask for TSI_PEN_PEN12. */
#define BS_TSI_PEN_PEN12     (1U)          /*!< Bit field size in bits for TSI_PEN_PEN12. */

/*! @brief Read current value of the TSI_PEN_PEN12 field. */
#define BR_TSI_PEN_PEN12(x)  (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN12))

/*! @brief Format value for bitfield TSI_PEN_PEN12. */
#define BF_TSI_PEN_PEN12(v)  ((uint32_t)((uint32_t)(v) << BP_TSI_PEN_PEN12) & BM_TSI_PEN_PEN12)

/*! @brief Set the PEN12 field to a new value. */
#define BW_TSI_PEN_PEN12(x, v) (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN12) = (v))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN13[13] (RW)
 *
 * Values:
 * - 0 - The corresponding pin is not used by TSI.
 * - 1 - The corresponding pin is used by TSI.
 */
/*@{*/
#define BP_TSI_PEN_PEN13     (13U)         /*!< Bit position for TSI_PEN_PEN13. */
#define BM_TSI_PEN_PEN13     (0x00002000U) /*!< Bit mask for TSI_PEN_PEN13. */
#define BS_TSI_PEN_PEN13     (1U)          /*!< Bit field size in bits for TSI_PEN_PEN13. */

/*! @brief Read current value of the TSI_PEN_PEN13 field. */
#define BR_TSI_PEN_PEN13(x)  (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN13))

/*! @brief Format value for bitfield TSI_PEN_PEN13. */
#define BF_TSI_PEN_PEN13(v)  ((uint32_t)((uint32_t)(v) << BP_TSI_PEN_PEN13) & BM_TSI_PEN_PEN13)

/*! @brief Set the PEN13 field to a new value. */
#define BW_TSI_PEN_PEN13(x, v) (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN13) = (v))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN14[14] (RW)
 *
 * Values:
 * - 0 - The corresponding pin is not used by TSI.
 * - 1 - The corresponding pin is used by TSI.
 */
/*@{*/
#define BP_TSI_PEN_PEN14     (14U)         /*!< Bit position for TSI_PEN_PEN14. */
#define BM_TSI_PEN_PEN14     (0x00004000U) /*!< Bit mask for TSI_PEN_PEN14. */
#define BS_TSI_PEN_PEN14     (1U)          /*!< Bit field size in bits for TSI_PEN_PEN14. */

/*! @brief Read current value of the TSI_PEN_PEN14 field. */
#define BR_TSI_PEN_PEN14(x)  (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN14))

/*! @brief Format value for bitfield TSI_PEN_PEN14. */
#define BF_TSI_PEN_PEN14(v)  ((uint32_t)((uint32_t)(v) << BP_TSI_PEN_PEN14) & BM_TSI_PEN_PEN14)

/*! @brief Set the PEN14 field to a new value. */
#define BW_TSI_PEN_PEN14(x, v) (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN14) = (v))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN15[15] (RW)
 *
 * Values:
 * - 0 - The corresponding pin is not used by TSI.
 * - 1 - The corresponding pin is used by TSI.
 */
/*@{*/
#define BP_TSI_PEN_PEN15     (15U)         /*!< Bit position for TSI_PEN_PEN15. */
#define BM_TSI_PEN_PEN15     (0x00008000U) /*!< Bit mask for TSI_PEN_PEN15. */
#define BS_TSI_PEN_PEN15     (1U)          /*!< Bit field size in bits for TSI_PEN_PEN15. */

/*! @brief Read current value of the TSI_PEN_PEN15 field. */
#define BR_TSI_PEN_PEN15(x)  (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN15))

/*! @brief Format value for bitfield TSI_PEN_PEN15. */
#define BF_TSI_PEN_PEN15(v)  ((uint32_t)((uint32_t)(v) << BP_TSI_PEN_PEN15) & BM_TSI_PEN_PEN15)

/*! @brief Set the PEN15 field to a new value. */
#define BW_TSI_PEN_PEN15(x, v) (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN15) = (v))
/*@}*/

/*!
 * @name Register TSI_PEN, field LPSP[19:16] (RW)
 *
 * Values:
 * - 0000 - TSI_IN[0] is active in low power mode.
 * - 0001 - TSI_IN[1] is active in low power mode.
 * - 0010 - TSI_IN[2] is active in low power mode.
 * - 0011 - TSI_IN[3] is active in low power mode.
 * - 0100 - TSI_IN[4] is active in low power mode.
 * - 0101 - TSI_IN[5] is active in low power mode.
 * - 0110 - TSI_IN[6] is active in low power mode.
 * - 0111 - TSI_IN[7] is active in low power mode.
 * - 1000 - TSI_IN[8] is active in low power mode.
 * - 1001 - TSI_IN[9] is active in low power mode.
 * - 1010 - TSI_IN[10] is active in low power mode.
 * - 1011 - TSI_IN[11] is active in low power mode.
 * - 1100 - TSI_IN[12] is active in low power mode.
 * - 1101 - TSI_IN[13] is active in low power mode.
 * - 1110 - TSI_IN[14] is active in low power mode.
 * - 1111 - TSI_IN[15] is active in low power mode.
 */
/*@{*/
#define BP_TSI_PEN_LPSP      (16U)         /*!< Bit position for TSI_PEN_LPSP. */
#define BM_TSI_PEN_LPSP      (0x000F0000U) /*!< Bit mask for TSI_PEN_LPSP. */
#define BS_TSI_PEN_LPSP      (4U)          /*!< Bit field size in bits for TSI_PEN_LPSP. */

/*! @brief Read current value of the TSI_PEN_LPSP field. */
#define BR_TSI_PEN_LPSP(x)   (HW_TSI_PEN(x).B.LPSP)

/*! @brief Format value for bitfield TSI_PEN_LPSP. */
#define BF_TSI_PEN_LPSP(v)   ((uint32_t)((uint32_t)(v) << BP_TSI_PEN_LPSP) & BM_TSI_PEN_LPSP)

/*! @brief Set the LPSP field to a new value. */
#define BW_TSI_PEN_LPSP(x, v) (HW_TSI_PEN_WR(x, (HW_TSI_PEN_RD(x) & ~BM_TSI_PEN_LPSP) | BF_TSI_PEN_LPSP(v)))
/*@}*/

/*******************************************************************************
 * HW_TSI_WUCNTR - Wake-Up Channel Counter Register
 ******************************************************************************/

/*!
 * @brief HW_TSI_WUCNTR - Wake-Up Channel Counter Register (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_tsi_wucntr
{
    uint32_t U;
    struct _hw_tsi_wucntr_bitfields
    {
        uint32_t WUCNT : 16;           /*!< [15:0] TouchSensing wake-up Channel 16bit
                                        * counter value */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_tsi_wucntr_t;

/*!
 * @name Constants and macros for entire TSI_WUCNTR register
 */
/*@{*/
#define HW_TSI_WUCNTR_ADDR(x)    ((uint32_t)(x) + 0xCU)

#define HW_TSI_WUCNTR(x)         (*(__I hw_tsi_wucntr_t *) HW_TSI_WUCNTR_ADDR(x))
#define HW_TSI_WUCNTR_RD(x)      (HW_TSI_WUCNTR(x).U)
/*@}*/

