flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*******************************************************************************
 * HW_TSI_CNTR7 - Counter Register
 ******************************************************************************/

/*!
 * @brief HW_TSI_CNTR7 - Counter Register (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_tsi_cntr7
{
    uint32_t U;
    struct _hw_tsi_cntr7_bitfields
    {
        uint32_t CTN1 : 16;            /*!< [15:0] TouchSensing Channel n-1 16-bit
                                        * counter value */
        uint32_t CTN : 16;             /*!< [31:16] TouchSensing Channel n 16-bit counter
                                        * value */
    } B;
} hw_tsi_cntr7_t;

/*!
 * @name Constants and macros for entire TSI_CNTR7 register
 */
/*@{*/
#define HW_TSI_CNTR7_ADDR(x)     ((uint32_t)(x) + 0x10CU)

#define HW_TSI_CNTR7(x)          (*(__I hw_tsi_cntr7_t *) HW_TSI_CNTR7_ADDR(x))
#define HW_TSI_CNTR7_RD(x)       (HW_TSI_CNTR7(x).U)
/*@}*/

/*
 * Constants & macros for individual TSI_CNTR7 bitfields
 */

/*!
 * @name Register TSI_CNTR7, field CTN1[15:0] (RO)
 */
/*@{*/
#define BP_TSI_CNTR7_CTN1    (0U)          /*!< Bit position for TSI_CNTR7_CTN1. */
#define BM_TSI_CNTR7_CTN1    (0x0000FFFFU) /*!< Bit mask for TSI_CNTR7_CTN1. */
#define BS_TSI_CNTR7_CTN1    (16U)         /*!< Bit field size in bits for TSI_CNTR7_CTN1. */

/*! @brief Read current value of the TSI_CNTR7_CTN1 field. */
#define BR_TSI_CNTR7_CTN1(x) (HW_TSI_CNTR7(x).B.CTN1)
/*@}*/

/*!
 * @name Register TSI_CNTR7, field CTN[31:16] (RO)
 */
/*@{*/
#define BP_TSI_CNTR7_CTN     (16U)         /*!< Bit position for TSI_CNTR7_CTN. */
#define BM_TSI_CNTR7_CTN     (0xFFFF0000U) /*!< Bit mask for TSI_CNTR7_CTN. */
#define BS_TSI_CNTR7_CTN     (16U)         /*!< Bit field size in bits for TSI_CNTR7_CTN. */

/*! @brief Read current value of the TSI_CNTR7_CTN field. */
#define BR_TSI_CNTR7_CTN(x)  (HW_TSI_CNTR7(x).B.CTN)
/*@}*/

/*******************************************************************************
 * HW_TSI_CNTR9 - Counter Register
 ******************************************************************************/

/*!
 * @brief HW_TSI_CNTR9 - Counter Register (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_tsi_cntr9
{
    uint32_t U;
    struct _hw_tsi_cntr9_bitfields
    {
        uint32_t CTN1 : 16;            /*!< [15:0] TouchSensing Channel n-1 16-bit
                                        * counter value */
        uint32_t CTN : 16;             /*!< [31:16] TouchSensing Channel n 16-bit counter
                                        * value */
    } B;
} hw_tsi_cntr9_t;

/*!
 * @name Constants and macros for entire TSI_CNTR9 register
 */
/*@{*/
#define HW_TSI_CNTR9_ADDR(x)     ((uint32_t)(x) + 0x110U)

#define HW_TSI_CNTR9(x)          (*(__I hw_tsi_cntr9_t *) HW_TSI_CNTR9_ADDR(x))
#define HW_TSI_CNTR9_RD(x)       (HW_TSI_CNTR9(x).U)
/*@}*/

/*
 * Constants & macros for individual TSI_CNTR9 bitfields
 */

/*!
 * @name Register TSI_CNTR9, field CTN1[15:0] (RO)
 */
/*@{*/
#define BP_TSI_CNTR9_CTN1    (0U)          /*!< Bit position for TSI_CNTR9_CTN1. */
#define BM_TSI_CNTR9_CTN1    (0x0000FFFFU) /*!< Bit mask for TSI_CNTR9_CTN1. */
#define BS_TSI_CNTR9_CTN1    (16U)         /*!< Bit field size in bits for TSI_CNTR9_CTN1. */

/*! @brief Read current value of the TSI_CNTR9_CTN1 field. */
#define BR_TSI_CNTR9_CTN1(x) (HW_TSI_CNTR9(x).B.CTN1)
/*@}*/

/*!
 * @name Register TSI_CNTR9, field CTN[31:16] (RO)
 */
/*@{*/
#define BP_TSI_CNTR9_CTN     (16U)         /*!< Bit position for TSI_CNTR9_CTN. */
#define BM_TSI_CNTR9_CTN     (0xFFFF0000U) /*!< Bit mask for TSI_CNTR9_CTN. */
#define BS_TSI_CNTR9_CTN     (16U)         /*!< Bit field size in bits for TSI_CNTR9_CTN. */

/*! @brief Read current value of the TSI_CNTR9_CTN field. */
#define BR_TSI_CNTR9_CTN(x)  (HW_TSI_CNTR9(x).B.CTN)
/*@}*/

/*******************************************************************************
 * HW_TSI_CNTR11 - Counter Register
 ******************************************************************************/

/*!
 * @brief HW_TSI_CNTR11 - Counter Register (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_tsi_cntr11
{
    uint32_t U;
    struct _hw_tsi_cntr11_bitfields
    {
        uint32_t CTN1 : 16;            /*!< [15:0] TouchSensing Channel n-1 16-bit
                                        * counter value */
        uint32_t CTN : 16;             /*!< [31:16] TouchSensing Channel n 16-bit counter
                                        * value */
    } B;
} hw_tsi_cntr11_t;

/*!
 * @name Constants and macros for entire TSI_CNTR11 register
 */
/*@{*/
#define HW_TSI_CNTR11_ADDR(x)    ((uint32_t)(x) + 0x114U)

#define HW_TSI_CNTR11(x)         (*(__I hw_tsi_cntr11_t *) HW_TSI_CNTR11_ADDR(x))
#define HW_TSI_CNTR11_RD(x)      (HW_TSI_CNTR11(x).U)
/*@}*/

/*
 * Constants & macros for individual TSI_CNTR11 bitfields
 */

/*!
 * @name Register TSI_CNTR11, field CTN1[15:0] (RO)
 */
/*@{*/
#define BP_TSI_CNTR11_CTN1   (0U)          /*!< Bit position for TSI_CNTR11_CTN1. */
#define BM_TSI_CNTR11_CTN1   (0x0000FFFFU) /*!< Bit mask for TSI_CNTR11_CTN1. */
#define BS_TSI_CNTR11_CTN1   (16U)         /*!< Bit field size in bits for TSI_CNTR11_CTN1. */

/*! @brief Read current value of the TSI_CNTR11_CTN1 field. */
#define BR_TSI_CNTR11_CTN1(x) (HW_TSI_CNTR11(x).B.CTN1)
/*@}*/

/*!
 * @name Register TSI_CNTR11, field CTN[31:16] (RO)
 */
/*@{*/
#define BP_TSI_CNTR11_CTN    (16U)         /*!< Bit position for TSI_CNTR11_CTN. */
#define BM_TSI_CNTR11_CTN    (0xFFFF0000U) /*!< Bit mask for TSI_CNTR11_CTN. */
#define BS_TSI_CNTR11_CTN    (16U)         /*!< Bit field size in bits for TSI_CNTR11_CTN. */

/*! @brief Read current value of the TSI_CNTR11_CTN field. */
#define BR_TSI_CNTR11_CTN(x) (HW_TSI_CNTR11(x).B.CTN)
/*@}*/

/*******************************************************************************
 * HW_TSI_CNTR13 - Counter Register
 ******************************************************************************/

/*!
 * @brief HW_TSI_CNTR13 - Counter Register (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_tsi_cntr13
{
    uint32_t U;
    struct _hw_tsi_cntr13_bitfields
    {
        uint32_t CTN1 : 16;            /*!< [15:0] TouchSensing Channel n-1 16-bit
                                        * counter value */
        uint32_t CTN : 16;             /*!< [31:16] TouchSensing Channel n 16-bit counter
                                        * value */
    } B;
} hw_tsi_cntr13_t;

/*!
 * @name Constants and macros for entire TSI_CNTR13 register
 */
/*@{*/
#define HW_TSI_CNTR13_ADDR(x)    ((uint32_t)(x) + 0x118U)

