flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*******************************************************************************
 * hw_tsi_t - module struct
 ******************************************************************************/
/*!
 * @brief All TSI module registers.
 */
#pragma pack(1)
typedef struct _hw_tsi
{
    __IO hw_tsi_gencs_t GENCS;             /*!< [0x0] General Control and Status Register */
    __IO hw_tsi_scanc_t SCANC;             /*!< [0x4] SCAN Control Register */
    __IO hw_tsi_pen_t PEN;                 /*!< [0x8] Pin Enable Register */
    __I hw_tsi_wucntr_t WUCNTR;            /*!< [0xC] Wake-Up Channel Counter Register */
    uint8_t _reserved0[240];
    __I hw_tsi_cntr1_t CNTR1;              /*!< [0x100] Counter Register */
    __I hw_tsi_cntr3_t CNTR3;              /*!< [0x104] Counter Register */
    __I hw_tsi_cntr5_t CNTR5;              /*!< [0x108] Counter Register */
    __I hw_tsi_cntr7_t CNTR7;              /*!< [0x10C] Counter Register */
    __I hw_tsi_cntr9_t CNTR9;              /*!< [0x110] Counter Register */
    __I hw_tsi_cntr11_t CNTR11;            /*!< [0x114] Counter Register */
    __I hw_tsi_cntr13_t CNTR13;            /*!< [0x118] Counter Register */
    __I hw_tsi_cntr15_t CNTR15;            /*!< [0x11C] Counter Register */
    __IO hw_tsi_threshold_t THRESHOLD;     /*!< [0x120] Low Power Channel Threshold Register */
} hw_tsi_t;
#pragma pack()

/*! @brief Macro to access all TSI registers. */
/*! @param x TSI module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_TSI_REGS(TSI0_BASE)</code>. */
#define HW_TSI_REGS(x) (*(hw_tsi_t *)(x))

/*
 * MK20D5 UART
 *
 * Serial Communication Interface
 *
 * Registers defined in this header file:
 * - HW_UART_BDH - UART Baud Rate Registers:High
 * - HW_UART_BDL - UART Baud Rate Registers: Low
 * - HW_UART_C1 - UART Control Register 1
 * - HW_UART_C2 - UART Control Register 2
 * - HW_UART_S1 - UART Status Register 1
 * - HW_UART_S2 - UART Status Register 2
 * - HW_UART_C3 - UART Control Register 3
 * - HW_UART_D - UART Data Register
 * - HW_UART_MA1 - UART Match Address Registers 1
 * - HW_UART_MA2 - UART Match Address Registers 2
 * - HW_UART_C4 - UART Control Register 4
 * - HW_UART_C5 - UART Control Register 5
 * - HW_UART_ED - UART Extended Data Register
 * - HW_UART_MODEM - UART Modem Register
 * - HW_UART_IR - UART Infrared Register
 * - HW_UART_PFIFO - UART FIFO Parameters
 * - HW_UART_CFIFO - UART FIFO Control Register
 * - HW_UART_SFIFO - UART FIFO Status Register
 * - HW_UART_TWFIFO - UART FIFO Transmit Watermark
 * - HW_UART_TCFIFO - UART FIFO Transmit Count
 * - HW_UART_RWFIFO - UART FIFO Receive Watermark
 * - HW_UART_RCFIFO - UART FIFO Receive Count
 * - HW_UART_C7816 - UART 7816 Control Register
 * - HW_UART_IE7816 - UART 7816 Interrupt Enable Register
 * - HW_UART_IS7816 - UART 7816 Interrupt Status Register
 * - HW_UART_WP7816T0 - UART 7816 Wait Parameter Register
 * - HW_UART_WP7816T1 - UART 7816 Wait Parameter Register
 * - HW_UART_WN7816 - UART 7816 Wait N Register
 * - HW_UART_WF7816 - UART 7816 Wait FD Register
 * - HW_UART_ET7816 - UART 7816 Error Threshold Register
 * - HW_UART_TL7816 - UART 7816 Transmit Length Register
 * - HW_UART_C6 - UART CEA709.1-B Control Register 6
 * - HW_UART_PCTH - UART CEA709.1-B Packet Cycle Time Counter High
 * - HW_UART_PCTL - UART CEA709.1-B Packet Cycle Time Counter Low
 * - HW_UART_B1T - UART CEA709.1-B Beta1 Timer
 * - HW_UART_SDTH - UART CEA709.1-B Secondary Delay Timer High
 * - HW_UART_SDTL - UART CEA709.1-B Secondary Delay Timer Low
 * - HW_UART_PRE - UART CEA709.1-B Preamble
 * - HW_UART_TPL - UART CEA709.1-B Transmit Packet Length
 * - HW_UART_IE - UART CEA709.1-B Interrupt Enable Register
 * - HW_UART_WB - UART CEA709.1-B WBASE
 * - HW_UART_S3 - UART CEA709.1-B Status Register
 * - HW_UART_S4 - UART CEA709.1-B Status Register
 * - HW_UART_RPL - UART CEA709.1-B Received Packet Length
 * - HW_UART_RPREL - UART CEA709.1-B Received Preamble Length
 * - HW_UART_CPW - UART CEA709.1-B Collision Pulse Width
 * - HW_UART_RIDT - UART CEA709.1-B Receive Indeterminate Time
 * - HW_UART_TIDT - UART CEA709.1-B Transmit Indeterminate Time
 *
 * - hw_uart_t - Struct containing all module registers.
 */

#define HW_UART_INSTANCE_COUNT (3U) /*!< Number of instances of the UART module. */
#define HW_UART0 (0U) /*!< Instance number for UART0. */
#define HW_UART1 (1U) /*!< Instance number for UART1. */
#define HW_UART2 (2U) /*!< Instance number for UART2. */

/*******************************************************************************
 * HW_UART_BDH - UART Baud Rate Registers:High
 ******************************************************************************/

/*!
 * @brief HW_UART_BDH - UART Baud Rate Registers:High (RW)
 *
 * Reset value: 0x00U
 *
 * This register, along with the BDL register, controls the prescale divisor for
 * UART baud rate generation. To update the 13-bit baud rate setting
 * (SBR[12:0]), first write to BDH to buffer the high half of the new value and then write
 * to BDL. The working value in BDH does not change until BDL is written. BDL is
 * reset to a non-zero value, but after reset the baud rate generator remains
 * disabled until the first time the receiver or transmitter is enabled (C2[RE] or
 * C2[TE] bits are set).
 */
typedef union _hw_uart_bdh
{
    uint8_t U;
    struct _hw_uart_bdh_bitfields
    {
        uint8_t SBR : 5;               /*!< [4:0] UART Baud Rate Bits */
        uint8_t RESERVED0 : 1;         /*!< [5]  */
        uint8_t RXEDGIE : 1;           /*!< [6] RxD Input Active Edge Interrupt Enable
                                        * */
        uint8_t LBKDIE : 1;            /*!< [7] LIN Break Detect Interrupt Enable */
    } B;
} hw_uart_bdh_t;

/*!
 * @name Constants and macros for entire UART_BDH register
 */
/*@{*/
#define HW_UART_BDH_ADDR(x)      ((uint32_t)(x) + 0x0U)

#define HW_UART_BDH(x)           (*(__IO hw_uart_bdh_t *) HW_UART_BDH_ADDR(x))
#define HW_UART_BDH_RD(x)        (HW_UART_BDH(x).U)
#define HW_UART_BDH_WR(x, v)     (HW_UART_BDH(x).U = (v))
#define HW_UART_BDH_SET(x, v)    (HW_UART_BDH_WR(x, HW_UART_BDH_RD(x) |  (v)))
#define HW_UART_BDH_CLR(x, v)    (HW_UART_BDH_WR(x, HW_UART_BDH_RD(x) & ~(v)))
#define HW_UART_BDH_TOG(x, v)    (HW_UART_BDH_WR(x, HW_UART_BDH_RD(x) ^  (v)))
/*@}*/

