flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*******************************************************************************
 * HW_UART_S1 - UART Status Register 1
 ******************************************************************************/

/*!
 * @brief HW_UART_S1 - UART Status Register 1 (RO)
 *
 * Reset value: 0xC0U
 *
 * The S1 register provides inputs to the MCU for generation of UART interrupts
 * or DMA requests. This register can also be polled by the MCU to check the
 * status of these bits. To clear a flag, the status register should be read followed
 * by a read or write (depending on interrupt flag type) to the UART Data
 * Register. Other instructions can be executed between the two steps as long as it
 * does not compromise the handling of I/O, but the order of operations is important
 * for flag clearing. When a flag is configured to trigger a DMA request,
 * assertion of the associated DMA done signal from the DMA controller, clears the
 * flag. If the condition that results in the assertion of the flag, interrupt or DMA
 * request is not resolved prior to clearing the flag, the flag (and
 * interrupt/DMA request) will reassert. For example, if the DMA or interrupt service
 * routine failed to write sufficient data to the transmit buffer to raise it above the
 * watermark level, the flag will reassert and generate another interrupt or DMA
 * request. Reading an empty data register to clear one of these flags causes
 * the FIFO pointers to get out of alignment. A receive FIFO flush reinitializes
 * the pointers.
 */
typedef union _hw_uart_s1
{
    uint8_t U;
    struct _hw_uart_s1_bitfields
    {
        uint8_t PF : 1;                /*!< [0] Parity Error Flag */
        uint8_t FE : 1;                /*!< [1] Framing Error Flag */
        uint8_t NF : 1;                /*!< [2] Noise Flag */
        uint8_t OR : 1;                /*!< [3] Receiver Overrun Flag */
        uint8_t IDLE : 1;              /*!< [4] Idle Line Flag */
        uint8_t RDRF : 1;              /*!< [5] Receive Data Register Full Flag */
        uint8_t TC : 1;                /*!< [6] Transmit Complete Flag */
        uint8_t TDRE : 1;              /*!< [7] Transmit Data Register Empty Flag */
    } B;
} hw_uart_s1_t;

/*!
 * @name Constants and macros for entire UART_S1 register
 */
/*@{*/
#define HW_UART_S1_ADDR(x)       ((uint32_t)(x) + 0x4U)

#define HW_UART_S1(x)            (*(__I hw_uart_s1_t *) HW_UART_S1_ADDR(x))
#define HW_UART_S1_RD(x)         (HW_UART_S1(x).U)
/*@}*/

/*
 * Constants & macros for individual UART_S1 bitfields
 */

/*!
 * @name Register UART_S1, field PF[0] (RO)
 *
 * PF is set when PE is set, S2[LBKDE] is disabled, and the parity of the
 * received data does not match its parity bit. The PF is not set in the case of an
 * overrun condition. When the PF bit is set it only indicates that a dataword was
 * received with parity error since the last time it was cleared. There is no
 * guarantee that the first dataword read from the receive buffer has a parity error
 * or that there is only one dataword in the buffer that was received with a
 * parity error unless the receive buffer was a depth of one. To clear PF, read S1
 * and then read the UART data register (D). Within the receive buffer structure
 * the received dataword is tagged if it was received with a parity error. That
 * information is available by reading the ED register prior to reading the D
 * register. When EN709 is set/enabled parity error flag is not set.
 *
 * Values:
 * - 0 - No parity error has been detected since the last time this flag was
 *     cleared. If the receive buffer has a depth greater than 1 then there may be
 *     data in the receive buffer what was received with a parity error.
 * - 1 - At least one dataword was received with a parity error since the last
 *     time this flag was cleared.
 */
/*@{*/
#define BP_UART_S1_PF        (0U)          /*!< Bit position for UART_S1_PF. */
#define BM_UART_S1_PF        (0x01U)       /*!< Bit mask for UART_S1_PF. */
#define BS_UART_S1_PF        (1U)          /*!< Bit field size in bits for UART_S1_PF. */

/*! @brief Read current value of the UART_S1_PF field. */
#define BR_UART_S1_PF(x)     (BITBAND_ACCESS8(HW_UART_S1_ADDR(x), BP_UART_S1_PF))
/*@}*/

/*!
 * @name Register UART_S1, field FE[1] (RO)
 *
 * FE is set when a logic 0 is accepted as the stop bit. FE bit does not set in
 * the case of an overrun or while the LIN break detect feature is enabled
 * (S2[LBKDE] = 1). FE inhibits further data reception until it is cleared. To clear
 * FE, read S1 with FE set and then read the UART data register (D). The last data
 * in the receive buffer represents the data that was received with the frame
 * error enabled. However, framing errors are not supported when 7816E is
 * set/enabled. However, if this flag is set, data will still not be received in 7816 mode.
 * Framing errors are not supported in 709 mode.
 *
 * Values:
 * - 0 - No framing error detected.
 * - 1 - Framing error.
 */
/*@{*/
#define BP_UART_S1_FE        (1U)          /*!< Bit position for UART_S1_FE. */
#define BM_UART_S1_FE        (0x02U)       /*!< Bit mask for UART_S1_FE. */
#define BS_UART_S1_FE        (1U)          /*!< Bit field size in bits for UART_S1_FE. */

/*! @brief Read current value of the UART_S1_FE field. */
#define BR_UART_S1_FE(x)     (BITBAND_ACCESS8(HW_UART_S1_ADDR(x), BP_UART_S1_FE))
/*@}*/

/*!
 * @name Register UART_S1, field NF[2] (RO)
 *
 * NF is set when the UART detects noise on the receiver input. NF bit does not
 * get set in the case of an overrun or while the LIN break detect feature is
 * enabled (S2[LBKDE] = 1). When NF is set, it only indicates that a dataword has
 * been received with noise since the last time it was cleared. There is no
 * guarantee that the first dataword read from the receive buffer has noise or that
 * there is only one dataword in the buffer that was received with noise unless the
 * receive buffer has a depth of one. To clear NF, read S1 and then read the UART
 * data register (D). When EN709 is set/enabled, noise flag is not set.
 *
 * Values:
 * - 0 - No noise detected since the last time this flag was cleared. If the
 *     receive buffer has a depth greater than 1 then there may be data in the
 *     receiver buffer that was received with noise.
 * - 1 - At least one dataword was received with noise detected since the last
 *     time the flag was cleared.
 */
/*@{*/
#define BP_UART_S1_NF        (2U)          /*!< Bit position for UART_S1_NF. */
#define BM_UART_S1_NF        (0x04U)       /*!< Bit mask for UART_S1_NF. */
#define BS_UART_S1_NF        (1U)          /*!< Bit field size in bits for UART_S1_NF. */

