flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*! @brief Read current value of the UART_S1_NF field. */
#define BR_UART_S1_NF(x)     (BITBAND_ACCESS8(HW_UART_S1_ADDR(x), BP_UART_S1_NF))
/*@}*/

/*!
 * @name Register UART_S1, field OR[3] (RO)
 *
 * OR is set when software fails to prevent the receive data register from
 * overflowing with data. The OR bit is set immediately after the stop bit has been
 * completely received for the dataword that overflows the buffer and all the other
 * error flags (FE,NF and PF) are prevented from setting. The data in the shift
 * register is lost, but the data already in the UART data registers is not
 * affected. If the OR flag is set, no data will be stored in the data buffer even if
 * sufficient room exists. Additionally, while the OR flag is set the RDRF flag,
 * and IDLE flags will be blocked from asserting, i.e. transition from an
 * inactive to an active state. To clear OR, read S1 when OR is set and then read UART
 * data register (D). If LBKDE is enabled and a LIN Break is detected, the OR bit
 * will assert if the S2[LBKDIF] flag is not cleared before the next data
 * character is received.See Overrun (OR) flag implications for more details regarding
 * the operation of the OR bit. In 7816 mode, it is possible to configure a NACK
 * to be returned by programing the C7816[ONACK] bit.
 *
 * Values:
 * - 0 - No overrun has occurred since the last time the flag was cleared.
 * - 1 - Overrun has occurred or the overrun flag has not been cleared since the
 *     last overrun occured.
 */
/*@{*/
#define BP_UART_S1_OR        (3U)          /*!< Bit position for UART_S1_OR. */
#define BM_UART_S1_OR        (0x08U)       /*!< Bit mask for UART_S1_OR. */
#define BS_UART_S1_OR        (1U)          /*!< Bit field size in bits for UART_S1_OR. */

/*! @brief Read current value of the UART_S1_OR field. */
#define BR_UART_S1_OR(x)     (BITBAND_ACCESS8(HW_UART_S1_ADDR(x), BP_UART_S1_OR))
/*@}*/

/*!
 * @name Register UART_S1, field IDLE[4] (RO)
 *
 * IDLE is set when 10 consecutive logic 1s (if C1[M] = 0), 11 consecutive logic
 * 1s (if C1[M] = 1 and C4[M10] = 0), or 12 consecutive logic 1s (if C1[M] = 1,
 * C4[M10] = 1, and C1[PE] = 1) appear on the receiver input. After the IDLE flag
 * is cleared, a frame must be received (although not necessarily stored in the
 * data buffer, for example if C2[RWU] is set) or a LIN break character must set
 * the S2[LBKDIF] flag before an idle condition can set the IDLE flag. To clear
 * IDLE, read UART status S1 with IDLE set and then read D. Idle detection is not
 * supported when 7816E or EN709 is set/enabled and hence this flag is ignored.
 * When the receiver wakeup bit (RWU) is set and WAKE is cleared, an idle line
 * condition sets the IDLE flag if RWUID is set, else the IDLE flag does not get set.
 *
 * Values:
 * - 0 - Receiver input is either active now or has never become active since
 *     the IDLE flag was last cleared.
 * - 1 - Receiver input has become idle or the flag has not been cleared since
 *     it last asserted.
 */
/*@{*/
#define BP_UART_S1_IDLE      (4U)          /*!< Bit position for UART_S1_IDLE. */
#define BM_UART_S1_IDLE      (0x10U)       /*!< Bit mask for UART_S1_IDLE. */
#define BS_UART_S1_IDLE      (1U)          /*!< Bit field size in bits for UART_S1_IDLE. */

/*! @brief Read current value of the UART_S1_IDLE field. */
#define BR_UART_S1_IDLE(x)   (BITBAND_ACCESS8(HW_UART_S1_ADDR(x), BP_UART_S1_IDLE))
/*@}*/

/*!
 * @name Register UART_S1, field RDRF[5] (RO)
 *
 * RDRF is set when the number of datawords in the receive buffer is equal to or
 * more than the number indicated by RWFIFO[RXWATER]. A dataword that is in the
 * process of being received is not included in the count. RDRF is prevented from
 * setting while S2[LBKDE] is set. Additionally, when S2[LBKDE] is set,
 * datawords that are received will be stored in the receive buffer but will over-write
 * each other. To clear RDRF, read S1 when RDRF is set and then read the UART data
 * register (D). For more efficient interrupt and DMA operation all data except
 * the final value is to be read from the buffer using D/C3[T8]/ED. The S1 should
 * then be read and the final data value read, resulting in the clearing of the
 * RDRF flag. Even if the RDRF flag is set, data will continue to be received
 * until an overrun condition occurs.
 *
 * Values:
 * - 0 - The number of datawords in the receive buffer is less than the number
 *     indicated by RXWATER.
 * - 1 - The number of datawords in the receive buffer is equal to or greater
 *     than the number indicated by RXWATER at some point in time since this flag
 *     was last cleared.
 */
/*@{*/
#define BP_UART_S1_RDRF      (5U)          /*!< Bit position for UART_S1_RDRF. */
#define BM_UART_S1_RDRF      (0x20U)       /*!< Bit mask for UART_S1_RDRF. */
#define BS_UART_S1_RDRF      (1U)          /*!< Bit field size in bits for UART_S1_RDRF. */

/*! @brief Read current value of the UART_S1_RDRF field. */
#define BR_UART_S1_RDRF(x)   (BITBAND_ACCESS8(HW_UART_S1_ADDR(x), BP_UART_S1_RDRF))
/*@}*/

/*!
 * @name Register UART_S1, field TC[6] (RO)
 *
 * TC is cleared when there is a transmission in progress or when a preamble or
 * break character is loaded. TC is set when the transmit buffer is empty and no
 * data, preamble, or break character is being transmitted. When TC is set, the
 * transmit data output signal becomes idle (logic 1). When 7816E is set/enabled
 * this bit is set after any NACK signal has been received but prior to any
 * corresponding guard times expiring. When EN709 is set/enabled this flag is not set
 * on transmit packet completion. TC is cleared by reading S1 with TC set and then
 * doing one of the following: Writing to the UART data register (D) to transmit
 * new data Queuing a preamble by clearing and then setting the C2[TE] bit.
 * Queuing a break character by writing 1 to SBK in C2
 *
 * Values:
 * - 0 - Transmitter active (sending data, a preamble, or a break).
 * - 1 - Transmitter idle (transmission activity complete).
 */
/*@{*/
#define BP_UART_S1_TC        (6U)          /*!< Bit position for UART_S1_TC. */
#define BM_UART_S1_TC        (0x40U)       /*!< Bit mask for UART_S1_TC. */
#define BS_UART_S1_TC        (1U)          /*!< Bit field size in bits for UART_S1_TC. */

/*! @brief Read current value of the UART_S1_TC field. */
#define BR_UART_S1_TC(x)     (BITBAND_ACCESS8(HW_UART_S1_ADDR(x), BP_UART_S1_TC))
/*@}*/

/*!
 * @name Register UART_S1, field TDRE[7] (RO)
 *
 * TDRE will set when the number of datawords in the transmit buffer (D and
 * C3[T8])is equal to or less than the number indicated by TWFIFO[TXWATER]. A
 * character that is in the process of being transmitted is not included in the count.
 * To clear TDRE, read S1 when TDRE is set and then write to the UART data
 * register (D). For more efficient interrupt servicing all data except the final value
 * to be written to the buffer should written to D/C3[T8]. Then S1 can be read
 * before writing the final data value, resulting in the clearing of the TRDE flag.
 * This is more efficient since the TDRE will reassert until the watermark has
 * been exceeded so attempting to clear the TDRE every write will be ineffective
 * until sufficient data has been written.
 *
 * Values:
 * - 0 - The amount of data in the transmit buffer is greater than the value
 *     indicated by TWFIFO[TXWATER].
 * - 1 - The amount of data in the transmit buffer is less than or equal to the
 *     value indicated by TWFIFO[TXWATER] at some point in time since the flag
 *     has been cleared.
 */
/*@{*/
#define BP_UART_S1_TDRE      (7U)          /*!< Bit position for UART_S1_TDRE. */
#define BM_UART_S1_TDRE      (0x80U)       /*!< Bit mask for UART_S1_TDRE. */
#define BS_UART_S1_TDRE      (1U)          /*!< Bit field size in bits for UART_S1_TDRE. */

