flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*
 * Constants & macros for individual UART_TL7816 bitfields
 */

/*!
 * @name Register UART_TL7816, field TLEN[7:0] (RW)
 *
 * This value plus 4 indicates the number of characters contained in the block
 * being transmitted. This register is automatically decremented by 1 for each
 * character in the information field portion of the block. Additionally, this
 * register is automatically decremented by 1 for the first character of a CRC in the
 * epilogue field. Hence, this register should be programmed with the number of
 * bytes in the data packet if a LRC is being transmitted, and the number of bytes
 * + 1 if a CRC is being transmitted. This register is not decremented for
 * characters that are assumed to be part of the Prologue field (first three
 * characters transmitted in a block) or the LRC or last CRC character in the Epilogue
 * field (last character transmitted). This field should only be programed or
 * adjusted when C2[TE] is cleared.
 */
/*@{*/
#define BP_UART_TL7816_TLEN  (0U)          /*!< Bit position for UART_TL7816_TLEN. */
#define BM_UART_TL7816_TLEN  (0xFFU)       /*!< Bit mask for UART_TL7816_TLEN. */
#define BS_UART_TL7816_TLEN  (8U)          /*!< Bit field size in bits for UART_TL7816_TLEN. */

/*! @brief Read current value of the UART_TL7816_TLEN field. */
#define BR_UART_TL7816_TLEN(x) (HW_UART_TL7816(x).U)

/*! @brief Format value for bitfield UART_TL7816_TLEN. */
#define BF_UART_TL7816_TLEN(v) ((uint8_t)((uint8_t)(v) << BP_UART_TL7816_TLEN) & BM_UART_TL7816_TLEN)

/*! @brief Set the TLEN field to a new value. */
#define BW_UART_TL7816_TLEN(x, v) (HW_UART_TL7816_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_UART_C6 - UART CEA709.1-B Control Register 6
 ******************************************************************************/

/*!
 * @brief HW_UART_C6 - UART CEA709.1-B Control Register 6 (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_c6
{
    uint8_t U;
    struct _hw_uart_c6_bitfields
    {
        uint8_t RESERVED0 : 4;         /*!< [3:0]  */
        uint8_t CP : 1;                /*!< [4] Collision Signal Polarity */
        uint8_t CE : 1;                /*!< [5] Collision Enable */
        uint8_t TX709 : 1;             /*!< [6] CEA709.1-B Transmit Enable */
        uint8_t EN709 : 1;             /*!< [7] EN709 */
    } B;
} hw_uart_c6_t;

/*!
 * @name Constants and macros for entire UART_C6 register
 */
/*@{*/
#define HW_UART_C6_ADDR(x)       ((uint32_t)(x) + 0x21U)

#define HW_UART_C6(x)            (*(__IO hw_uart_c6_t *) HW_UART_C6_ADDR(x))
#define HW_UART_C6_RD(x)         (HW_UART_C6(x).U)
#define HW_UART_C6_WR(x, v)      (HW_UART_C6(x).U = (v))
#define HW_UART_C6_SET(x, v)     (HW_UART_C6_WR(x, HW_UART_C6_RD(x) |  (v)))
#define HW_UART_C6_CLR(x, v)     (HW_UART_C6_WR(x, HW_UART_C6_RD(x) & ~(v)))
#define HW_UART_C6_TOG(x, v)     (HW_UART_C6_WR(x, HW_UART_C6_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual UART_C6 bitfields
 */

/*!
 * @name Register UART_C6, field CP[4] (RW)
 *
 * This bit indicates the polarity of collision signal.
 *
 * Values:
 * - 0 - Collision signal is active low.
 * - 1 - Collision signal is active high.
 */
/*@{*/
#define BP_UART_C6_CP        (4U)          /*!< Bit position for UART_C6_CP. */
#define BM_UART_C6_CP        (0x10U)       /*!< Bit mask for UART_C6_CP. */
#define BS_UART_C6_CP        (1U)          /*!< Bit field size in bits for UART_C6_CP. */

/*! @brief Read current value of the UART_C6_CP field. */
#define BR_UART_C6_CP(x)     (BITBAND_ACCESS8(HW_UART_C6_ADDR(x), BP_UART_C6_CP))

/*! @brief Format value for bitfield UART_C6_CP. */
#define BF_UART_C6_CP(v)     ((uint8_t)((uint8_t)(v) << BP_UART_C6_CP) & BM_UART_C6_CP)

/*! @brief Set the CP field to a new value. */
#define BW_UART_C6_CP(x, v)  (BITBAND_ACCESS8(HW_UART_C6_ADDR(x), BP_UART_C6_CP) = (v))
/*@}*/

/*!
 * @name Register UART_C6, field CE[5] (RW)
 *
 * This bit enables the collision detect functionality.
 *
 * Values:
 * - 0 - Collision detect feature is disabled.
 * - 1 - Collision detect feature is enabled.
 */
/*@{*/
#define BP_UART_C6_CE        (5U)          /*!< Bit position for UART_C6_CE. */
#define BM_UART_C6_CE        (0x20U)       /*!< Bit mask for UART_C6_CE. */
#define BS_UART_C6_CE        (1U)          /*!< Bit field size in bits for UART_C6_CE. */

/*! @brief Read current value of the UART_C6_CE field. */
#define BR_UART_C6_CE(x)     (BITBAND_ACCESS8(HW_UART_C6_ADDR(x), BP_UART_C6_CE))

/*! @brief Format value for bitfield UART_C6_CE. */
#define BF_UART_C6_CE(v)     ((uint8_t)((uint8_t)(v) << BP_UART_C6_CE) & BM_UART_C6_CE)

/*! @brief Set the CE field to a new value. */
#define BW_UART_C6_CE(x, v)  (BITBAND_ACCESS8(HW_UART_C6_ADDR(x), BP_UART_C6_CE) = (v))
/*@}*/

/*!
 * @name Register UART_C6, field TX709[6] (RW)
 *
 * This register is used to start CEA709.1-B transmission.
 *
 * Values:
 * - 0 - CEA709.1-B transmitter is disabled.
 * - 1 - CEA709.1-B transmitter is enabled.
 */
/*@{*/
#define BP_UART_C6_TX709     (6U)          /*!< Bit position for UART_C6_TX709. */
#define BM_UART_C6_TX709     (0x40U)       /*!< Bit mask for UART_C6_TX709. */
#define BS_UART_C6_TX709     (1U)          /*!< Bit field size in bits for UART_C6_TX709. */

/*! @brief Read current value of the UART_C6_TX709 field. */
#define BR_UART_C6_TX709(x)  (BITBAND_ACCESS8(HW_UART_C6_ADDR(x), BP_UART_C6_TX709))

/*! @brief Format value for bitfield UART_C6_TX709. */
#define BF_UART_C6_TX709(v)  ((uint8_t)((uint8_t)(v) << BP_UART_C6_TX709) & BM_UART_C6_TX709)

/*! @brief Set the TX709 field to a new value. */
#define BW_UART_C6_TX709(x, v) (BITBAND_ACCESS8(HW_UART_C6_ADDR(x), BP_UART_C6_TX709) = (v))
/*@}*/

/*!
 * @name Register UART_C6, field EN709[7] (RW)
 *
 * This register is used to enable the CEA709.1-B feature.
 *
 * Values:
 * - 0 - CEA709.1-B is disabled.
 * - 1 - CEA709.1-B is enabled
 */
/*@{*/
#define BP_UART_C6_EN709     (7U)          /*!< Bit position for UART_C6_EN709. */
#define BM_UART_C6_EN709     (0x80U)       /*!< Bit mask for UART_C6_EN709. */
#define BS_UART_C6_EN709     (1U)          /*!< Bit field size in bits for UART_C6_EN709. */

