flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*! @brief Read current value of the UART_C6_EN709 field. */
#define BR_UART_C6_EN709(x)  (BITBAND_ACCESS8(HW_UART_C6_ADDR(x), BP_UART_C6_EN709))

/*! @brief Format value for bitfield UART_C6_EN709. */
#define BF_UART_C6_EN709(v)  ((uint8_t)((uint8_t)(v) << BP_UART_C6_EN709) & BM_UART_C6_EN709)

/*! @brief Set the EN709 field to a new value. */
#define BW_UART_C6_EN709(x, v) (BITBAND_ACCESS8(HW_UART_C6_ADDR(x), BP_UART_C6_EN709) = (v))
/*@}*/

/*******************************************************************************
 * HW_UART_PCTH - UART CEA709.1-B Packet Cycle Time Counter High
 ******************************************************************************/

/*!
 * @brief HW_UART_PCTH - UART CEA709.1-B Packet Cycle Time Counter High (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_pcth
{
    uint8_t U;
    struct _hw_uart_pcth_bitfields
    {
        uint8_t PCTH : 8;              /*!< [7:0] Packet Cycle Time Counter High */
    } B;
} hw_uart_pcth_t;

/*!
 * @name Constants and macros for entire UART_PCTH register
 */
/*@{*/
#define HW_UART_PCTH_ADDR(x)     ((uint32_t)(x) + 0x22U)

#define HW_UART_PCTH(x)          (*(__IO hw_uart_pcth_t *) HW_UART_PCTH_ADDR(x))
#define HW_UART_PCTH_RD(x)       (HW_UART_PCTH(x).U)
#define HW_UART_PCTH_WR(x, v)    (HW_UART_PCTH(x).U = (v))
#define HW_UART_PCTH_SET(x, v)   (HW_UART_PCTH_WR(x, HW_UART_PCTH_RD(x) |  (v)))
#define HW_UART_PCTH_CLR(x, v)   (HW_UART_PCTH_WR(x, HW_UART_PCTH_RD(x) & ~(v)))
#define HW_UART_PCTH_TOG(x, v)   (HW_UART_PCTH_WR(x, HW_UART_PCTH_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual UART_PCTH bitfields
 */

/*!
 * @name Register UART_PCTH, field PCTH[7:0] (RW)
 *
 * This register indicates the most significant byte of maximum period after the
 * line code violation for which the bus could remain idle without decrementing
 * back log count. If the time elapsed after line code violation is greater than
 * packet cycle timer then packet cycle timer expired interrupt is generated. It
 * is measured in terms of bit times, i.e the time that it takes for a single bit
 * or one differential Manchester symbol to be transmitted. This is medium
 * dependent and hence does not usually require adjustment and is programmed only once.
 */
/*@{*/
#define BP_UART_PCTH_PCTH    (0U)          /*!< Bit position for UART_PCTH_PCTH. */
#define BM_UART_PCTH_PCTH    (0xFFU)       /*!< Bit mask for UART_PCTH_PCTH. */
#define BS_UART_PCTH_PCTH    (8U)          /*!< Bit field size in bits for UART_PCTH_PCTH. */

/*! @brief Read current value of the UART_PCTH_PCTH field. */
#define BR_UART_PCTH_PCTH(x) (HW_UART_PCTH(x).U)

/*! @brief Format value for bitfield UART_PCTH_PCTH. */
#define BF_UART_PCTH_PCTH(v) ((uint8_t)((uint8_t)(v) << BP_UART_PCTH_PCTH) & BM_UART_PCTH_PCTH)

/*! @brief Set the PCTH field to a new value. */
#define BW_UART_PCTH_PCTH(x, v) (HW_UART_PCTH_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_UART_PCTL - UART CEA709.1-B Packet Cycle Time Counter Low
 ******************************************************************************/

/*!
 * @brief HW_UART_PCTL - UART CEA709.1-B Packet Cycle Time Counter Low (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_pctl
{
    uint8_t U;
    struct _hw_uart_pctl_bitfields
    {
        uint8_t PCTL : 8;              /*!< [7:0] Packet Cycle Time Counter Low */
    } B;
} hw_uart_pctl_t;

/*!
 * @name Constants and macros for entire UART_PCTL register
 */
/*@{*/
#define HW_UART_PCTL_ADDR(x)     ((uint32_t)(x) + 0x23U)

#define HW_UART_PCTL(x)          (*(__IO hw_uart_pctl_t *) HW_UART_PCTL_ADDR(x))
#define HW_UART_PCTL_RD(x)       (HW_UART_PCTL(x).U)
#define HW_UART_PCTL_WR(x, v)    (HW_UART_PCTL(x).U = (v))
#define HW_UART_PCTL_SET(x, v)   (HW_UART_PCTL_WR(x, HW_UART_PCTL_RD(x) |  (v)))
#define HW_UART_PCTL_CLR(x, v)   (HW_UART_PCTL_WR(x, HW_UART_PCTL_RD(x) & ~(v)))
#define HW_UART_PCTL_TOG(x, v)   (HW_UART_PCTL_WR(x, HW_UART_PCTL_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual UART_PCTL bitfields
 */

/*!
 * @name Register UART_PCTL, field PCTL[7:0] (RW)
 *
 * This register indicates the least significant byte of maximum period after
 * the line code violation for which the bus could remain idle without decrementing
 * back log count. If the time elapsed after line code violation is greater than
 * packet cycle timer, then packet cycle timer expired interrupt is generated.
 * It is measured in terms of bit times, i.e the time that it takes for a single
 * bit or one Differential Manchester symbol to be transmitted. This is medium
 * dependent and hence does not usually require adjustment and is programmed only
 * once.
 */
/*@{*/
#define BP_UART_PCTL_PCTL    (0U)          /*!< Bit position for UART_PCTL_PCTL. */
#define BM_UART_PCTL_PCTL    (0xFFU)       /*!< Bit mask for UART_PCTL_PCTL. */
#define BS_UART_PCTL_PCTL    (8U)          /*!< Bit field size in bits for UART_PCTL_PCTL. */

/*! @brief Read current value of the UART_PCTL_PCTL field. */
#define BR_UART_PCTL_PCTL(x) (HW_UART_PCTL(x).U)

/*! @brief Format value for bitfield UART_PCTL_PCTL. */
#define BF_UART_PCTL_PCTL(v) ((uint8_t)((uint8_t)(v) << BP_UART_PCTL_PCTL) & BM_UART_PCTL_PCTL)

/*! @brief Set the PCTL field to a new value. */
#define BW_UART_PCTL_PCTL(x, v) (HW_UART_PCTL_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_UART_B1T - UART CEA709.1-B Beta1 Timer
 ******************************************************************************/

/*!
 * @brief HW_UART_B1T - UART CEA709.1-B Beta1 Timer (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_b1t
{
    uint8_t U;
    struct _hw_uart_b1t_bitfields
    {
        uint8_t B1T : 8;               /*!< [7:0] Beta1 Timer */
    } B;
} hw_uart_b1t_t;

/*!
 * @name Constants and macros for entire UART_B1T register
 */
/*@{*/
#define HW_UART_B1T_ADDR(x)      ((uint32_t)(x) + 0x24U)

#define HW_UART_B1T(x)           (*(__IO hw_uart_b1t_t *) HW_UART_B1T_ADDR(x))
#define HW_UART_B1T_RD(x)        (HW_UART_B1T(x).U)
#define HW_UART_B1T_WR(x, v)     (HW_UART_B1T(x).U = (v))
#define HW_UART_B1T_SET(x, v)    (HW_UART_B1T_WR(x, HW_UART_B1T_RD(x) |  (v)))
#define HW_UART_B1T_CLR(x, v)    (HW_UART_B1T_WR(x, HW_UART_B1T_RD(x) & ~(v)))
#define HW_UART_B1T_TOG(x, v)    (HW_UART_B1T_WR(x, HW_UART_B1T_RD(x) ^  (v)))
/*@}*/

