flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*
 * Constants & macros for individual UART_B1T bitfields
 */

/*!
 * @name Register UART_B1T, field B1T[7:0] (RW)
 *
 * Beta1 delay is a value that is system dependent and usually does not require
 * adjustment. It is programmed only once and measured in bit times.
 */
/*@{*/
#define BP_UART_B1T_B1T      (0U)          /*!< Bit position for UART_B1T_B1T. */
#define BM_UART_B1T_B1T      (0xFFU)       /*!< Bit mask for UART_B1T_B1T. */
#define BS_UART_B1T_B1T      (8U)          /*!< Bit field size in bits for UART_B1T_B1T. */

/*! @brief Read current value of the UART_B1T_B1T field. */
#define BR_UART_B1T_B1T(x)   (HW_UART_B1T(x).U)

/*! @brief Format value for bitfield UART_B1T_B1T. */
#define BF_UART_B1T_B1T(v)   ((uint8_t)((uint8_t)(v) << BP_UART_B1T_B1T) & BM_UART_B1T_B1T)

/*! @brief Set the B1T field to a new value. */
#define BW_UART_B1T_B1T(x, v) (HW_UART_B1T_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_UART_SDTH - UART CEA709.1-B Secondary Delay Timer High
 ******************************************************************************/

/*!
 * @brief HW_UART_SDTH - UART CEA709.1-B Secondary Delay Timer High (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_sdth
{
    uint8_t U;
    struct _hw_uart_sdth_bitfields
    {
        uint8_t SDTH : 8;              /*!< [7:0] Secondary Delay Timer High */
    } B;
} hw_uart_sdth_t;

/*!
 * @name Constants and macros for entire UART_SDTH register
 */
/*@{*/
#define HW_UART_SDTH_ADDR(x)     ((uint32_t)(x) + 0x25U)

#define HW_UART_SDTH(x)          (*(__IO hw_uart_sdth_t *) HW_UART_SDTH_ADDR(x))
#define HW_UART_SDTH_RD(x)       (HW_UART_SDTH(x).U)
#define HW_UART_SDTH_WR(x, v)    (HW_UART_SDTH(x).U = (v))
#define HW_UART_SDTH_SET(x, v)   (HW_UART_SDTH_WR(x, HW_UART_SDTH_RD(x) |  (v)))
#define HW_UART_SDTH_CLR(x, v)   (HW_UART_SDTH_WR(x, HW_UART_SDTH_RD(x) & ~(v)))
#define HW_UART_SDTH_TOG(x, v)   (HW_UART_SDTH_WR(x, HW_UART_SDTH_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual UART_SDTH bitfields
 */

/*!
 * @name Register UART_SDTH, field SDTH[7:0] (RW)
 *
 * This is the most significant byte of the secondary delay timer and is set by
 * software. This is generally a variable value that must be set for each data
 * message to be transmitted. It is measured in bit times, i.e. the time that it
 * takes for a single bit or one differential Manchester symbol to be transmitted.
 * This value must be between 0 and (BL*Wbase) + (ProritySlots -1), Beta2
 * timeslots. A value of zero indicates that the queued packet will be sent immediately
 * upon expiration of the beta1 timer.
 */
/*@{*/
#define BP_UART_SDTH_SDTH    (0U)          /*!< Bit position for UART_SDTH_SDTH. */
#define BM_UART_SDTH_SDTH    (0xFFU)       /*!< Bit mask for UART_SDTH_SDTH. */
#define BS_UART_SDTH_SDTH    (8U)          /*!< Bit field size in bits for UART_SDTH_SDTH. */

/*! @brief Read current value of the UART_SDTH_SDTH field. */
#define BR_UART_SDTH_SDTH(x) (HW_UART_SDTH(x).U)

/*! @brief Format value for bitfield UART_SDTH_SDTH. */
#define BF_UART_SDTH_SDTH(v) ((uint8_t)((uint8_t)(v) << BP_UART_SDTH_SDTH) & BM_UART_SDTH_SDTH)

/*! @brief Set the SDTH field to a new value. */
#define BW_UART_SDTH_SDTH(x, v) (HW_UART_SDTH_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_UART_SDTL - UART CEA709.1-B Secondary Delay Timer Low
 ******************************************************************************/

/*!
 * @brief HW_UART_SDTL - UART CEA709.1-B Secondary Delay Timer Low (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_sdtl
{
    uint8_t U;
    struct _hw_uart_sdtl_bitfields
    {
        uint8_t SDTL : 8;              /*!< [7:0] Secondary Delay Timer Low */
    } B;
} hw_uart_sdtl_t;

/*!
 * @name Constants and macros for entire UART_SDTL register
 */
/*@{*/
#define HW_UART_SDTL_ADDR(x)     ((uint32_t)(x) + 0x26U)

#define HW_UART_SDTL(x)          (*(__IO hw_uart_sdtl_t *) HW_UART_SDTL_ADDR(x))
#define HW_UART_SDTL_RD(x)       (HW_UART_SDTL(x).U)
#define HW_UART_SDTL_WR(x, v)    (HW_UART_SDTL(x).U = (v))
#define HW_UART_SDTL_SET(x, v)   (HW_UART_SDTL_WR(x, HW_UART_SDTL_RD(x) |  (v)))
#define HW_UART_SDTL_CLR(x, v)   (HW_UART_SDTL_WR(x, HW_UART_SDTL_RD(x) & ~(v)))
#define HW_UART_SDTL_TOG(x, v)   (HW_UART_SDTL_WR(x, HW_UART_SDTL_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual UART_SDTL bitfields
 */

/*!
 * @name Register UART_SDTL, field SDTL[7:0] (RW)
 *
 * This is the least significant byte of the secondary delay timer and is set by
 * software. This is generally a variable value that must be set for each data
 * message to be transmitted. It is measured in bit times i.e. the time that it
 * takes for a single bit or one Differential Manchester symbol to be transmitted.
 * This value must be between 0 and (BL*Wbase) + (ProritySlots -1), Beta2
 * timeslots. A value of zero indicates that the queued packet will be sent immediately
 * upon expiration of the beta1 timer.
 */
/*@{*/
#define BP_UART_SDTL_SDTL    (0U)          /*!< Bit position for UART_SDTL_SDTL. */
#define BM_UART_SDTL_SDTL    (0xFFU)       /*!< Bit mask for UART_SDTL_SDTL. */
#define BS_UART_SDTL_SDTL    (8U)          /*!< Bit field size in bits for UART_SDTL_SDTL. */

/*! @brief Read current value of the UART_SDTL_SDTL field. */
#define BR_UART_SDTL_SDTL(x) (HW_UART_SDTL(x).U)

/*! @brief Format value for bitfield UART_SDTL_SDTL. */
#define BF_UART_SDTL_SDTL(v) ((uint8_t)((uint8_t)(v) << BP_UART_SDTL_SDTL) & BM_UART_SDTL_SDTL)

/*! @brief Set the SDTL field to a new value. */
#define BW_UART_SDTL_SDTL(x, v) (HW_UART_SDTL_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_UART_PRE - UART CEA709.1-B Preamble
 ******************************************************************************/

/*!
 * @brief HW_UART_PRE - UART CEA709.1-B Preamble (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_pre
{
    uint8_t U;
    struct _hw_uart_pre_bitfields
    {
        uint8_t PREAMBLE : 8;          /*!< [7:0] CEA709.1-B Preamble Register */
    } B;
} hw_uart_pre_t;

/*!
 * @name Constants and macros for entire UART_PRE register
 */
/*@{*/
#define HW_UART_PRE_ADDR(x)      ((uint32_t)(x) + 0x27U)

#define HW_UART_PRE(x)           (*(__IO hw_uart_pre_t *) HW_UART_PRE_ADDR(x))
#define HW_UART_PRE_RD(x)        (HW_UART_PRE(x).U)
#define HW_UART_PRE_WR(x, v)     (HW_UART_PRE(x).U = (v))
#define HW_UART_PRE_SET(x, v)    (HW_UART_PRE_WR(x, HW_UART_PRE_RD(x) |  (v)))
#define HW_UART_PRE_CLR(x, v)    (HW_UART_PRE_WR(x, HW_UART_PRE_RD(x) & ~(v)))
#define HW_UART_PRE_TOG(x, v)    (HW_UART_PRE_WR(x, HW_UART_PRE_RD(x) ^  (v)))
/*@}*/

