flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*
 * Constants & macros for individual UART_PRE bitfields
 */

/*!
 * @name Register UART_PRE, field PREAMBLE[7:0] (RW)
 *
 * The number of bit-sync characters that occurs prior to the byte-sync
 * character when preamble is transmitted.The minimum preamble length supported by
 * twisted pair wire is 4-bit sync fields.
 */
/*@{*/
#define BP_UART_PRE_PREAMBLE (0U)          /*!< Bit position for UART_PRE_PREAMBLE. */
#define BM_UART_PRE_PREAMBLE (0xFFU)       /*!< Bit mask for UART_PRE_PREAMBLE. */
#define BS_UART_PRE_PREAMBLE (8U)          /*!< Bit field size in bits for UART_PRE_PREAMBLE. */

/*! @brief Read current value of the UART_PRE_PREAMBLE field. */
#define BR_UART_PRE_PREAMBLE(x) (HW_UART_PRE(x).U)

/*! @brief Format value for bitfield UART_PRE_PREAMBLE. */
#define BF_UART_PRE_PREAMBLE(v) ((uint8_t)((uint8_t)(v) << BP_UART_PRE_PREAMBLE) & BM_UART_PRE_PREAMBLE)

/*! @brief Set the PREAMBLE field to a new value. */
#define BW_UART_PRE_PREAMBLE(x, v) (HW_UART_PRE_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_UART_TPL - UART CEA709.1-B Transmit Packet Length
 ******************************************************************************/

/*!
 * @brief HW_UART_TPL - UART CEA709.1-B Transmit Packet Length (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_tpl
{
    uint8_t U;
    struct _hw_uart_tpl_bitfields
    {
        uint8_t TPL : 8;               /*!< [7:0] Transmit Packet Length Register */
    } B;
} hw_uart_tpl_t;

/*!
 * @name Constants and macros for entire UART_TPL register
 */
/*@{*/
#define HW_UART_TPL_ADDR(x)      ((uint32_t)(x) + 0x28U)

#define HW_UART_TPL(x)           (*(__IO hw_uart_tpl_t *) HW_UART_TPL_ADDR(x))
#define HW_UART_TPL_RD(x)        (HW_UART_TPL(x).U)
#define HW_UART_TPL_WR(x, v)     (HW_UART_TPL(x).U = (v))
#define HW_UART_TPL_SET(x, v)    (HW_UART_TPL_WR(x, HW_UART_TPL_RD(x) |  (v)))
#define HW_UART_TPL_CLR(x, v)    (HW_UART_TPL_WR(x, HW_UART_TPL_RD(x) & ~(v)))
#define HW_UART_TPL_TOG(x, v)    (HW_UART_TPL_WR(x, HW_UART_TPL_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual UART_TPL bitfields
 */

/*!
 * @name Register UART_TPL, field TPL[7:0] (RW)
 *
 * Length of the data packet in bytes that is transmitted by CEA709.1-B
 * transmitter. This includes CRC packet as well.
 */
/*@{*/
#define BP_UART_TPL_TPL      (0U)          /*!< Bit position for UART_TPL_TPL. */
#define BM_UART_TPL_TPL      (0xFFU)       /*!< Bit mask for UART_TPL_TPL. */
#define BS_UART_TPL_TPL      (8U)          /*!< Bit field size in bits for UART_TPL_TPL. */

/*! @brief Read current value of the UART_TPL_TPL field. */
#define BR_UART_TPL_TPL(x)   (HW_UART_TPL(x).U)

/*! @brief Format value for bitfield UART_TPL_TPL. */
#define BF_UART_TPL_TPL(v)   ((uint8_t)((uint8_t)(v) << BP_UART_TPL_TPL) & BM_UART_TPL_TPL)

/*! @brief Set the TPL field to a new value. */
#define BW_UART_TPL_TPL(x, v) (HW_UART_TPL_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_UART_IE - UART CEA709.1-B Interrupt Enable Register
 ******************************************************************************/

/*!
 * @brief HW_UART_IE - UART CEA709.1-B Interrupt Enable Register (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_ie
{
    uint8_t U;
    struct _hw_uart_ie_bitfields
    {
        uint8_t TXFIE : 1;             /*!< [0] Transmission Fail Interrupt Enable */
        uint8_t PSIE : 1;              /*!< [1] Preamble Start Interrupt Enable */
        uint8_t PCTEIE : 1;            /*!< [2] Packet Cycle Timer Interrupt Enable */
        uint8_t PTXIE : 1;             /*!< [3] Packet Transmitted Interrupt Enable */
        uint8_t PRXIE : 1;             /*!< [4] Packet Received Interrupt Enable */
        uint8_t ISDIE : 1;             /*!< [5] Initial Sync Detection Interrupt Enable */
        uint8_t WBEIE : 1;             /*!< [6] Wbase Expired Interrupt Enable */
        uint8_t RESERVED0 : 1;         /*!< [7]  */
    } B;
} hw_uart_ie_t;

/*!
 * @name Constants and macros for entire UART_IE register
 */
/*@{*/
#define HW_UART_IE_ADDR(x)       ((uint32_t)(x) + 0x29U)

#define HW_UART_IE(x)            (*(__IO hw_uart_ie_t *) HW_UART_IE_ADDR(x))
#define HW_UART_IE_RD(x)         (HW_UART_IE(x).U)
#define HW_UART_IE_WR(x, v)      (HW_UART_IE(x).U = (v))
#define HW_UART_IE_SET(x, v)     (HW_UART_IE_WR(x, HW_UART_IE_RD(x) |  (v)))
#define HW_UART_IE_CLR(x, v)     (HW_UART_IE_WR(x, HW_UART_IE_RD(x) & ~(v)))
#define HW_UART_IE_TOG(x, v)     (HW_UART_IE_WR(x, HW_UART_IE_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual UART_IE bitfields
 */

/*!
 * @name Register UART_IE, field TXFIE[0] (RW)
 *
 * Interrupt enable for transmission fail flag.
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled.
 */
/*@{*/
#define BP_UART_IE_TXFIE     (0U)          /*!< Bit position for UART_IE_TXFIE. */
#define BM_UART_IE_TXFIE     (0x01U)       /*!< Bit mask for UART_IE_TXFIE. */
#define BS_UART_IE_TXFIE     (1U)          /*!< Bit field size in bits for UART_IE_TXFIE. */

/*! @brief Read current value of the UART_IE_TXFIE field. */
#define BR_UART_IE_TXFIE(x)  (BITBAND_ACCESS8(HW_UART_IE_ADDR(x), BP_UART_IE_TXFIE))

/*! @brief Format value for bitfield UART_IE_TXFIE. */
#define BF_UART_IE_TXFIE(v)  ((uint8_t)((uint8_t)(v) << BP_UART_IE_TXFIE) & BM_UART_IE_TXFIE)

/*! @brief Set the TXFIE field to a new value. */
#define BW_UART_IE_TXFIE(x, v) (BITBAND_ACCESS8(HW_UART_IE_ADDR(x), BP_UART_IE_TXFIE) = (v))
/*@}*/

/*!
 * @name Register UART_IE, field PSIE[1] (RW)
 *
 * Interrupt enable for preamble start flag.
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled.
 */
/*@{*/
#define BP_UART_IE_PSIE      (1U)          /*!< Bit position for UART_IE_PSIE. */
#define BM_UART_IE_PSIE      (0x02U)       /*!< Bit mask for UART_IE_PSIE. */
#define BS_UART_IE_PSIE      (1U)          /*!< Bit field size in bits for UART_IE_PSIE. */

/*! @brief Read current value of the UART_IE_PSIE field. */
#define BR_UART_IE_PSIE(x)   (BITBAND_ACCESS8(HW_UART_IE_ADDR(x), BP_UART_IE_PSIE))

/*! @brief Format value for bitfield UART_IE_PSIE. */
#define BF_UART_IE_PSIE(v)   ((uint8_t)((uint8_t)(v) << BP_UART_IE_PSIE) & BM_UART_IE_PSIE)

/*! @brief Set the PSIE field to a new value. */
#define BW_UART_IE_PSIE(x, v) (BITBAND_ACCESS8(HW_UART_IE_ADDR(x), BP_UART_IE_PSIE) = (v))
/*@}*/

/*!
 * @name Register UART_IE, field PCTEIE[2] (RW)
 *
 * Interrupt enable for packet cycle time expired flag.
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled.
 */
/*@{*/
#define BP_UART_IE_PCTEIE    (2U)          /*!< Bit position for UART_IE_PCTEIE. */
#define BM_UART_IE_PCTEIE    (0x04U)       /*!< Bit mask for UART_IE_PCTEIE. */
#define BS_UART_IE_PCTEIE    (1U)          /*!< Bit field size in bits for UART_IE_PCTEIE. */

