flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*
 * Constants & macros for individual UART_S3 bitfields
 */

/*!
 * @name Register UART_S3, field TXFF[0] (RW)
 *
 * This flag indicates that transmission could not proceed. This flag is
 * asserted when the packet is queued for transmission but before the random delay is
 * expired an incoming receive packet is detected. This flag is also asserted while
 * transmission when the TX fifo becomes empty or overflows. During these cases
 * Line Code Violation is transmitted on TX line immediately after current byte
 * or preamble transmission is finished, without waiting for completion of
 * transmit packet length. If the transmission fail flag is asserted then TX709 bit of
 * UART_C6 register is cleared. This flag is cleared by writing `1'.
 *
 * Values:
 * - 0 - Transmission continues normally.
 * - 1 - Transmission is failed.
 */
/*@{*/
#define BP_UART_S3_TXFF      (0U)          /*!< Bit position for UART_S3_TXFF. */
#define BM_UART_S3_TXFF      (0x01U)       /*!< Bit mask for UART_S3_TXFF. */
#define BS_UART_S3_TXFF      (1U)          /*!< Bit field size in bits for UART_S3_TXFF. */

/*! @brief Read current value of the UART_S3_TXFF field. */
#define BR_UART_S3_TXFF(x)   (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_TXFF))

/*! @brief Format value for bitfield UART_S3_TXFF. */
#define BF_UART_S3_TXFF(v)   ((uint8_t)((uint8_t)(v) << BP_UART_S3_TXFF) & BM_UART_S3_TXFF)

/*! @brief Set the TXFF field to a new value. */
#define BW_UART_S3_TXFF(x, v) (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_TXFF) = (v))
/*@}*/

/*!
 * @name Register UART_S3, field PSF[1] (RW)
 *
 * This flag indicates start of preamble while the packet is being transmitted.
 * This flag is cleared by writing `1'.
 *
 * Values:
 * - 0 - Preamble start is not detected.
 * - 1 - Preamble start is detected.
 */
/*@{*/
#define BP_UART_S3_PSF       (1U)          /*!< Bit position for UART_S3_PSF. */
#define BM_UART_S3_PSF       (0x02U)       /*!< Bit mask for UART_S3_PSF. */
#define BS_UART_S3_PSF       (1U)          /*!< Bit field size in bits for UART_S3_PSF. */

/*! @brief Read current value of the UART_S3_PSF field. */
#define BR_UART_S3_PSF(x)    (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_PSF))

/*! @brief Format value for bitfield UART_S3_PSF. */
#define BF_UART_S3_PSF(v)    ((uint8_t)((uint8_t)(v) << BP_UART_S3_PSF) & BM_UART_S3_PSF)

/*! @brief Set the PSF field to a new value. */
#define BW_UART_S3_PSF(x, v) (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_PSF) = (v))
/*@}*/

/*!
 * @name Register UART_S3, field PCTEF[2] (RW)
 *
 * This flag indicates that packet cycle time period has been expired with no
 * activity on the line. This flag is cleared by writing `1'.
 *
 * Values:
 * - 0 - Packet Cycle Time is not expired.
 * - 1 - Packet cycle time is expired.
 */
/*@{*/
#define BP_UART_S3_PCTEF     (2U)          /*!< Bit position for UART_S3_PCTEF. */
#define BM_UART_S3_PCTEF     (0x04U)       /*!< Bit mask for UART_S3_PCTEF. */
#define BS_UART_S3_PCTEF     (1U)          /*!< Bit field size in bits for UART_S3_PCTEF. */

/*! @brief Read current value of the UART_S3_PCTEF field. */
#define BR_UART_S3_PCTEF(x)  (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_PCTEF))

/*! @brief Format value for bitfield UART_S3_PCTEF. */
#define BF_UART_S3_PCTEF(v)  ((uint8_t)((uint8_t)(v) << BP_UART_S3_PCTEF) & BM_UART_S3_PCTEF)

/*! @brief Set the PCTEF field to a new value. */
#define BW_UART_S3_PCTEF(x, v) (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_PCTEF) = (v))
/*@}*/

/*!
 * @name Register UART_S3, field PTXF[3] (RW)
 *
 * This flag indicates that complete packet is transmitted. This flag is cleared
 * by writing `1'. In case TX packet gets aborted due to fifo becoming empty or
 * overflow, packet transmitted flag will still be generated.
 *
 * Values:
 * - 0 - Packet transmission is not complete.
 * - 1 - Packet transmission is complete.
 */
/*@{*/
#define BP_UART_S3_PTXF      (3U)          /*!< Bit position for UART_S3_PTXF. */
#define BM_UART_S3_PTXF      (0x08U)       /*!< Bit mask for UART_S3_PTXF. */
#define BS_UART_S3_PTXF      (1U)          /*!< Bit field size in bits for UART_S3_PTXF. */

/*! @brief Read current value of the UART_S3_PTXF field. */
#define BR_UART_S3_PTXF(x)   (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_PTXF))

/*! @brief Format value for bitfield UART_S3_PTXF. */
#define BF_UART_S3_PTXF(v)   ((uint8_t)((uint8_t)(v) << BP_UART_S3_PTXF) & BM_UART_S3_PTXF)

/*! @brief Set the PTXF field to a new value. */
#define BW_UART_S3_PTXF(x, v) (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_PTXF) = (v))
/*@}*/

/*!
 * @name Register UART_S3, field PRXF[4] (RW)
 *
 * This flag indicates that complete packet is received. This flag is cleared by
 * writing `1'.
 *
 * Values:
 * - 0 - Packet is not received.
 * - 1 - Packet is received.
 */
/*@{*/
#define BP_UART_S3_PRXF      (4U)          /*!< Bit position for UART_S3_PRXF. */
#define BM_UART_S3_PRXF      (0x10U)       /*!< Bit mask for UART_S3_PRXF. */
#define BS_UART_S3_PRXF      (1U)          /*!< Bit field size in bits for UART_S3_PRXF. */

/*! @brief Read current value of the UART_S3_PRXF field. */
#define BR_UART_S3_PRXF(x)   (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_PRXF))

/*! @brief Format value for bitfield UART_S3_PRXF. */
#define BF_UART_S3_PRXF(v)   ((uint8_t)((uint8_t)(v) << BP_UART_S3_PRXF) & BM_UART_S3_PRXF)

/*! @brief Set the PRXF field to a new value. */
#define BW_UART_S3_PRXF(x, v) (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_PRXF) = (v))
/*@}*/

/*!
 * @name Register UART_S3, field ISD[5] (RO)
 *
 * This flag indicates that initially a valid one and a line code violation is
 * detected. This flag is cleared by deasserting EN709 bit.
 *
 * Values:
 * - 0 - Initial sync is not detected.
 * - 1 - Initial sync is detected.
 */
/*@{*/
#define BP_UART_S3_ISD       (5U)          /*!< Bit position for UART_S3_ISD. */
#define BM_UART_S3_ISD       (0x20U)       /*!< Bit mask for UART_S3_ISD. */
#define BS_UART_S3_ISD       (1U)          /*!< Bit field size in bits for UART_S3_ISD. */

/*! @brief Read current value of the UART_S3_ISD field. */
#define BR_UART_S3_ISD(x)    (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_ISD))
/*@}*/

/*!
 * @name Register UART_S3, field WBEF[6] (RW)
 *
 * This flag indicates that Wbase time period has been expired after Beta1 time
 * slots. This flag is cleared by writing `1'.
 *
 * Values:
 * - 0 - Wbase time period is not expired.
 * - 1 - Wbase time period has been expired after beta1 time slots.
 */
/*@{*/
#define BP_UART_S3_WBEF      (6U)          /*!< Bit position for UART_S3_WBEF. */
#define BM_UART_S3_WBEF      (0x40U)       /*!< Bit mask for UART_S3_WBEF. */
#define BS_UART_S3_WBEF      (1U)          /*!< Bit field size in bits for UART_S3_WBEF. */

/*! @brief Read current value of the UART_S3_WBEF field. */
#define BR_UART_S3_WBEF(x)   (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_WBEF))

/*! @brief Format value for bitfield UART_S3_WBEF. */
#define BF_UART_S3_WBEF(v)   ((uint8_t)((uint8_t)(v) << BP_UART_S3_WBEF) & BM_UART_S3_WBEF)

