flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*! @brief Set the WBEF field to a new value. */
#define BW_UART_S3_WBEF(x, v) (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_WBEF) = (v))
/*@}*/

/*!
 * @name Register UART_S3, field PEF[7] (RW)
 *
 * This flag indicates that received preamble is in error. If the received
 * preamble length is greater than or less than the transmit preamble length, the
 * preamble error flag is asserted. This flag is cleared by writing `1'.
 *
 * Values:
 * - 0 - Preamble is correct.
 * - 1 - Preamble is in error.
 */
/*@{*/
#define BP_UART_S3_PEF       (7U)          /*!< Bit position for UART_S3_PEF. */
#define BM_UART_S3_PEF       (0x80U)       /*!< Bit mask for UART_S3_PEF. */
#define BS_UART_S3_PEF       (1U)          /*!< Bit field size in bits for UART_S3_PEF. */

/*! @brief Read current value of the UART_S3_PEF field. */
#define BR_UART_S3_PEF(x)    (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_PEF))

/*! @brief Format value for bitfield UART_S3_PEF. */
#define BF_UART_S3_PEF(v)    ((uint8_t)((uint8_t)(v) << BP_UART_S3_PEF) & BM_UART_S3_PEF)

/*! @brief Set the PEF field to a new value. */
#define BW_UART_S3_PEF(x, v) (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_PEF) = (v))
/*@}*/

/*******************************************************************************
 * HW_UART_S4 - UART CEA709.1-B Status Register
 ******************************************************************************/

/*!
 * @brief HW_UART_S4 - UART CEA709.1-B Status Register (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_s4
{
    uint8_t U;
    struct _hw_uart_s4_bitfields
    {
        uint8_t FE : 1;                /*!< [0] Framing Error */
        uint8_t ILCV : 1;              /*!< [1] Improper Line Code Violation */
        uint8_t CDET : 2;              /*!< [3:2] CDET */
        uint8_t INITF : 1;             /*!< [4] Initial Synchronization Fail Flag */
        uint8_t RESERVED0 : 3;         /*!< [7:5]  */
    } B;
} hw_uart_s4_t;

/*!
 * @name Constants and macros for entire UART_S4 register
 */
/*@{*/
#define HW_UART_S4_ADDR(x)       ((uint32_t)(x) + 0x2CU)

#define HW_UART_S4(x)            (*(__IO hw_uart_s4_t *) HW_UART_S4_ADDR(x))
#define HW_UART_S4_RD(x)         (HW_UART_S4(x).U)
#define HW_UART_S4_WR(x, v)      (HW_UART_S4(x).U = (v))
#define HW_UART_S4_SET(x, v)     (HW_UART_S4_WR(x, HW_UART_S4_RD(x) |  (v)))
#define HW_UART_S4_CLR(x, v)     (HW_UART_S4_WR(x, HW_UART_S4_RD(x) & ~(v)))
#define HW_UART_S4_TOG(x, v)     (HW_UART_S4_WR(x, HW_UART_S4_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual UART_S4 bitfields
 */

/*!
 * @name Register UART_S4, field FE[0] (RW)
 *
 * This flag indicates that received CEA709.1-B packet is finish at byte
 * boundary. This flag is cleared by writing `1'.
 *
 * Values:
 * - 0 - Received packet is byte bound.
 * - 1 - Received packet is not byte bound.
 */
/*@{*/
#define BP_UART_S4_FE        (0U)          /*!< Bit position for UART_S4_FE. */
#define BM_UART_S4_FE        (0x01U)       /*!< Bit mask for UART_S4_FE. */
#define BS_UART_S4_FE        (1U)          /*!< Bit field size in bits for UART_S4_FE. */

/*! @brief Read current value of the UART_S4_FE field. */
#define BR_UART_S4_FE(x)     (BITBAND_ACCESS8(HW_UART_S4_ADDR(x), BP_UART_S4_FE))

/*! @brief Format value for bitfield UART_S4_FE. */
#define BF_UART_S4_FE(v)     ((uint8_t)((uint8_t)(v) << BP_UART_S4_FE) & BM_UART_S4_FE)

/*! @brief Set the FE field to a new value. */
#define BW_UART_S4_FE(x, v)  (BITBAND_ACCESS8(HW_UART_S4_ADDR(x), BP_UART_S4_FE) = (v))
/*@}*/

/*!
 * @name Register UART_S4, field ILCV[1] (RW)
 *
 * This flag indicates that Line Code violation received is not proper. This
 * flag is cleared by writing `1'.
 *
 * Values:
 * - 0 - Line code violation received is proper.
 * - 1 - Line code violation received is improper i.e less than 3-bit periods.
 */
/*@{*/
#define BP_UART_S4_ILCV      (1U)          /*!< Bit position for UART_S4_ILCV. */
#define BM_UART_S4_ILCV      (0x02U)       /*!< Bit mask for UART_S4_ILCV. */
#define BS_UART_S4_ILCV      (1U)          /*!< Bit field size in bits for UART_S4_ILCV. */

/*! @brief Read current value of the UART_S4_ILCV field. */
#define BR_UART_S4_ILCV(x)   (BITBAND_ACCESS8(HW_UART_S4_ADDR(x), BP_UART_S4_ILCV))

/*! @brief Format value for bitfield UART_S4_ILCV. */
#define BF_UART_S4_ILCV(v)   ((uint8_t)((uint8_t)(v) << BP_UART_S4_ILCV) & BM_UART_S4_ILCV)

/*! @brief Set the ILCV field to a new value. */
#define BW_UART_S4_ILCV(x, v) (BITBAND_ACCESS8(HW_UART_S4_ADDR(x), BP_UART_S4_ILCV) = (v))
/*@}*/

/*!
 * @name Register UART_S4, field CDET[3:2] (RW)
 *
 * These bits indicates when the collision occurs during Transmission. This flag
 * is cleared by writing 2'b11. If collision flag is not cleared by software and
 * valid collision pulse is detected during some other phase of transmission,
 * then collision flag will continue to indicate the previous value.
 *
 * Values:
 * - 00 - No collision.
 * - 01 - Collision occurred during preamble.
 * - 10 - Collision occurred during data.
 * - 11 - Collision occurred during line code violation.
 */
/*@{*/
#define BP_UART_S4_CDET      (2U)          /*!< Bit position for UART_S4_CDET. */
#define BM_UART_S4_CDET      (0x0CU)       /*!< Bit mask for UART_S4_CDET. */
#define BS_UART_S4_CDET      (2U)          /*!< Bit field size in bits for UART_S4_CDET. */

/*! @brief Read current value of the UART_S4_CDET field. */
#define BR_UART_S4_CDET(x)   (HW_UART_S4(x).B.CDET)

/*! @brief Format value for bitfield UART_S4_CDET. */
#define BF_UART_S4_CDET(v)   ((uint8_t)((uint8_t)(v) << BP_UART_S4_CDET) & BM_UART_S4_CDET)

/*! @brief Set the CDET field to a new value. */
#define BW_UART_S4_CDET(x, v) (HW_UART_S4_WR(x, (HW_UART_S4_RD(x) & ~BM_UART_S4_CDET) | BF_UART_S4_CDET(v)))
/*@}*/

/*!
 * @name Register UART_S4, field INITF[4] (RO)
 *
 * This bit indicates that initial synchronization is failed and the packet
 * cycle time is expired after enabling EN709 register. This flag is cleared if EN709
 * is cleared.
 *
 * Values:
 * - 0 - Initial synchronization is not failed.
 * - 1 - Initial synchronization is failed.
 */
/*@{*/
#define BP_UART_S4_INITF     (4U)          /*!< Bit position for UART_S4_INITF. */
#define BM_UART_S4_INITF     (0x10U)       /*!< Bit mask for UART_S4_INITF. */
#define BS_UART_S4_INITF     (1U)          /*!< Bit field size in bits for UART_S4_INITF. */

/*! @brief Read current value of the UART_S4_INITF field. */
#define BR_UART_S4_INITF(x)  (BITBAND_ACCESS8(HW_UART_S4_ADDR(x), BP_UART_S4_INITF))
/*@}*/

