flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*******************************************************************************
 * HW_UART_RPL - UART CEA709.1-B Received Packet Length
 ******************************************************************************/

/*!
 * @brief HW_UART_RPL - UART CEA709.1-B Received Packet Length (RO)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_rpl
{
    uint8_t U;
    struct _hw_uart_rpl_bitfields
    {
        uint8_t RPL : 8;               /*!< [7:0] Received packet length */
    } B;
} hw_uart_rpl_t;

/*!
 * @name Constants and macros for entire UART_RPL register
 */
/*@{*/
#define HW_UART_RPL_ADDR(x)      ((uint32_t)(x) + 0x2DU)

#define HW_UART_RPL(x)           (*(__I hw_uart_rpl_t *) HW_UART_RPL_ADDR(x))
#define HW_UART_RPL_RD(x)        (HW_UART_RPL(x).U)
/*@}*/

/*
 * Constants & macros for individual UART_RPL bitfields
 */

/*!
 * @name Register UART_RPL, field RPL[7:0] (RO)
 *
 * This register field indicates the length of received packet in bytes. If the
 * received packet is not byte aligned then the partial byte received is appended
 * by zeros.
 */
/*@{*/
#define BP_UART_RPL_RPL      (0U)          /*!< Bit position for UART_RPL_RPL. */
#define BM_UART_RPL_RPL      (0xFFU)       /*!< Bit mask for UART_RPL_RPL. */
#define BS_UART_RPL_RPL      (8U)          /*!< Bit field size in bits for UART_RPL_RPL. */

/*! @brief Read current value of the UART_RPL_RPL field. */
#define BR_UART_RPL_RPL(x)   (HW_UART_RPL(x).U)
/*@}*/

/*******************************************************************************
 * HW_UART_RPREL - UART CEA709.1-B Received Preamble Length
 ******************************************************************************/

/*!
 * @brief HW_UART_RPREL - UART CEA709.1-B Received Preamble Length (RO)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_rprel
{
    uint8_t U;
    struct _hw_uart_rprel_bitfields
    {
        uint8_t RPREL : 8;             /*!< [7:0] Received preamble length */
    } B;
} hw_uart_rprel_t;

/*!
 * @name Constants and macros for entire UART_RPREL register
 */
/*@{*/
#define HW_UART_RPREL_ADDR(x)    ((uint32_t)(x) + 0x2EU)

#define HW_UART_RPREL(x)         (*(__I hw_uart_rprel_t *) HW_UART_RPREL_ADDR(x))
#define HW_UART_RPREL_RD(x)      (HW_UART_RPREL(x).U)
/*@}*/

/*
 * Constants & macros for individual UART_RPREL bitfields
 */

/*!
 * @name Register UART_RPREL, field RPREL[7:0] (RO)
 *
 * This register field indicates the number of bit sync fields received in the
 * preamble.
 */
/*@{*/
#define BP_UART_RPREL_RPREL  (0U)          /*!< Bit position for UART_RPREL_RPREL. */
#define BM_UART_RPREL_RPREL  (0xFFU)       /*!< Bit mask for UART_RPREL_RPREL. */
#define BS_UART_RPREL_RPREL  (8U)          /*!< Bit field size in bits for UART_RPREL_RPREL. */

/*! @brief Read current value of the UART_RPREL_RPREL field. */
#define BR_UART_RPREL_RPREL(x) (HW_UART_RPREL(x).U)
/*@}*/

/*******************************************************************************
 * HW_UART_CPW - UART CEA709.1-B Collision Pulse Width
 ******************************************************************************/

/*!
 * @brief HW_UART_CPW - UART CEA709.1-B Collision Pulse Width (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_cpw
{
    uint8_t U;
    struct _hw_uart_cpw_bitfields
    {
        uint8_t CPW : 8;               /*!< [7:0] CEA709.1-B CPW register */
    } B;
} hw_uart_cpw_t;

/*!
 * @name Constants and macros for entire UART_CPW register
 */
/*@{*/
#define HW_UART_CPW_ADDR(x)      ((uint32_t)(x) + 0x2FU)

#define HW_UART_CPW(x)           (*(__IO hw_uart_cpw_t *) HW_UART_CPW_ADDR(x))
#define HW_UART_CPW_RD(x)        (HW_UART_CPW(x).U)
#define HW_UART_CPW_WR(x, v)     (HW_UART_CPW(x).U = (v))
#define HW_UART_CPW_SET(x, v)    (HW_UART_CPW_WR(x, HW_UART_CPW_RD(x) |  (v)))
#define HW_UART_CPW_CLR(x, v)    (HW_UART_CPW_WR(x, HW_UART_CPW_RD(x) & ~(v)))
#define HW_UART_CPW_TOG(x, v)    (HW_UART_CPW_WR(x, HW_UART_CPW_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual UART_CPW bitfields
 */

/*!
 * @name Register UART_CPW, field CPW[7:0] (RW)
 *
 * This register indicates the width of valid collision pulse in terms of IPG
 * clock cycles.
 */
/*@{*/
#define BP_UART_CPW_CPW      (0U)          /*!< Bit position for UART_CPW_CPW. */
#define BM_UART_CPW_CPW      (0xFFU)       /*!< Bit mask for UART_CPW_CPW. */
#define BS_UART_CPW_CPW      (8U)          /*!< Bit field size in bits for UART_CPW_CPW. */

/*! @brief Read current value of the UART_CPW_CPW field. */
#define BR_UART_CPW_CPW(x)   (HW_UART_CPW(x).U)

/*! @brief Format value for bitfield UART_CPW_CPW. */
#define BF_UART_CPW_CPW(v)   ((uint8_t)((uint8_t)(v) << BP_UART_CPW_CPW) & BM_UART_CPW_CPW)

/*! @brief Set the CPW field to a new value. */
#define BW_UART_CPW_CPW(x, v) (HW_UART_CPW_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_UART_RIDT - UART CEA709.1-B Receive Indeterminate Time
 ******************************************************************************/

/*!
 * @brief HW_UART_RIDT - UART CEA709.1-B Receive Indeterminate Time (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_ridt
{
    uint8_t U;
    struct _hw_uart_ridt_bitfields
    {
        uint8_t RIDT : 8;              /*!< [7:0] CEA709.1-B Receive IDT Register */
    } B;
} hw_uart_ridt_t;

/*!
 * @name Constants and macros for entire UART_RIDT register
 */
/*@{*/
#define HW_UART_RIDT_ADDR(x)     ((uint32_t)(x) + 0x30U)

#define HW_UART_RIDT(x)          (*(__IO hw_uart_ridt_t *) HW_UART_RIDT_ADDR(x))
#define HW_UART_RIDT_RD(x)       (HW_UART_RIDT(x).U)
#define HW_UART_RIDT_WR(x, v)    (HW_UART_RIDT(x).U = (v))
#define HW_UART_RIDT_SET(x, v)   (HW_UART_RIDT_WR(x, HW_UART_RIDT_RD(x) |  (v)))
#define HW_UART_RIDT_CLR(x, v)   (HW_UART_RIDT_WR(x, HW_UART_RIDT_RD(x) & ~(v)))
#define HW_UART_RIDT_TOG(x, v)   (HW_UART_RIDT_WR(x, HW_UART_RIDT_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual UART_RIDT bitfields
 */

/*!
 * @name Register UART_RIDT, field RIDT[7:0] (RW)
 *
 * This register indicates the indeterminate time period after reception during
 * which any activity on RX line will be discarded. Indeterminate time period
 * value should be less than Beta1 timer value.
 */
/*@{*/
#define BP_UART_RIDT_RIDT    (0U)          /*!< Bit position for UART_RIDT_RIDT. */
#define BM_UART_RIDT_RIDT    (0xFFU)       /*!< Bit mask for UART_RIDT_RIDT. */
#define BS_UART_RIDT_RIDT    (8U)          /*!< Bit field size in bits for UART_RIDT_RIDT. */

/*! @brief Read current value of the UART_RIDT_RIDT field. */
#define BR_UART_RIDT_RIDT(x) (HW_UART_RIDT(x).U)

