flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*******************************************************************************
 * HW_USBDCD_TIMER1 -
 ******************************************************************************/

/*!
 * @brief HW_USBDCD_TIMER1 -  (RW)
 *
 * Reset value: 0x000A0028U
 */
typedef union _hw_usbdcd_timer1
{
    uint32_t U;
    struct _hw_usbdcd_timer1_bitfields
    {
        uint32_t TVDPSRC_ON : 10;      /*!< [9:0] Time Period Comparator Enabled */
        uint32_t RESERVED0 : 6;        /*!< [15:10]  */
        uint32_t TDCD_DBNC : 10;       /*!< [25:16] Time Period to Debounce D+
                                        * Signal */
        uint32_t RESERVED1 : 6;        /*!< [31:26]  */
    } B;
} hw_usbdcd_timer1_t;

/*!
 * @name Constants and macros for entire USBDCD_TIMER1 register
 */
/*@{*/
#define HW_USBDCD_TIMER1_ADDR(x) ((uint32_t)(x) + 0x14U)

#define HW_USBDCD_TIMER1(x)      (*(__IO hw_usbdcd_timer1_t *) HW_USBDCD_TIMER1_ADDR(x))
#define HW_USBDCD_TIMER1_RD(x)   (HW_USBDCD_TIMER1(x).U)
#define HW_USBDCD_TIMER1_WR(x, v) (HW_USBDCD_TIMER1(x).U = (v))
#define HW_USBDCD_TIMER1_SET(x, v) (HW_USBDCD_TIMER1_WR(x, HW_USBDCD_TIMER1_RD(x) |  (v)))
#define HW_USBDCD_TIMER1_CLR(x, v) (HW_USBDCD_TIMER1_WR(x, HW_USBDCD_TIMER1_RD(x) & ~(v)))
#define HW_USBDCD_TIMER1_TOG(x, v) (HW_USBDCD_TIMER1_WR(x, HW_USBDCD_TIMER1_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual USBDCD_TIMER1 bitfields
 */

/*!
 * @name Register USBDCD_TIMER1, field TVDPSRC_ON[9:0] (RW)
 *
 * Sets the amount of time (in ms) that VDP_SRC, IDM_SINK, and the D-/VDAT_REF
 * comparator are enabled and connected to the D+/D- lines during the charging
 * port detection phase of the sequence. Valid values are 1-1023, but the USB
 * Battery Charging Specification requires a minimum value of 40 ms.
 */
/*@{*/
#define BP_USBDCD_TIMER1_TVDPSRC_ON (0U)   /*!< Bit position for USBDCD_TIMER1_TVDPSRC_ON. */
#define BM_USBDCD_TIMER1_TVDPSRC_ON (0x000003FFU) /*!< Bit mask for USBDCD_TIMER1_TVDPSRC_ON. */
#define BS_USBDCD_TIMER1_TVDPSRC_ON (10U)  /*!< Bit field size in bits for USBDCD_TIMER1_TVDPSRC_ON. */

/*! @brief Read current value of the USBDCD_TIMER1_TVDPSRC_ON field. */
#define BR_USBDCD_TIMER1_TVDPSRC_ON(x) (HW_USBDCD_TIMER1(x).B.TVDPSRC_ON)

/*! @brief Format value for bitfield USBDCD_TIMER1_TVDPSRC_ON. */
#define BF_USBDCD_TIMER1_TVDPSRC_ON(v) ((uint32_t)((uint32_t)(v) << BP_USBDCD_TIMER1_TVDPSRC_ON) & BM_USBDCD_TIMER1_TVDPSRC_ON)

/*! @brief Set the TVDPSRC_ON field to a new value. */
#define BW_USBDCD_TIMER1_TVDPSRC_ON(x, v) (HW_USBDCD_TIMER1_WR(x, (HW_USBDCD_TIMER1_RD(x) & ~BM_USBDCD_TIMER1_TVDPSRC_ON) | BF_USBDCD_TIMER1_TVDPSRC_ON(v)))
/*@}*/

/*!
 * @name Register USBDCD_TIMER1, field TDCD_DBNC[25:16] (RW)
 *
 * Sets the amount of time (in ms) to debounce the D+ signal during the data pin
 * contact detection phase (while IDP_SRC and RDM_DWN are enabled). Valid values
 * are 1-1023, but the USB Battery Charging Specification requires a minimum
 * value of 10 ms.
 */
/*@{*/
#define BP_USBDCD_TIMER1_TDCD_DBNC (16U)   /*!< Bit position for USBDCD_TIMER1_TDCD_DBNC. */
#define BM_USBDCD_TIMER1_TDCD_DBNC (0x03FF0000U) /*!< Bit mask for USBDCD_TIMER1_TDCD_DBNC. */
#define BS_USBDCD_TIMER1_TDCD_DBNC (10U)   /*!< Bit field size in bits for USBDCD_TIMER1_TDCD_DBNC. */

/*! @brief Read current value of the USBDCD_TIMER1_TDCD_DBNC field. */
#define BR_USBDCD_TIMER1_TDCD_DBNC(x) (HW_USBDCD_TIMER1(x).B.TDCD_DBNC)

/*! @brief Format value for bitfield USBDCD_TIMER1_TDCD_DBNC. */
#define BF_USBDCD_TIMER1_TDCD_DBNC(v) ((uint32_t)((uint32_t)(v) << BP_USBDCD_TIMER1_TDCD_DBNC) & BM_USBDCD_TIMER1_TDCD_DBNC)

/*! @brief Set the TDCD_DBNC field to a new value. */
#define BW_USBDCD_TIMER1_TDCD_DBNC(x, v) (HW_USBDCD_TIMER1_WR(x, (HW_USBDCD_TIMER1_RD(x) & ~BM_USBDCD_TIMER1_TDCD_DBNC) | BF_USBDCD_TIMER1_TDCD_DBNC(v)))
/*@}*/

/*******************************************************************************
 * HW_USBDCD_TIMER2 -
 ******************************************************************************/

/*!
 * @brief HW_USBDCD_TIMER2 -  (RW)
 *
 * Reset value: 0x00280001U
 *
 * TIMER2 contains timing parameters. Note that register values can be written
 * that are not compliant with the USB Battery Charging Specification v1.1, so
 * care should be taken when overwriting the default values.
 */
typedef union _hw_usbdcd_timer2
{
    uint32_t U;
    struct _hw_usbdcd_timer2_bitfields
    {
        uint32_t CHECK_DM : 4;         /*!< [3:0] Time Before Check of D- Line */
        uint32_t RESERVED0 : 12;       /*!< [15:4]  */
        uint32_t TVDPSRC_CON : 10;     /*!< [25:16] Time Period Before Enabling
                                        * D+ Pullup */
        uint32_t RESERVED1 : 6;        /*!< [31:26]  */
    } B;
} hw_usbdcd_timer2_t;

/*!
 * @name Constants and macros for entire USBDCD_TIMER2 register
 */
/*@{*/
#define HW_USBDCD_TIMER2_ADDR(x) ((uint32_t)(x) + 0x18U)

#define HW_USBDCD_TIMER2(x)      (*(__IO hw_usbdcd_timer2_t *) HW_USBDCD_TIMER2_ADDR(x))
#define HW_USBDCD_TIMER2_RD(x)   (HW_USBDCD_TIMER2(x).U)
#define HW_USBDCD_TIMER2_WR(x, v) (HW_USBDCD_TIMER2(x).U = (v))
#define HW_USBDCD_TIMER2_SET(x, v) (HW_USBDCD_TIMER2_WR(x, HW_USBDCD_TIMER2_RD(x) |  (v)))
#define HW_USBDCD_TIMER2_CLR(x, v) (HW_USBDCD_TIMER2_WR(x, HW_USBDCD_TIMER2_RD(x) & ~(v)))
#define HW_USBDCD_TIMER2_TOG(x, v) (HW_USBDCD_TIMER2_WR(x, HW_USBDCD_TIMER2_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual USBDCD_TIMER2 bitfields
 */

/*!
 * @name Register USBDCD_TIMER2, field CHECK_DM[3:0] (RW)
 *
 * Sets the amount of time (in ms) that the module waits after the device
 * connects to the USB bus (software enables the D+ pullup) until checking the state of
 * the D- line to determine the type of charging port. Valid values are 1-15ms.
 */
/*@{*/
#define BP_USBDCD_TIMER2_CHECK_DM (0U)     /*!< Bit position for USBDCD_TIMER2_CHECK_DM. */
#define BM_USBDCD_TIMER2_CHECK_DM (0x0000000FU) /*!< Bit mask for USBDCD_TIMER2_CHECK_DM. */
#define BS_USBDCD_TIMER2_CHECK_DM (4U)     /*!< Bit field size in bits for USBDCD_TIMER2_CHECK_DM. */

/*! @brief Read current value of the USBDCD_TIMER2_CHECK_DM field. */
#define BR_USBDCD_TIMER2_CHECK_DM(x) (HW_USBDCD_TIMER2(x).B.CHECK_DM)

