flit/argon-rtos/src/include/device/MK20D5/MK20D5_registers.h
/*! @brief Format value for bitfield USBDCD_TIMER2_CHECK_DM. */
#define BF_USBDCD_TIMER2_CHECK_DM(v) ((uint32_t)((uint32_t)(v) << BP_USBDCD_TIMER2_CHECK_DM) & BM_USBDCD_TIMER2_CHECK_DM)

/*! @brief Set the CHECK_DM field to a new value. */
#define BW_USBDCD_TIMER2_CHECK_DM(x, v) (HW_USBDCD_TIMER2_WR(x, (HW_USBDCD_TIMER2_RD(x) & ~BM_USBDCD_TIMER2_CHECK_DM) | BF_USBDCD_TIMER2_CHECK_DM(v)))
/*@}*/

/*!
 * @name Register USBDCD_TIMER2, field TVDPSRC_CON[25:16] (RW)
 *
 * Sets the amount of time (in ms) that the module waits after charging port
 * detection before system software should enable the D+ pullup to connect to the
 * USB host. Valid values are 1-1023, but the USB Battery Charging Specification
 * requires a minimum value of 40 ms.
 */
/*@{*/
#define BP_USBDCD_TIMER2_TVDPSRC_CON (16U) /*!< Bit position for USBDCD_TIMER2_TVDPSRC_CON. */
#define BM_USBDCD_TIMER2_TVDPSRC_CON (0x03FF0000U) /*!< Bit mask for USBDCD_TIMER2_TVDPSRC_CON. */
#define BS_USBDCD_TIMER2_TVDPSRC_CON (10U) /*!< Bit field size in bits for USBDCD_TIMER2_TVDPSRC_CON. */

/*! @brief Read current value of the USBDCD_TIMER2_TVDPSRC_CON field. */
#define BR_USBDCD_TIMER2_TVDPSRC_CON(x) (HW_USBDCD_TIMER2(x).B.TVDPSRC_CON)

/*! @brief Format value for bitfield USBDCD_TIMER2_TVDPSRC_CON. */
#define BF_USBDCD_TIMER2_TVDPSRC_CON(v) ((uint32_t)((uint32_t)(v) << BP_USBDCD_TIMER2_TVDPSRC_CON) & BM_USBDCD_TIMER2_TVDPSRC_CON)

/*! @brief Set the TVDPSRC_CON field to a new value. */
#define BW_USBDCD_TIMER2_TVDPSRC_CON(x, v) (HW_USBDCD_TIMER2_WR(x, (HW_USBDCD_TIMER2_RD(x) & ~BM_USBDCD_TIMER2_TVDPSRC_CON) | BF_USBDCD_TIMER2_TVDPSRC_CON(v)))
/*@}*/

/*******************************************************************************
 * hw_usbdcd_t - module struct
 ******************************************************************************/
/*!
 * @brief All USBDCD module registers.
 */
#pragma pack(1)
typedef struct _hw_usbdcd
{
    __IO hw_usbdcd_control_t CONTROL;      /*!< [0x0] Control Register */
    __IO hw_usbdcd_clock_t CLOCK;          /*!< [0x4] Clock Register */
    __I hw_usbdcd_status_t STATUS;         /*!< [0x8] Status Register */
    uint8_t _reserved0[4];
    __IO hw_usbdcd_timer0_t TIMER0;        /*!< [0x10] TIMER0 Register */
    __IO hw_usbdcd_timer1_t TIMER1;        /*!< [0x14]  */
    __IO hw_usbdcd_timer2_t TIMER2;        /*!< [0x18]  */
} hw_usbdcd_t;
#pragma pack()

/*! @brief Macro to access all USBDCD registers. */
/*! @param x USBDCD module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_USBDCD_REGS(USBDCD_BASE)</code>. */
#define HW_USBDCD_REGS(x) (*(hw_usbdcd_t *)(x))

/*
 * MK20D5 VREF
 *
 * Voltage Reference
 *
 * Registers defined in this header file:
 * - HW_VREF_TRM - VREF Trim Register
 * - HW_VREF_SC - VREF Status and Control Register
 *
 * - hw_vref_t - Struct containing all module registers.
 */

#define HW_VREF_INSTANCE_COUNT (1U) /*!< Number of instances of the VREF module. */
#define HW_VREF (0U) /*!< Instance number for VREF. */

/*******************************************************************************
 * HW_VREF_TRM - VREF Trim Register
 ******************************************************************************/

/*!
 * @brief HW_VREF_TRM - VREF Trim Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register contains bits that contain the trim data for the Voltage
 * Reference.
 */
typedef union _hw_vref_trm
{
    uint8_t U;
    struct _hw_vref_trm_bitfields
    {
        uint8_t TRIM : 6;              /*!< [5:0] Trim bits */
        uint8_t CHOPEN : 1;            /*!< [6] Chop oscillator enable. When set,
                                        * internal chopping operation is enabled and the internal analog offset will be
                                        * minimized. */
        uint8_t RESERVED0 : 1;         /*!< [7]  */
    } B;
} hw_vref_trm_t;

/*!
 * @name Constants and macros for entire VREF_TRM register
 */
/*@{*/
#define HW_VREF_TRM_ADDR(x)      ((uint32_t)(x) + 0x0U)

#define HW_VREF_TRM(x)           (*(__IO hw_vref_trm_t *) HW_VREF_TRM_ADDR(x))
#define HW_VREF_TRM_RD(x)        (HW_VREF_TRM(x).U)
#define HW_VREF_TRM_WR(x, v)     (HW_VREF_TRM(x).U = (v))
#define HW_VREF_TRM_SET(x, v)    (HW_VREF_TRM_WR(x, HW_VREF_TRM_RD(x) |  (v)))
#define HW_VREF_TRM_CLR(x, v)    (HW_VREF_TRM_WR(x, HW_VREF_TRM_RD(x) & ~(v)))
#define HW_VREF_TRM_TOG(x, v)    (HW_VREF_TRM_WR(x, HW_VREF_TRM_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual VREF_TRM bitfields
 */

/*!
 * @name Register VREF_TRM, field TRIM[5:0] (RW)
 *
 * These bits change the resulting VREF by approximately +/- 0.5 mV for each
 * step. Min = minimum and max = maximum voltage reference output. For minimum and
 * maximum voltage reference output values, refer to the Data Sheet for this chip.
 *
 * Values:
 * - 000000 - Min
 * - 111111 - Max
 */
/*@{*/
#define BP_VREF_TRM_TRIM     (0U)          /*!< Bit position for VREF_TRM_TRIM. */
#define BM_VREF_TRM_TRIM     (0x3FU)       /*!< Bit mask for VREF_TRM_TRIM. */
#define BS_VREF_TRM_TRIM     (6U)          /*!< Bit field size in bits for VREF_TRM_TRIM. */

/*! @brief Read current value of the VREF_TRM_TRIM field. */
#define BR_VREF_TRM_TRIM(x)  (HW_VREF_TRM(x).B.TRIM)

/*! @brief Format value for bitfield VREF_TRM_TRIM. */
#define BF_VREF_TRM_TRIM(v)  ((uint8_t)((uint8_t)(v) << BP_VREF_TRM_TRIM) & BM_VREF_TRM_TRIM)

/*! @brief Set the TRIM field to a new value. */
#define BW_VREF_TRM_TRIM(x, v) (HW_VREF_TRM_WR(x, (HW_VREF_TRM_RD(x) & ~BM_VREF_TRM_TRIM) | BF_VREF_TRM_TRIM(v)))
/*@}*/

/*!
 * @name Register VREF_TRM, field CHOPEN[6] (RW)
 *
 * Values:
 * - 0 - Chop oscillator is disabled.
 * - 1 - Chop oscillator is enabled.
 */
/*@{*/
#define BP_VREF_TRM_CHOPEN   (6U)          /*!< Bit position for VREF_TRM_CHOPEN. */
#define BM_VREF_TRM_CHOPEN   (0x40U)       /*!< Bit mask for VREF_TRM_CHOPEN. */
#define BS_VREF_TRM_CHOPEN   (1U)          /*!< Bit field size in bits for VREF_TRM_CHOPEN. */

